-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  E:\analyses\ethnicity-covid-research/output/log\06b_eth_an_multiva
> riable_eth5.log
  log type:  text
 opened on:  23 Jul 2020, 06:50:37

. 
. cap file close tablecontent

. file open tablecontent using $Tabfigdir/table2_eth5.txt, write text replace
(note: file E:\analyses\ethnicity-covid-research/output/tabfig/table2_eth5.txt 
> not found)

. file write tablecontent ("Table 2: Association between ethnicity in five cate
> gories and COVID-19 outcomes - Complete Case Analysis") _n

. file write tablecontent _tab ("Number of events") _tab ("Total person-weeks")
>  _tab ("Rate per 1,000") _tab ("Crude") _tab _tab ("Age/Sex/IMD Adjusted") _t
> ab _tab       ("+ co-morbidities") _tab _tab  ("+ household size)") _tab _tab
>  _n

. file write tablecontent _tab _tab _tab _tab   ("HR") _tab ("95% CI") _tab ("H
> R") _tab ("95% CI") _tab ("HR") _tab ("95% CI") _tab ("HR") _tab ("95% CI") _
> n

. 
. 
. 
. foreach i of global outcomes {
  2. * Open Stata dataset
. use "$Tempdir/analysis_dataset_STSET_`i'.dta", clear
  3. 
. /* Sense check outcomes======================================================
> =*/ 
. 
. tab eth5 `i', missing row
  4. 
. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. stcox i.eth5 
  5. estimates save "$Tempdir/crude_`i'_eth5", replace 
  6. parmest, label eform format(estimate p lb ub) saving("$Tempdir/crude_`i'_e
> th5", replace) idstr("crude_`i'_eth5") 
  7. 
. /* Multivariable models */ 
. 
. * Age, Gender, IMD
. * Age fit as spline in first instance, categorical below 
. 
. stcox i.eth5 i.male age1 age2 age3 i.imd, strata(stp)
  8. estimates save "$Tempdir/model1_`i'_eth5", replace 
  9. parmest, label eform format(estimate p lb ub) saving("$Tempdir/model1_`i'_
> eth5", replace) idstr("model1_`i'_eth5") 
 10. 
. * Age, Gender, IMD and Comorbidities  
. stcox i.eth5 i.male age1 age2 age3      i.imd                                
>                    ///
>                                                                              
>    bmi                                                     ///
>                                                                              
>    gp_consult_count                        ///
>                                                                              
>    i.smoke_nomiss                          ///
>                                                                              
>    i.htdiag_or_highbp                      ///     
>                                                                              
>    i.asthma                                        ///
>                                                                              
>    i.chronic_cardiac_disease       ///
>                                                                              
>    i.dm_type                                       ///     
>                                                                              
>    i.cancer                    ///
>                                                                              
>    i.chronic_liver_disease         ///
>                                                                              
>    i.stroke                                        ///
>                                                                              
>    i.dementia                                      ///
>                                                                              
>    i.other_neuro                           ///
>                                                                              
>    i.ckd                                           ///
>                                                                              
>    i.esrf                                          ///
>                                                                              
>    i.perm_immunodef                        ///
>                                                                              
>    i.temp_immunodef                        ///
>                                                                              
>    i.other_immuno                          ///
>                                                                              
>    i.ra_sle_psoriasis, strata(stp)                         
 11.                                                                           
>       
. estimates save "$Tempdir/model2_`i'_eth5", replace 
 12. parmest, label eform format(estimate p lb ub) saving("$Tempdir/model2_`i'_
> eth5", replace) idstr("model2_`i'_eth5") 
 13. 
. * Age, Gender, IMD and Comorbidities and household size
. 
. stcox i.eth5 i.male age1 age2 age3 i.imd hh_size                             
>            ///
>                                                                              
>    bmi                                                     ///
>                                                                              
>    gp_consult_count                        ///
>                                                                              
>    i.smoke_nomiss                          ///
>                                                                              
>    i.htdiag_or_highbp                      ///     
>                                                                              
>    i.asthma                                        ///
>                                                                              
>    i.chronic_cardiac_disease       ///
>                                                                              
>    i.dm_type                                       ///     
>                                                                              
>    i.cancer                    ///
>                                                                              
>    i.chronic_liver_disease         ///
>                                                                              
>    i.stroke                                        ///
>                                                                              
>    i.dementia                                      ///
>                                                                              
>    i.other_neuro                           ///
>                                                                              
>    i.ckd                                           ///
>                                                                              
>    i.esrf                                          ///
>                                                                              
>    i.perm_immunodef                        ///
>                                                                              
>    i.temp_immunodef                        ///
>                                                                              
>    i.other_immuno                          ///
>                                                                              
>    i.ra_sle_psoriasis, strata(stp)                         
 14.                                                                           
>       
. estimates save "$Tempdir/model3_`i'_eth5", replace
 15. parmest, label eform format(estimate p lb ub) saving("$Tempdir/model3_`i'_
> eth5", replace) idstr("model3_`i'_eth5") 
 16. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. 
. * Column headings 
. file write tablecontent ("Outcome: `i'") _n
 17. 
. * Row headings 
. local lab1: label eth5 1
 18. local lab2: label eth5 2
 19. local lab3: label eth5 3
 20. local lab4: label eth5 4
 21. local lab5: label eth5 5
 22. 
. /* Counts */
.  
. * First row, eth5 = 1 (White) reference cat
.         count if eth5 == 1 & `i' == 1
 23.         local event = r(N)
 24.     bysort eth5: egen total_follow_up = total(_t)
 25.         su total_follow_up if eth5 == 1
 26.         local person_week = r(mean)/7
 27.         local rate = 1000*(`event'/`person_week')
 28.         
.         file write tablecontent  ("`lab1'") _tab (`event') _tab %10.0f (`pers
> on_week') _tab %3.2f (`rate') _tab
 29.         file write tablecontent ("1.00 (ref)") _tab _tab ("1.00 (ref)") _t
> ab _tab ("1.00 (ref)")  _tab _tab ("1.00 (ref)") _n
 30.         
. * Subsequent ethnic groups
. forvalues eth=2/5 {
 31.         
.         count if eth5 == `eth' & `i' == 1
 32.         local event = r(N)
 33.         su total_follow_up if eth5 == `eth'
 34.         local person_week = r(mean)/7
 35.         local rate = 1000*(`event'/`person_week')
 36.         file write tablecontent  ("`lab`eth''") _tab   (`event') _tab %10.
> 0f (`person_week') _tab %3.2f (`rate') _tab  
 37.         cap estimates use "$Tempdir/crude_`i'_eth5" 
 38.         cap lincom `eth'.eth5, eform
 39.         file write tablecontent  %4.2f (r(estimate)) _tab %4.2f (r(lb)) ("
>  - ") %4.2f (r(ub)) _tab 
 40.         cap estimates clear
 41.         cap estimates use "$Tempdir/model1_`i'_eth5" 
 42.         cap lincom `eth'.eth5, eform
 43.         file write tablecontent  %4.2f (r(estimate)) _tab %4.2f (r(lb)) ("
>  - ") %4.2f (r(ub)) _tab 
 44.         cap estimates clear
 45.         cap estimates use "$Tempdir/model2_`i'_eth5" 
 46.         cap lincom `eth'.eth5, eform
 47.         file write tablecontent  %4.2f (r(estimate)) _tab %4.2f (r(lb)) ("
>  - ") %4.2f (r(ub)) _tab 
 48.         cap estimates clear
 49.         cap estimates use "$Tempdir/model3_`i'_eth5" 
 50.         cap lincom `eth'.eth5, eform
 51.         file write tablecontent  %4.2f (r(estimate)) _tab %4.2f (r(lb)) ("
>  - ") %4.2f (r(ub)) _n
 52. }  //end ethnic group
 53. 
. 
. } //end outcomes

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

      Eth 5 |    outcome tested
 categories |         0          1 |     Total
------------+----------------------+----------
      White |10,481,142    492,358 |10,973,500 
            |     95.51       4.49 |    100.00 
------------+----------------------+----------
South Asian |   985,011     45,800 | 1,030,811 
            |     95.56       4.44 |    100.00 
------------+----------------------+----------
      Black |   328,826     14,649 |   343,475 
            |     95.74       4.26 |    100.00 
------------+----------------------+----------
      Mixed |   164,781      6,842 |   171,623 
            |     96.01       3.99 |    100.00 
------------+----------------------+----------
      Other |   314,836      9,120 |   323,956 
            |     97.18       2.82 |    100.00 
------------+----------------------+----------
          . | 4,407,890    178,434 | 4,586,324 
            |     96.11       3.89 |    100.00 
------------+----------------------+----------
      Total |16,682,486    747,203 |17,429,689 
            |     95.71       4.29 |    100.00 

         failure _d:  tested
   analysis time _t:  (stime_tested-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -9295607.5
Iteration 1:   log likelihood = -9294402.8
Iteration 2:   log likelihood = -9294363.6
Iteration 3:   log likelihood = -9294363.5
Refining estimates:
Iteration 0:   log likelihood = -9294363.5

Cox regression -- Breslow method for ties

No. of subjects =   12,843,365                  Number of obs    =  12,843,365
No. of failures =      568,769
Time at risk    =   2282931656
                                                LR chi2(4)       =     2488.04
Log likelihood  =   -9294363.5                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .9868996   .0048212    -2.70   0.007     .9774953    .9963943
      Black  |   .9491594    .007958    -6.22   0.000     .9336896    .9648856
      Mixed  |   .8845365   .0107677   -10.08   0.000     .8636821    .9058945
      Other  |   .6211435   .0065642   -45.06   0.000     .6084103    .6341432
------------------------------------------------------------------------------
file E:\analyses\ethnicity-covid-research/output/tempdata/crude_tested_eth5.ste
> r saved
file E:\analyses\ethnicity-covid-research/output/tempdata/crude_tested_eth5.dta
>  saved

         failure _d:  tested
   analysis time _t:  (stime_tested-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -7388153.1
Iteration 1:   log likelihood = -7354228.8
Iteration 2:   log likelihood = -7345650.9
Iteration 3:   log likelihood = -7345527.1
Iteration 4:   log likelihood = -7345527.1
Refining estimates:
Iteration 0:   log likelihood = -7345527.1

Stratified Cox regr. -- Breslow method for ties

No. of subjects =   12,729,478                  Number of obs    =  12,729,478
No. of failures =      562,881
Time at risk    =   2262719135
                                                LR chi2(12)      =    85251.99
Log likelihood  =   -7345527.1                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.089546   .0057174    16.34   0.000     1.078397    1.100809
      Black  |   1.059279   .0091619     6.66   0.000     1.041473    1.077389
      Mixed  |   1.028982   .0127157     2.31   0.021     1.004359    1.054209
      Other  |   .7212367   .0077647   -30.35   0.000     .7061777    .7366169
             |
        male |
       Male  |   .7374247   .0020088  -111.81   0.000     .7334979    .7413724
        age1 |   1.033138   .0004509    74.70   0.000     1.032255    1.034022
        age2 |    .888848   .0012121   -86.41   0.000     .8864755    .8912268
        age3 |   1.486207   .0055624   105.87   0.000     1.475344    1.497149
             |
         imd |
          2  |   1.042971   .0045016     9.75   0.000     1.034186    1.051832
          3  |   1.086633   .0047028    19.20   0.000     1.077454    1.095889
          4  |   1.161311   .0050304    34.52   0.000     1.151493    1.171213
5 most de..  |   1.213408   .0054942    42.72   0.000     1.202687    1.224224
------------------------------------------------------------------------------
                                                             Stratified by stp
file E:\analyses\ethnicity-covid-research/output/tempdata/model1_tested_eth5.st
> er saved
file E:\analyses\ethnicity-covid-research/output/tempdata/model1_tested_eth5.dt
> a saved

         failure _d:  tested
   analysis time _t:  (stime_tested-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: 1.asthma omitted because of collinearity
Iteration 0:   log likelihood = -5807210.1
Iteration 1:   log likelihood =   -5769041
Iteration 2:   log likelihood = -5743720.6
Iteration 3:   log likelihood = -5739434.5
Iteration 4:   log likelihood = -5738925.7
Iteration 5:   log likelihood = -5738910.5
Iteration 6:   log likelihood = -5738910.5
Refining estimates:
Iteration 0:   log likelihood = -5738910.5

Stratified Cox regr. -- Breslow method for ties

No. of subjects =    8,830,727                  Number of obs    =   8,830,727
No. of failures =      455,070
Time at risk    =   1564347371
                                                LR chi2(35)      =   136599.33
Log likelihood  =   -5738910.5                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.034616   .0063427     5.55   0.000     1.022259    1.047123
      Black  |   1.061935   .0105351     6.06   0.000     1.041486    1.082785
      Mixed  |    1.05166   .0152265     3.48   0.001     1.022236    1.081931
      Other  |   .8776719   .0112901   -10.14   0.000     .8558204    .9000814
             |
        male |
       Male  |   .8130891   .0025402   -66.23   0.000     .8081257    .8180831
        age1 |   1.018655    .000593    31.75   0.000     1.017494    1.019818
        age2 |    .894521   .0015442   -64.57   0.000     .8914995    .8975528
        age3 |   1.441964      .0067    78.77   0.000     1.428892    1.455156
             |
         imd |
          2  |   1.034616   .0049825     7.07   0.000     1.024897    1.044428
          3  |   1.070861   .0051808    14.15   0.000     1.060755    1.081064
          4  |     1.1308    .005502    25.26   0.000     1.120067    1.141635
5 most de..  |   1.156794   .0059295    28.42   0.000      1.14523    1.168474
             |
         bmi |   1.001677   .0002727     6.15   0.000     1.001142    1.002211
gp_consult~t |   1.011601   .0000541   215.58   0.000     1.011495    1.011707
             |
smoke_nomiss |
     Former  |   1.075121   .0036206    21.51   0.000     1.068048     1.08224
    Current  |   1.066551    .004932    13.93   0.000     1.056928    1.076261
             |
1.htdiag_o~p |   .9982133   .0035957    -0.50   0.620     .9911906    1.005286
    1.asthma |          1  (omitted)
1.~c_disease |   1.483369   .0067115    87.15   0.000     1.470273    1.496582
             |
     dm_type |
       T1DM  |   1.416807   .0205733    23.99   0.000     1.377052    1.457709
       T2DM  |   1.152361   .0053727    30.42   0.000     1.141879    1.162939
 UNKNOWN_DM  |   1.034547   .0085853     4.09   0.000     1.017856    1.051512
             |
    1.cancer |     1.6916   .0077979   114.04   0.000     1.676385    1.706952
1.~r_disease |   1.866637   .0218241    53.38   0.000     1.824349    1.909906
    1.stroke |   1.596382   .0100522    74.28   0.000     1.576801    1.616206
  1.dementia |   2.828169   .0339165    86.69   0.000     2.762469    2.895432
1.other_ne~o |    1.75838   .0165228    60.06   0.000     1.726293    1.791065
             |
         ckd |
          2  |   1.071652   .0064271    11.54   0.000     1.059129    1.084323
          3  |   1.302872   .0105894    32.55   0.000     1.282282    1.323793
          4  |   1.703178   .0217229    41.75   0.000      1.66113    1.746291
          5  |   3.739367   .0828222    59.55   0.000     3.580512    3.905271
             |
      1.esrf |   2.068836   .0461073    32.62   0.000     1.980412    2.161207
1.perm_imm~f |   .8957945   .1038763    -0.95   0.343     .7136794    1.124381
1.temp_imm~f |   1.766131   .1847029     5.44   0.000     1.438811    2.167914
1.other_im~o |   1.280416   .1481587     2.14   0.033     1.020604    1.606367
1.ra_sle_p~s |   1.068812   .0061434    11.58   0.000     1.056839    1.080921
------------------------------------------------------------------------------
                                                             Stratified by stp
file E:\analyses\ethnicity-covid-research/output/tempdata/model2_tested_eth5.st
> er saved
file E:\analyses\ethnicity-covid-research/output/tempdata/model2_tested_eth5.dt
> a saved

         failure _d:  tested
   analysis time _t:  (stime_tested-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: 1.asthma omitted because of collinearity
Iteration 0:   log likelihood = -5807210.1
Iteration 1:   log likelihood = -5768962.4
Iteration 2:   log likelihood = -5743008.7
Iteration 3:   log likelihood = -5738626.8
Iteration 4:   log likelihood = -5738111.5
Iteration 5:   log likelihood = -5738096.3
Iteration 6:   log likelihood = -5738096.3
Refining estimates:
Iteration 0:   log likelihood = -5738096.3

Stratified Cox regr. -- Breslow method for ties

No. of subjects =    8,830,727                  Number of obs    =   8,830,727
No. of failures =      455,070
Time at risk    =   1564347371
                                                LR chi2(36)      =   138227.71
Log likelihood  =   -5738096.3                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.032601     .00633     5.23   0.000     1.020268    1.045082
      Black  |   1.060696   .0105228     5.94   0.000     1.040271    1.081522
      Mixed  |   1.049522   .0151953     3.34   0.001     1.020158    1.079731
      Other  |   .8727561   .0112264   -10.58   0.000     .8510277    .8950392
             |
        male |
       Male  |   .8118266   .0025365   -66.72   0.000     .8068703    .8168134
        age1 |    1.01969   .0005936    33.49   0.000     1.018527    1.020854
        age2 |   .8927155   .0015404   -65.77   0.000     .8897015    .8957397
        age3 |   1.448378   .0067259    79.77   0.000     1.435255    1.461621
             |
         imd |
          2  |   1.033412   .0049767     6.82   0.000     1.023704    1.043212
          3  |   1.071684   .0051849    14.31   0.000      1.06157    1.081895
          4  |   1.132723   .0055117    25.61   0.000     1.121972    1.143578
5 most de..  |   1.158698   .0059397    28.73   0.000     1.147115    1.170398
             |
     hh_size |   1.001412   .0000234    60.31   0.000     1.001366    1.001458
         bmi |   1.001795   .0002727     6.59   0.000     1.001261     1.00233
gp_consult~t |   1.011607    .000054   216.06   0.000     1.011501    1.011713
             |
smoke_nomiss |
     Former  |   1.076471   .0036262    21.88   0.000     1.069387    1.083602
    Current  |    1.06781   .0049383    14.19   0.000     1.058175    1.077533
             |
1.htdiag_o~p |   .9983649   .0035962    -0.45   0.650     .9913413    1.005438
    1.asthma |          1  (omitted)
1.~c_disease |   1.483286    .006711    87.14   0.000     1.470191    1.496498
             |
     dm_type |
       T1DM  |   1.418567   .0205991    24.08   0.000     1.378763    1.459521
       T2DM  |   1.152066   .0053712    30.36   0.000     1.141587    1.162641
 UNKNOWN_DM  |   1.034075   .0085815     4.04   0.000     1.017392    1.051032
             |
    1.cancer |    1.69216   .0078001   114.11   0.000     1.676941    1.707518
1.~r_disease |   1.866524   .0218228    53.38   0.000     1.824239     1.90979
    1.stroke |   1.595058   .0100442    74.15   0.000     1.575492    1.614866
  1.dementia |   2.803802   .0336287    85.96   0.000      2.73866    2.870494
1.other_ne~o |   1.757665   .0165165    60.02   0.000      1.72559    1.790337
             |
         ckd |
          2  |   1.071519   .0064264    11.52   0.000     1.058997    1.084189
          3  |    1.30203   .0105828    32.47   0.000     1.281452    1.322938
          4  |   1.701679   .0217038    41.68   0.000     1.659667    1.744753
          5  |   3.737222   .0827687    59.53   0.000     3.578469    3.903018
             |
      1.esrf |   2.070754   .0461482    32.66   0.000     1.982252    2.163207
1.perm_imm~f |   .9001946   .1043851    -0.91   0.365     .7171872    1.129901
1.temp_imm~f |   1.775495   .1856866     5.49   0.000     1.446433    2.179419
1.other_im~o |   1.275061   .1475422     2.10   0.036     1.016332    1.599657
1.ra_sle_p~s |   1.068839   .0061437    11.58   0.000     1.056865    1.080948
------------------------------------------------------------------------------
                                                             Stratified by stp
file E:\analyses\ethnicity-covid-research/output/tempdata/model3_tested_eth5.st
> er saved
file E:\analyses\ethnicity-covid-research/output/tempdata/model3_tested_eth5.dt
> a saved
  492,358

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p | 10,973,500    1.95e+09           0   1.95e+09   1.95e+09
  45,800

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |  1,030,811    1.84e+08           0   1.84e+08   1.84e+08
  14,649

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    343,475    6.11e+07           0   6.11e+07   6.11e+07
  6,842

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    171,623    3.06e+07           0   3.06e+07   3.06e+07
  9,120

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    323,956    5.80e+07           0   5.80e+07   5.80e+07

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

      Eth 5 | outcome positivetest
 categories |         0          1 |     Total
------------+----------------------+----------
      White |10,929,223     44,295 |10,973,518 
            |     99.60       0.40 |    100.00 
------------+----------------------+----------
South Asian | 1,022,595      8,217 | 1,030,812 
            |     99.20       0.80 |    100.00 
------------+----------------------+----------
      Black |   341,226      2,251 |   343,477 
            |     99.34       0.66 |    100.00 
------------+----------------------+----------
      Mixed |   170,824        800 |   171,624 
            |     99.53       0.47 |    100.00 
------------+----------------------+----------
      Other |   322,773      1,190 |   323,963 
            |     99.63       0.37 |    100.00 
------------+----------------------+----------
          . | 4,569,407     16,922 | 4,586,329 
            |     99.63       0.37 |    100.00 
------------+----------------------+----------
      Total |17,356,048     73,675 |17,429,723 
            |     99.58       0.42 |    100.00 

         failure _d:  positivetest
   analysis time _t:  (stime_positivetest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -928679.03
Iteration 1:   log likelihood = -927295.22
Iteration 2:   log likelihood = -927132.72
Iteration 3:   log likelihood = -927132.09
Iteration 4:   log likelihood = -927132.09
Refining estimates:
Iteration 0:   log likelihood = -927132.09

Cox regression -- Breslow method for ties

No. of subjects =   12,843,394                  Number of obs    =  12,843,394
No. of failures =       56,753
Time at risk    =   2313555882
                                                LR chi2(4)       =     3093.90
Log likelihood  =   -927132.09                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.973213   .0237011    56.58   0.000     1.927302    2.020217
      Black  |   1.623305   .0350733    22.42   0.000     1.555998    1.693524
      Mixed  |    1.15264   .0411183     3.98   0.000     1.074803    1.236115
      Other  |   .9078858   .0266695    -3.29   0.001     .8570909    .9616911
------------------------------------------------------------------------------
file E:\analyses\ethnicity-covid-research/output/tempdata/crude_positivetest_et
> h5.ster saved
file E:\analyses\ethnicity-covid-research/output/tempdata/crude_positivetest_et
> h5.dta saved

         failure _d:  positivetest
   analysis time _t:  (stime_positivetest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -744050.74
Iteration 1:   log likelihood = -738659.03
Iteration 2:   log likelihood = -733530.39
Iteration 3:   log likelihood = -733371.74
Iteration 4:   log likelihood = -733371.41
Refining estimates:
Iteration 0:   log likelihood = -733371.41

Stratified Cox regr. -- Breslow method for ties

No. of subjects =   12,729,506                  Number of obs    =  12,729,506
No. of failures =       56,257
Time at risk    =   2293018062
                                                LR chi2(12)      =    21358.66
Log likelihood  =   -733371.41                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   2.143382     .02859    57.16   0.000     2.088073    2.200156
      Black  |   1.858819   .0418171    27.56   0.000      1.77864    1.942613
      Mixed  |   1.493618   .0540764    11.08   0.000     1.391303    1.603457
      Other  |   1.179699   .0353271     5.52   0.000     1.112452    1.251011
             |
        male |
       Male  |   .8383368   .0071694   -20.62   0.000     .8244021     .852507
        age1 |   1.049723   .0015386    33.11   0.000     1.046712    1.052743
        age2 |   .8463752   .0037761   -37.38   0.000     .8390064    .8538087
        age3 |   1.748533   .0211004    46.30   0.000     1.707662    1.790382
             |
         imd |
          2  |   1.134074   .0168223     8.48   0.000     1.101578    1.167529
          3  |   1.272053   .0186002    16.46   0.000     1.236114    1.309036
          4  |   1.424865   .0203467    24.80   0.000     1.385539    1.465307
5 most de..  |    1.55098   .0224223    30.36   0.000      1.50765    1.595556
------------------------------------------------------------------------------
                                                             Stratified by stp
file E:\analyses\ethnicity-covid-research/output/tempdata/model1_positivetest_e
> th5.ster saved
file E:\analyses\ethnicity-covid-research/output/tempdata/model1_positivetest_e
> th5.dta saved

         failure _d:  positivetest
   analysis time _t:  (stime_positivetest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: 1.asthma omitted because of collinearity
Iteration 0:   log likelihood = -583209.11
Iteration 1:   log likelihood = -574673.22
Iteration 2:   log likelihood = -570666.84
Iteration 3:   log likelihood = -570426.68
Iteration 4:   log likelihood =  -570424.8
Iteration 5:   log likelihood =  -570424.8
Refining estimates:
Iteration 0:   log likelihood =  -570424.8

Stratified Cox regr. -- Breslow method for ties

No. of subjects =    8,830,743                  Number of obs    =   8,830,743
No. of failures =       45,322
Time at risk    =   1588912158
                                                LR chi2(35)      =    25568.62
Log likelihood  =    -570424.8                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.863782   .0295559    39.26   0.000     1.806744     1.92262
      Black  |   1.726111   .0442197    21.31   0.000     1.641582    1.814993
      Mixed  |   1.498891    .063354     9.58   0.000     1.379724    1.628351
      Other  |   1.428633   .0502909    10.13   0.000     1.333388    1.530681
             |
        male |
       Male  |   .9236234   .0090846    -8.08   0.000     .9059884    .9416017
        age1 |   1.041518   .0021151    20.03   0.000      1.03738    1.045671
        age2 |   .8339842   .0048493   -31.22   0.000     .8245338     .843543
        age3 |   1.802376   .0277036    38.33   0.000     1.748887      1.8575
             |
         imd |
          2  |   1.125935   .0186442     7.16   0.000      1.08998    1.163077
          3  |   1.247753   .0204357    13.51   0.000     1.208336    1.288456
          4  |   1.403777   .0225041    21.16   0.000     1.360356    1.448585
5 most de..  |   1.537124   .0250866    26.34   0.000     1.488733    1.587087
             |
         bmi |   1.017912    .000863    20.94   0.000     1.016222    1.019605
gp_consult~t |   1.008203   .0003124    26.37   0.000     1.007591    1.008815
             |
smoke_nomiss |
     Former  |   1.065504   .0111261     6.08   0.000     1.043918    1.087535
    Current  |   .6155264   .0109364   -27.31   0.000     .5944604    .6373389
             |
1.htdiag_o~p |   .9812047   .0112991    -1.65   0.099     .9593068    1.003602
    1.asthma |          1  (omitted)
1.~c_disease |   1.246152   .0171716    15.97   0.000     1.212947    1.280266
             |
     dm_type |
       T1DM  |   1.353912   .0664838     6.17   0.000      1.22968    1.490695
       T2DM  |   1.305455   .0174382    19.95   0.000     1.271721    1.340085
 UNKNOWN_DM  |   1.036008   .0255819     1.43   0.152     .9870622     1.08738
             |
    1.cancer |   1.192954   .0186798    11.27   0.000     1.156898    1.230133
1.~r_disease |   1.506229   .0611882    10.08   0.000     1.390953     1.63106
    1.stroke |   1.597116     .02894    25.84   0.000      1.54139    1.654856
  1.dementia |   3.587331   .1015725    45.12   0.000     3.393675    3.792037
1.other_ne~o |   1.921818   .0523296    23.99   0.000     1.821943    2.027168
             |
         ckd |
          2  |   1.135068   .0199332     7.21   0.000     1.096665    1.174817
          3  |   1.420853   .0317971    15.70   0.000     1.359879    1.484561
          4  |   1.864094   .0627696    18.49   0.000      1.74504     1.99127
          5  |   3.694013   .2218778    21.76   0.000     3.283763    4.155518
             |
      1.esrf |    2.34483   .1455559    13.73   0.000     2.076217    2.648194
1.perm_imm~f |   .6985025   .2691171    -0.93   0.352     .3282611    1.486334
1.temp_imm~f |   1.888382   .6692082     1.79   0.073      .942843    3.782162
1.other_im~o |   1.445603   .5557035     0.96   0.338     .6805174    3.070853
1.ra_sle_p~s |   1.047242   .0193412     2.50   0.012     1.010012    1.085845
------------------------------------------------------------------------------
                                                             Stratified by stp
file E:\analyses\ethnicity-covid-research/output/tempdata/model2_positivetest_e
> th5.ster saved
file E:\analyses\ethnicity-covid-research/output/tempdata/model2_positivetest_e
> th5.dta saved

         failure _d:  positivetest
   analysis time _t:  (stime_positivetest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: 1.asthma omitted because of collinearity
Iteration 0:   log likelihood = -583209.11
Iteration 1:   log likelihood = -574798.71
Iteration 2:   log likelihood = -570471.65
Iteration 3:   log likelihood = -570151.82
Iteration 4:   log likelihood = -570142.06
Iteration 5:   log likelihood = -570141.79
Iteration 6:   log likelihood = -570141.79
Refining estimates:
Iteration 0:   log likelihood = -570141.79

Stratified Cox regr. -- Breslow method for ties

No. of subjects =    8,830,743                  Number of obs    =   8,830,743
No. of failures =       45,322
Time at risk    =   1588912158
                                                LR chi2(36)      =    26134.63
Log likelihood  =   -570141.79                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.861879   .0295266    39.20   0.000     1.804898    1.920659
      Black  |   1.725513    .044205    21.29   0.000     1.641012    1.814365
      Mixed  |   1.497208    .063282     9.55   0.000     1.378177    1.626521
      Other  |   1.419815   .0499738     9.96   0.000      1.32517    1.521219
             |
        male |
       Male  |   .9209615   .0090612    -8.37   0.000     .9033721    .9388934
        age1 |   1.043126   .0021161    20.81   0.000     1.038986    1.047281
        age2 |   .8317224   .0048293   -31.73   0.000     .8223108    .8412416
        age3 |   1.812196   .0278143    38.74   0.000     1.758493     1.86754
             |
         imd |
          2  |   1.123879   .0186103     7.05   0.000     1.087989    1.160952
          3  |   1.245969   .0204135    13.42   0.000     1.206595    1.286628
          4  |   1.406532   .0225492    21.28   0.000     1.363023    1.451429
5 most de..  |   1.539881   .0251324    26.45   0.000     1.491402    1.589936
             |
     hh_size |   1.001939   .0000461    42.11   0.000     1.001848    1.002029
         bmi |   1.018085    .000863    21.15   0.000     1.016395    1.019778
gp_consult~t |   1.008237   .0003105    26.63   0.000     1.007628    1.008846
             |
smoke_nomiss |
     Former  |   1.067554   .0111514     6.26   0.000      1.04592    1.089636
    Current  |   .6152427   .0109352   -27.33   0.000     .5941791     .637053
             |
1.htdiag_o~p |   .9814146   .0113005    -1.63   0.103      .959514    1.003815
    1.asthma |          1  (omitted)
1.~c_disease |   1.246208   .0171706    15.97   0.000     1.213004     1.28032
             |
     dm_type |
       T1DM  |   1.356798   .0666276     6.21   0.000     1.232298    1.493877
       T2DM  |   1.304961   .0174306    19.93   0.000     1.271241    1.339576
 UNKNOWN_DM  |   1.035394   .0255666     1.41   0.159      .986478    1.086737
             |
    1.cancer |   1.193569   .0186882    11.30   0.000     1.157497    1.230765
1.~r_disease |   1.506443   .0611971    10.09   0.000      1.39115    1.631291
    1.stroke |   1.594531   .0288941    25.75   0.000     1.538894     1.65218
  1.dementia |    3.53667   .1001537    44.61   0.000      3.34572    3.738517
1.other_ne~o |   1.919917   .0522802    23.95   0.000     1.820136    2.025168
             |
         ckd |
          2  |   1.135041   .0199334     7.21   0.000     1.096637     1.17479
          3  |   1.419546   .0317693    15.65   0.000     1.358625    1.483198
          4  |    1.86185   .0626931    18.46   0.000      1.74294    1.988871
          5  |   3.690815   .2216438    21.74   0.000     3.280993    4.151828
             |
      1.esrf |   2.348863   .1457919    13.76   0.000     2.079814    2.652718
1.perm_imm~f |   .7043278    .271354    -0.91   0.363     .3310055    1.498699
1.temp_imm~f |   1.905638   .6753442     1.82   0.069     .9514387    3.816805
1.other_im~o |   1.435203   .5517211     0.94   0.347     .6756071    3.048825
1.ra_sle_p~s |   1.047027   .0193375     2.49   0.013     1.009804    1.085623
------------------------------------------------------------------------------
                                                             Stratified by stp
file E:\analyses\ethnicity-covid-research/output/tempdata/model3_positivetest_e
> th5.ster saved
file E:\analyses\ethnicity-covid-research/output/tempdata/model3_positivetest_e
> th5.dta saved
  44,295

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p | 10,973,518    1.98e+09           0   1.98e+09   1.98e+09
  8,217

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |  1,030,812    1.86e+08           0   1.86e+08   1.86e+08
  2,251

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    343,477    6.19e+07           0   6.19e+07   6.19e+07
  800

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    171,624    3.10e+07           0   3.10e+07   3.10e+07
  1,190

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    323,963    5.85e+07           0   5.85e+07   5.85e+07

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

      Eth 5 |      outcome icu
 categories |         0          1 |     Total
------------+----------------------+----------
      White |10,972,487      1,031 |10,973,518 
            |     99.99       0.01 |    100.00 
------------+----------------------+----------
South Asian | 1,030,579        233 | 1,030,812 
            |     99.98       0.02 |    100.00 
------------+----------------------+----------
      Black |   343,361        116 |   343,477 
            |     99.97       0.03 |    100.00 
------------+----------------------+----------
      Mixed |   171,593         31 |   171,624 
            |     99.98       0.02 |    100.00 
------------+----------------------+----------
      Other |   323,898         65 |   323,963 
            |     99.98       0.02 |    100.00 
------------+----------------------+----------
          . | 4,585,927        402 | 4,586,329 
            |     99.99       0.01 |    100.00 
------------+----------------------+----------
      Total |17,427,845      1,878 |17,429,723 
            |     99.99       0.01 |    100.00 

         failure _d:  icu
   analysis time _t:  (stime_icu-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -24156.826
Iteration 1:   log likelihood = -24080.008
Iteration 2:   log likelihood = -24033.771
Iteration 3:   log likelihood = -24031.932
Iteration 4:   log likelihood = -24031.923
Refining estimates:
Iteration 0:   log likelihood = -24031.923

Cox regression -- Breslow method for ties

No. of subjects =   12,843,394                  Number of obs    =  12,843,394
No. of failures =        1,476
Time at risk    =   2317839448
                                                LR chi2(4)       =      249.81
Log likelihood  =   -24031.923                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   2.402904   .1743021    12.09   0.000     2.084452    2.770008
      Black  |   3.590704   .3516438    13.05   0.000     2.963603    4.350501
      Mixed  |   1.919601   .3499153     3.58   0.000     1.342917    2.743927
      Other  |   2.132288   .2726874     5.92   0.000     1.659548    2.739691
------------------------------------------------------------------------------
file E:\analyses\ethnicity-covid-research/output/tempdata/crude_icu_eth5.ster s
> aved
file E:\analyses\ethnicity-covid-research/output/tempdata/crude_icu_eth5.dta sa
> ved

         failure _d:  icu
   analysis time _t:  (stime_icu-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -19481.627
Iteration 1:   log likelihood = -18738.444
Iteration 2:   log likelihood = -18704.212
Iteration 3:   log likelihood = -18701.151
Iteration 4:   log likelihood = -18701.081
Iteration 5:   log likelihood =  -18701.08
Refining estimates:
Iteration 0:   log likelihood =  -18701.08

Stratified Cox regr. -- Breslow method for ties

No. of subjects =   12,729,506                  Number of obs    =  12,729,506
No. of failures =        1,473
Time at risk    =   2297262179
                                                LR chi2(12)      =     1561.09
Log likelihood  =    -18701.08                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   2.859189   .2321885    12.94   0.000     2.438477    3.352487
      Black  |   3.698574     .38972    12.41   0.000     3.008451    4.547008
      Mixed  |   2.786134   .5142067     5.55   0.000     1.940461     4.00036
      Other  |   3.016651   .3986066     8.36   0.000     2.328365      3.9084
             |
        male |
       Male  |   2.551944   .1465926    16.31   0.000     2.280211    2.856059
        age1 |   1.063557   .0169306     3.87   0.000     1.030886    1.097263
        age2 |   1.160225   .0487651     3.54   0.000     1.068478     1.25985
        age3 |   .5062962   .0555712    -6.20   0.000     .4082973    .6278165
             |
         imd |
          2  |   1.035698   .0944753     0.38   0.701      .866139    1.238451
          3  |   1.225742   .1080952     2.31   0.021     1.031178    1.457016
          4  |   1.398051   .1205702     3.89   0.000     1.180631    1.655511
5 most de..  |   1.277553   .1172131     2.67   0.008     1.067291    1.529238
------------------------------------------------------------------------------
                                                             Stratified by stp
file E:\analyses\ethnicity-covid-research/output/tempdata/model1_icu_eth5.ster 
> saved
file E:\analyses\ethnicity-covid-research/output/tempdata/model1_icu_eth5.dta s
> aved

         failure _d:  icu
   analysis time _t:  (stime_icu-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: 1.asthma omitted because of collinearity
Iteration 0:   log likelihood = -16595.473
Iteration 1:   log likelihood = -16411.915
Iteration 2:   log likelihood = -15709.551
Iteration 3:   log likelihood = -15632.737
Iteration 4:   log likelihood = -15619.136
Iteration 5:   log likelihood = -15617.608
Iteration 6:   log likelihood = -15617.562
Iteration 7:   log likelihood = -15617.561
Iteration 8:   log likelihood =  -15617.56
Iteration 9:   log likelihood =  -15617.56
Iteration 10:  log likelihood =  -15617.56
Iteration 11:  log likelihood =  -15617.56
Iteration 12:  log likelihood =  -15617.56
Iteration 13:  log likelihood =  -15617.56
Iteration 14:  log likelihood =  -15617.56
Iteration 15:  log likelihood =  -15617.56
Iteration 16:  log likelihood =  -15617.56
Iteration 17:  log likelihood =  -15617.56
Iteration 18:  log likelihood =  -15617.56
Refining estimates:
Iteration 0:   log likelihood =  -15617.56

Stratified Cox regr. -- Breslow method for ties

No. of subjects =    8,830,743                  Number of obs    =   8,830,743
No. of failures =        1,292
Time at risk    =   1592287144
                                                LR chi2(34)      =     1955.83
Log likelihood  =    -15617.56                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   2.479459    .229076     9.83   0.000     2.068782     2.97166
      Black  |   3.179039    .366183    10.04   0.000     2.536581    3.984217
      Mixed  |   2.589995    .532572     4.63   0.000     1.730889    3.875509
      Other  |   3.626029    .526793     8.87   0.000      2.72752    4.820529
             |
        male |
       Male  |   3.127094   .1992934    17.89   0.000     2.759897    3.543146
        age1 |   1.026582    .021847     1.23   0.218     .9846438    1.070307
        age2 |    1.17587   .0627171     3.04   0.002     1.059154    1.305449
        age3 |   .5093126   .0693171    -4.96   0.000     .3900645    .6650164
             |
         imd |
          2  |   .9746523   .0951151    -0.26   0.792     .8049743    1.180096
          3  |   1.108135   .1046344     1.09   0.277      .920914    1.333419
          4  |   1.218766   .1129108     2.14   0.033     1.016394    1.461432
5 most de..  |   1.116949   .1101576     1.12   0.262     .9206288    1.355133
             |
         bmi |    1.08762   .0051706    17.67   0.000     1.077533    1.097801
gp_consult~t |   1.009972   .0017246     5.81   0.000     1.006597    1.013357
             |
smoke_nomiss |
     Former  |   1.097436   .0655453     1.56   0.120     .9762036    1.233724
    Current  |   .2473104   .0371684    -9.30   0.000     .1842108    .3320242
             |
1.htdiag_o~p |    1.08279   .0685978     1.26   0.209     .9563527    1.225943
    1.asthma |          1  (omitted)
1.~c_disease |   .9348515    .078153    -0.81   0.420     .7935653    1.101292
             |
     dm_type |
       T1DM  |   2.163142   .5233719     3.19   0.001     1.346284    3.475627
       T2DM  |   1.639067   .1136804     7.12   0.000     1.430738     1.87773
 UNKNOWN_DM  |   1.380979   .1652247     2.70   0.007     1.092312    1.745933
             |
    1.cancer |   1.082207   .1103809     0.77   0.439     .8861169     1.32169
1.~r_disease |   .4038999   .1534123    -2.39   0.017     .1918509    .8503223
    1.stroke |   1.125205   .1582637     0.84   0.402     .8540971    1.482367
  1.dementia |   .2551955   .2559501    -1.36   0.173       .03574    1.822181
1.other_ne~o |    .994086   .2443949    -0.02   0.981     .6139839      1.6095
             |
         ckd |
          2  |   1.458937   .1517643     3.63   0.000     1.189848    1.788883
          3  |    1.49473   .2560863     2.35   0.019      1.06839    2.091201
          4  |   .9611842   .3199245    -0.12   0.905     .5005981    1.845543
          5  |   1.215455   .4506745     0.53   0.599     .5876582    2.513929
             |
      1.esrf |   6.076321   1.915377     5.72   0.000     3.275858    11.27084
1.perm_imm~f |   2.37e-08          .        .       .            .           .
1.temp_imm~f |   7.26e-08   7.54e-08   -15.82   0.000     9.48e-09    5.56e-07
1.other_im~o |   3.25e+07    9185433    61.27   0.000     1.87e+07    5.66e+07
1.ra_sle_p~s |   1.287594   .1291129     2.52   0.012     1.057853    1.567231
------------------------------------------------------------------------------
                                                             Stratified by stp
file E:\analyses\ethnicity-covid-research/output/tempdata/model2_icu_eth5.ster 
> saved
file E:\analyses\ethnicity-covid-research/output/tempdata/model2_icu_eth5.dta s
> aved

         failure _d:  icu
   analysis time _t:  (stime_icu-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: 1.asthma omitted because of collinearity
Iteration 0:   log likelihood = -16595.473
Iteration 1:   log likelihood =  -16409.76
Iteration 2:   log likelihood = -15707.031
Iteration 3:   log likelihood = -15630.238
Iteration 4:   log likelihood = -15616.661
Iteration 5:   log likelihood = -15615.136
Iteration 6:   log likelihood = -15615.091
Iteration 7:   log likelihood =  -15615.09
Iteration 8:   log likelihood = -15615.089
Iteration 9:   log likelihood = -15615.089
Iteration 10:  log likelihood = -15615.089
Iteration 11:  log likelihood = -15615.089
Iteration 12:  log likelihood = -15615.089
Iteration 13:  log likelihood = -15615.089
Iteration 14:  log likelihood = -15615.089
Iteration 15:  log likelihood = -15615.089
Iteration 16:  log likelihood = -15615.089
Iteration 17:  log likelihood = -15615.089
Iteration 18:  log likelihood = -15615.089
Refining estimates:
Iteration 0:   log likelihood = -15615.089

Stratified Cox regr. -- Breslow method for ties

No. of subjects =    8,830,743                  Number of obs    =   8,830,743
No. of failures =        1,292
Time at risk    =   1592287144
                                                LR chi2(35)      =     1960.77
Log likelihood  =   -15615.089                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |    2.47453   .2286221     9.81   0.000     2.064667    2.965756
      Black  |   3.175769   .3657751    10.03   0.000     2.534021    3.980042
      Mixed  |   2.587713   .5320934     4.62   0.000     1.729376    3.872066
      Other  |    3.61829   .5255922     8.85   0.000     2.721812    4.810041
             |
        male |
       Male  |   3.123492   .1990694    17.87   0.000     2.756709    3.539077
        age1 |   1.027997   .0218543     1.30   0.194     .9860432    1.071735
        age2 |   1.173037   .0624846     3.00   0.003     1.056746    1.302126
        age3 |   .5118694   .0695736    -4.93   0.000       .39216    .6681208
             |
         imd |
          2  |   .9741838   .0950683    -0.27   0.789     .8045891    1.179526
          3  |   1.107752   .1046033     1.08   0.278     .9205873     1.33297
          4  |   1.219614   .1129899     2.14   0.032       1.0171     1.46245
5 most de..  |   1.117439   .1102076     1.13   0.260     .9210308    1.355732
             |
     hh_size |   1.001809   .0004678     3.87   0.000     1.000893    1.002726
         bmi |   1.087655     .00517    17.68   0.000     1.077569    1.097835
gp_consult~t |   1.009949   .0017182     5.82   0.000     1.006587    1.013322
             |
smoke_nomiss |
     Former  |   1.097972   .0655838     1.56   0.118     .9766694    1.234341
    Current  |   .2470676   .0371381    -9.30   0.000     .1840208    .3317146
             |
1.htdiag_o~p |   1.083083   .0686131     1.26   0.208     .9566174    1.226267
    1.asthma |          1  (omitted)
1.~c_disease |   .9348985   .0781631    -0.81   0.421      .793595    1.101362
             |
     dm_type |
       T1DM  |   2.164775   .5237691     3.19   0.001     1.347299    3.478257
       T2DM  |   1.638997   .1136681     7.12   0.000      1.43069    1.877634
 UNKNOWN_DM  |   1.381164   .1652426     2.70   0.007     1.092465    1.746156
             |
    1.cancer |   1.082624    .110422     0.78   0.436     .8864608    1.322196
1.~r_disease |   .4038275   .1533843    -2.39   0.017      .191817    .8501677
    1.stroke |   1.124399   .1581539     0.83   0.405     .8534803    1.481315
  1.dementia |   .2528826   .2536322    -1.37   0.170     .0354155    1.805692
1.other_ne~o |   .9933246   .2442103    -0.03   0.978     .6135106    1.608275
             |
         ckd |
          2  |   1.458879   .1517564     3.63   0.000     1.189803    1.788807
          3  |   1.494226   .2559995     2.34   0.019      1.06803    2.090495
          4  |   .9608282   .3197913    -0.12   0.904     .5004277    1.844804
          5  |   1.215491   .4506397     0.53   0.599      .587721    2.513809
             |
      1.esrf |   6.076543   1.915121     5.73   0.000     3.276323    11.27007
1.perm_imm~f |   2.38e-08          .        .       .            .           .
1.temp_imm~f |   7.30e-08   7.59e-08   -15.82   0.000     9.53e-09    5.59e-07
1.other_im~o |   3.24e+07    9144558    61.26   0.000     1.86e+07    5.63e+07
1.ra_sle_p~s |   1.287402   .1291007     2.52   0.012     1.057683    1.567013
------------------------------------------------------------------------------
                                                             Stratified by stp
file E:\analyses\ethnicity-covid-research/output/tempdata/model3_icu_eth5.ster 
> saved
file E:\analyses\ethnicity-covid-research/output/tempdata/model3_icu_eth5.dta s
> aved
  1,031

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p | 10,973,518    1.98e+09           0   1.98e+09   1.98e+09
  233

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |  1,030,812    1.86e+08           0   1.86e+08   1.86e+08
  116

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    343,477    6.21e+07           0   6.21e+07   6.21e+07
  31

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    171,624    3.10e+07           0   3.10e+07   3.10e+07
  65

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    323,963    5.86e+07           0   5.86e+07   5.86e+07

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

      Eth 5 |   outcome cpnsdeath
 categories |         0          1 |     Total
------------+----------------------+----------
      White |10,967,372      6,146 |10,973,518 
            |     99.94       0.06 |    100.00 
------------+----------------------+----------
South Asian | 1,030,216        596 | 1,030,812 
            |     99.94       0.06 |    100.00 
------------+----------------------+----------
      Black |   343,243        234 |   343,477 
            |     99.93       0.07 |    100.00 
------------+----------------------+----------
      Mixed |   171,570         54 |   171,624 
            |     99.97       0.03 |    100.00 
------------+----------------------+----------
      Other |   323,867         96 |   323,963 
            |     99.97       0.03 |    100.00 
------------+----------------------+----------
          . | 4,583,879      2,450 | 4,586,329 
            |     99.95       0.05 |    100.00 
------------+----------------------+----------
      Total |17,420,147      9,576 |17,429,723 
            |     99.95       0.05 |    100.00 

         failure _d:  cpnsdeath
   analysis time _t:  (stime_cpnsdeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -116621.2
Iteration 1:   log likelihood = -116583.37
Iteration 2:   log likelihood = -116581.53
Iteration 3:   log likelihood = -116581.52
Iteration 4:   log likelihood = -116581.52
Refining estimates:
Iteration 0:   log likelihood = -116581.52

Cox regression -- Breslow method for ties

No. of subjects =   12,843,394                  Number of obs    =  12,843,394
No. of failures =        7,126
Time at risk    =   2317929120
                                                LR chi2(4)       =       79.35
Log likelihood  =   -116581.52                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |    1.03052   .0442111     0.70   0.483     .9474106    1.120919
      Black  |   1.214478   .0808902     2.92   0.004     1.065848    1.383833
      Mixed  |   .5605529    .076616    -4.23   0.000       .42882     .732754
      Other  |    .527907   .0542984    -6.21   0.000     .4315252    .6458158
------------------------------------------------------------------------------
file E:\analyses\ethnicity-covid-research/output/tempdata/crude_cpnsdeath_eth5.
> ster saved
file E:\analyses\ethnicity-covid-research/output/tempdata/crude_cpnsdeath_eth5.
> dta saved

         failure _d:  cpnsdeath
   analysis time _t:  (stime_cpnsdeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -93531.285
Iteration 1:   log likelihood = -85981.389
Iteration 2:   log likelihood = -83503.218
Iteration 3:   log likelihood = -83457.457
Iteration 4:   log likelihood = -83453.057
Iteration 5:   log likelihood = -83452.788
Iteration 6:   log likelihood = -83452.787
Iteration 7:   log likelihood = -83452.787
Refining estimates:
Iteration 0:   log likelihood = -83452.787

Stratified Cox regr. -- Breslow method for ties

No. of subjects =   12,729,506                  Number of obs    =  12,729,506
No. of failures =        7,090
Time at risk    =   2297351684
                                                LR chi2(12)      =    20157.00
Log likelihood  =   -83452.787                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.641263   .0763406    10.65   0.000     1.498256     1.79792
      Black  |   1.698666   .1184998     7.60   0.000     1.481589    1.947548
      Mixed  |   1.452708   .1999655     2.71   0.007     1.109202    1.902595
      Other  |     1.2978   .1354779     2.50   0.013     1.057671    1.592448
             |
        male |
       Male  |   2.038906   .0499281    29.09   0.000      1.94336     2.13915
        age1 |   1.127092   .0246933     5.46   0.000     1.079718    1.176544
        age2 |   1.012079   .0490808     0.25   0.804     .9203121    1.112995
        age3 |   .9431337   .1067934    -0.52   0.605     .7554219    1.177489
             |
         imd |
          2  |   1.268692   .0527384     5.73   0.000     1.169425    1.376385
          3  |   1.495878   .0614741     9.80   0.000     1.380116     1.62135
          4  |   1.869224   .0755154    15.48   0.000     1.726924    2.023249
5 most de..  |   2.256856   .0935406    19.64   0.000     2.080769    2.447845
------------------------------------------------------------------------------
                                                             Stratified by stp
file E:\analyses\ethnicity-covid-research/output/tempdata/model1_cpnsdeath_eth5
> .ster saved
file E:\analyses\ethnicity-covid-research/output/tempdata/model1_cpnsdeath_eth5
> .dta saved

         failure _d:  cpnsdeath
   analysis time _t:  (stime_cpnsdeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: 1.asthma omitted because of collinearity
Iteration 0:   log likelihood = -83198.654
Iteration 1:   log likelihood = -77683.653
Iteration 2:   log likelihood = -74034.295
Iteration 3:   log likelihood = -73692.866
Iteration 4:   log likelihood = -73675.207
Iteration 5:   log likelihood = -73673.676
Iteration 6:   log likelihood = -73673.631
Iteration 7:   log likelihood =  -73673.63
Refining estimates:
Iteration 0:   log likelihood =  -73673.63

Stratified Cox regr. -- Breslow method for ties

No. of subjects =    8,830,743                  Number of obs    =   8,830,743
No. of failures =        6,486
Time at risk    =   1592363006
                                                LR chi2(35)      =    19050.05
Log likelihood  =    -73673.63                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.552344   .0772889     8.83   0.000     1.408017    1.711465
      Black  |   1.461905   .1085411     5.11   0.000     1.263923      1.6909
      Mixed  |   1.291443   .1948102     1.70   0.090     .9608906    1.735706
      Other  |   1.438552   .1557343     3.36   0.001     1.163527    1.778585
             |
        male |
       Male  |    1.77102   .0469513    21.56   0.000     1.681347    1.865476
        age1 |   1.095462   .0295504     3.38   0.001     1.039049    1.154938
        age2 |   1.015082   .0595292     0.26   0.799     .9048625    1.138727
        age3 |    .946679   .1286303    -0.40   0.687     .7253463    1.235549
             |
         imd |
          2  |    1.19765   .0522312     4.14   0.000     1.099532    1.304524
          3  |   1.357267   .0585546     7.08   0.000     1.247221    1.477024
          4  |   1.626522   .0690143    11.46   0.000     1.496729    1.767572
5 most de..  |   1.843742   .0806721    13.98   0.000     1.692217    2.008834
             |
         bmi |   1.024614   .0025075     9.94   0.000     1.019711     1.02954
gp_consult~t |   1.011642   .0005737    20.41   0.000     1.010519    1.012767
             |
smoke_nomiss |
     Former  |   1.341254   .0390039    10.10   0.000     1.266945    1.419921
    Current  |   1.190967   .0619399     3.36   0.001      1.07555     1.31877
             |
1.htdiag_o~p |   .9449062   .0295869    -1.81   0.070     .8886605    1.004712
    1.asthma |          1  (omitted)
1.~c_disease |   1.394522   .0382839    12.11   0.000      1.32147    1.471612
             |
     dm_type |
       T1DM  |   2.397097   .2604332     8.05   0.000     1.937344    2.965956
       T2DM  |   1.586679   .0455641    16.08   0.000     1.499842    1.678544
 UNKNOWN_DM  |   1.018194    .058745     0.31   0.755     .9093273    1.140095
             |
    1.cancer |   1.386801   .0421303    10.76   0.000     1.306638    1.471883
1.~r_disease |   2.084647   .1695259     9.03   0.000     1.777509    2.444856
    1.stroke |   1.490829    .052202    11.40   0.000     1.391947    1.596736
  1.dementia |   2.375467   .1367858    15.03   0.000     2.121947    2.659276
1.other_ne~o |   2.530995   .1333226    17.63   0.000     2.282724    2.806268
             |
         ckd |
          2  |   1.380561   .0471454     9.44   0.000     1.291182    1.476127
          3  |   1.840455   .0733106    15.31   0.000     1.702235    1.989899
          4  |   2.661921   .1446258    18.02   0.000      2.39303    2.961025
          5  |   3.987932   .4416384    12.49   0.000     3.209834     4.95465
             |
      1.esrf |   2.492558   .2904155     7.84   0.000     1.983669    3.131997
1.perm_imm~f |   .8714504   .6652189    -0.18   0.857     .1952004    3.890494
1.temp_imm~f |   2.270361   1.609574     1.16   0.247     .5657635    9.110766
1.other_im~o |    1.64586   1.252755     0.65   0.513     .3702512    7.316262
1.ra_sle_p~s |   1.197784   .0510769     4.23   0.000     1.101745    1.302195
------------------------------------------------------------------------------
                                                             Stratified by stp
file E:\analyses\ethnicity-covid-research/output/tempdata/model2_cpnsdeath_eth5
> .ster saved
file E:\analyses\ethnicity-covid-research/output/tempdata/model2_cpnsdeath_eth5
> .dta saved

         failure _d:  cpnsdeath
   analysis time _t:  (stime_cpnsdeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: 1.asthma omitted because of collinearity
Iteration 0:   log likelihood = -83198.654
Iteration 1:   log likelihood = -77847.857
Iteration 2:   log likelihood = -73988.342
Iteration 3:   log likelihood = -73633.927
Iteration 4:   log likelihood = -73615.852
Iteration 5:   log likelihood = -73614.056
Iteration 6:   log likelihood = -73613.995
Iteration 7:   log likelihood = -73613.995
Refining estimates:
Iteration 0:   log likelihood = -73613.995

Stratified Cox regr. -- Breslow method for ties

No. of subjects =    8,830,743                  Number of obs    =   8,830,743
No. of failures =        6,486
Time at risk    =   1592363006
                                                LR chi2(36)      =    19169.32
Log likelihood  =   -73613.995                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.560287    .077681     8.94   0.000     1.415227    1.720214
      Black  |   1.473563   .1093823     5.22   0.000     1.274043    1.704328
      Mixed  |   1.301548    .196328     1.75   0.081     .9684188    1.749271
      Other  |   1.446577   .1565711     3.41   0.001     1.170068    1.788429
             |
        male |
       Male  |   1.767799   .0468845    21.48   0.000     1.678254    1.862121
        age1 |   1.099005   .0297233     3.49   0.000     1.042266    1.158833
        age2 |   1.013912   .0595326     0.24   0.814     .9036935    1.137572
        age3 |   .9436764   .1283262    -0.43   0.670     .7228898    1.231896
             |
         imd |
          2  |   1.199383   .0523101     4.17   0.000     1.101117    1.306419
          3  |   1.351072   .0583209     6.97   0.000     1.241467    1.470353
          4  |   1.627695   .0690685    11.48   0.000       1.4978    1.768855
5 most de..  |   1.842089   .0806296    13.96   0.000     1.690647    2.007097
             |
     hh_size |    1.00274   .0001181    23.23   0.000     1.002508    1.002971
         bmi |   1.024656   .0025031     9.97   0.000     1.019762    1.029574
gp_consult~t |   1.011305   .0005579    20.38   0.000     1.010212    1.012399
             |
smoke_nomiss |
     Former  |    1.34153   .0390177    10.10   0.000     1.267196    1.420225
    Current  |    1.18617   .0617677     3.28   0.001      1.07108    1.313626
             |
1.htdiag_o~p |   .9473354   .0296622    -1.73   0.084     .8909466    1.007293
    1.asthma |          1  (omitted)
1.~c_disease |   1.396136   .0383361    12.15   0.000     1.322985    1.473332
             |
     dm_type |
       T1DM  |   2.400688   .2608274     8.06   0.000     1.940239    2.970408
       T2DM  |   1.590389    .045656    16.16   0.000     1.503376    1.682439
 UNKNOWN_DM  |   1.022844   .0589943     0.39   0.695     .9135136     1.14526
             |
    1.cancer |   1.389376   .0421995    10.83   0.000     1.309081    1.474597
1.~r_disease |   2.087977   .1697908     9.05   0.000     1.780358    2.448747
    1.stroke |   1.488246   .0521127    11.35   0.000     1.389533    1.593972
  1.dementia |   2.333669   .1343986    14.71   0.000     2.084575    2.612528
1.other_ne~o |   2.525219   .1330203    17.59   0.000     2.277511    2.799868
             |
         ckd |
          2  |   1.382475   .0472116     9.48   0.000     1.292971    1.478175
          3  |   1.842933   .0734079    15.35   0.000     1.704529    1.992575
          4  |   2.667442   .1448946    18.06   0.000     2.398049    2.967099
          5  |   4.001598   .4430996    12.52   0.000     3.220916    4.971502
             |
      1.esrf |   2.492265   .2904211     7.84   0.000     1.983374    3.131727
1.perm_imm~f |   .8731568   .6665137    -0.18   0.859      .195586    3.898043
1.temp_imm~f |   2.279815   1.616304     1.16   0.245     .5681059     9.14892
1.other_im~o |   1.645964   1.252851     0.65   0.513     .3702668    7.316878
1.ra_sle_p~s |   1.197426   .0510971     4.22   0.000     1.101351    1.301882
------------------------------------------------------------------------------
                                                             Stratified by stp
file E:\analyses\ethnicity-covid-research/output/tempdata/model3_cpnsdeath_eth5
> .ster saved
file E:\analyses\ethnicity-covid-research/output/tempdata/model3_cpnsdeath_eth5
> .dta saved
  6,146

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p | 10,973,518    1.98e+09           0   1.98e+09   1.98e+09
  596

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |  1,030,812    1.86e+08           0   1.86e+08   1.86e+08
  234

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    343,477    6.21e+07           0   6.21e+07   6.21e+07
  54

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    171,624    3.10e+07           0   3.10e+07   3.10e+07
  96

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    323,963    5.86e+07           0   5.86e+07   5.86e+07

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

      Eth 5 |   outcome onsdeath
 categories |         0          1 |     Total
------------+----------------------+----------
      White |10,914,527     58,991 |10,973,518 
            |     99.46       0.54 |    100.00 
------------+----------------------+----------
South Asian | 1,028,535      2,277 | 1,030,812 
            |     99.78       0.22 |    100.00 
------------+----------------------+----------
      Black |   342,620        857 |   343,477 
            |     99.75       0.25 |    100.00 
------------+----------------------+----------
      Mixed |   171,384        240 |   171,624 
            |     99.86       0.14 |    100.00 
------------+----------------------+----------
      Other |   323,552        411 |   323,963 
            |     99.87       0.13 |    100.00 
------------+----------------------+----------
          . | 4,561,199     25,130 | 4,586,329 
            |     99.45       0.55 |    100.00 
------------+----------------------+----------
      Total |17,341,817     87,906 |17,429,723 
            |     99.50       0.50 |    100.00 

         failure _d:  onsdeath
   analysis time _t:  (stime_onsdeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -1027386.4
Iteration 1:   log likelihood = -1025211.2
Iteration 2:   log likelihood = -1025009.6
Iteration 3:   log likelihood = -1025003.3
Iteration 4:   log likelihood = -1025003.3
Refining estimates:
Iteration 0:   log likelihood = -1025003.3

Cox regression -- Breslow method for ties

No. of subjects =   12,843,394                  Number of obs    =  12,843,394
No. of failures =       62,776
Time at risk    =   2317942353
                                                LR chi2(4)       =     4766.11
Log likelihood  =   -1025003.3                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .4102572   .0087619   -41.72   0.000     .3934386    .4277947
      Black  |   .4634704   .0159464   -22.35   0.000     .4332465    .4958028
      Mixed  |    .259621   .0167925   -20.85   0.000     .2287091     .294711
      Other  |   .2355248    .011658   -29.21   0.000     .2137489    .2595191
------------------------------------------------------------------------------
file E:\analyses\ethnicity-covid-research/output/tempdata/crude_onsdeath_eth5.s
> ter saved
file E:\analyses\ethnicity-covid-research/output/tempdata/crude_onsdeath_eth5.d
> ta saved

         failure _d:  onsdeath
   analysis time _t:  (stime_onsdeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -822193.14
Iteration 1:   log likelihood = -752921.68
Iteration 2:   log likelihood = -731226.63
Iteration 3:   log likelihood = -730580.38
Iteration 4:   log likelihood = -730568.44
Iteration 5:   log likelihood = -730568.19
Iteration 6:   log likelihood = -730568.19
Refining estimates:
Iteration 0:   log likelihood = -730568.19

Stratified Cox regr. -- Breslow method for ties

No. of subjects =   12,729,506                  Number of obs    =  12,729,506
No. of failures =       62,445
Time at risk    =   2297364917
                                                LR chi2(12)      =   183249.90
Log likelihood  =   -730568.19                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .8620555   .0193244    -6.62   0.000     .8250005    .9007749
      Black  |   .8925523   .0316165    -3.21   0.001     .8326872    .9567214
      Mixed  |   .8456969     .05504    -2.58   0.010     .7444173    .9607557
      Other  |   .7235566   .0361934    -6.47   0.000     .6559854    .7980881
             |
        male |
       Male  |   1.396727    .011295    41.32   0.000     1.374764    1.419041
        age1 |   1.179503   .0092608    21.03   0.000     1.161491    1.197794
        age2 |   .8467836   .0146083    -9.64   0.000     .8186304    .8759049
        age3 |   1.553823   .0622931    10.99   0.000     1.436405     1.68084
             |
         imd |
          2  |   1.160257   .0151794    11.36   0.000     1.130884    1.190393
          3  |   1.304426   .0170813    20.30   0.000     1.271373    1.338338
          4  |   1.542561   .0202958    32.94   0.000      1.50329    1.582857
5 most de..  |   1.886264    .025588    46.78   0.000     1.836773    1.937088
------------------------------------------------------------------------------
                                                             Stratified by stp
file E:\analyses\ethnicity-covid-research/output/tempdata/model1_onsdeath_eth5.
> ster saved
file E:\analyses\ethnicity-covid-research/output/tempdata/model1_onsdeath_eth5.
> dta saved

         failure _d:  onsdeath
   analysis time _t:  (stime_onsdeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: 1.asthma omitted because of collinearity
Iteration 0:   log likelihood = -718755.78
Iteration 1:   log likelihood =  -664506.8
Iteration 2:   log likelihood = -634023.32
Iteration 3:   log likelihood = -631951.22
Iteration 4:   log likelihood = -631822.89
Iteration 5:   log likelihood = -631805.69
Iteration 6:   log likelihood = -631805.03
Iteration 7:   log likelihood = -631805.02
Refining estimates:
Iteration 0:   log likelihood = -631805.02

Stratified Cox regr. -- Breslow method for ties

No. of subjects =    8,830,743                  Number of obs    =   8,830,743
No. of failures =       56,084
Time at risk    =   1592375010
                                                LR chi2(35)      =   173901.50
Log likelihood  =   -631805.02                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .8877632   .0211161    -5.01   0.000     .8473263    .9301298
      Black  |   .8656821   .0325659    -3.83   0.000     .8041504     .931922
      Mixed  |   .8839117   .0611192    -1.78   0.074      .771883      1.0122
      Other  |   .8135026   .0425593    -3.95   0.000      .734222    .9013439
             |
        male |
       Male  |   1.199544   .0105484    20.69   0.000     1.179046    1.220398
        age1 |   1.196024   .0123919    17.28   0.000     1.171981     1.22056
        age2 |   .7917443   .0175457   -10.54   0.000     .7580914     .826891
        age3 |    1.78922   .0910605    11.43   0.000     1.619358    1.976901
             |
         imd |
          2  |   1.130171   .0156512     8.84   0.000     1.099908    1.161267
          3  |   1.245187   .0172847    15.80   0.000     1.211767     1.27953
          4  |   1.431874   .0199974    25.70   0.000     1.393211     1.47161
5 most de..  |   1.656836   .0239942    34.86   0.000      1.61047    1.704538
             |
         bmi |   .9599914   .0008824   -44.42   0.000     .9582633    .9617225
gp_consult~t |   1.012446   .0001936    64.70   0.000     1.012067    1.012826
             |
smoke_nomiss |
     Former  |    1.21236   .0118589    19.69   0.000     1.189338    1.235827
    Current  |    1.85315    .028261    40.45   0.000     1.798579    1.909377
             |
1.htdiag_o~p |   .9659614   .0100281    -3.34   0.001     .9465053    .9858175
    1.asthma |          1  (omitted)
1.~c_disease |   1.426026   .0133609    37.88   0.000     1.400079    1.452455
             |
     dm_type |
       T1DM  |    2.19766   .0888283    19.48   0.000     2.030277    2.378842
       T2DM  |   1.388309   .0141443    32.20   0.000     1.360862     1.41631
 UNKNOWN_DM  |   .9577977   .0197401    -2.09   0.036     .9198788    .9972797
             |
    1.cancer |   2.573145   .0232887   104.43   0.000     2.527903    2.619197
1.~r_disease |   2.862583   .0718504    41.90   0.000     2.725167    3.006929
    1.stroke |   1.531395   .0177957    36.67   0.000     1.496911    1.566675
  1.dementia |   2.637369   .0470798    54.33   0.000      2.54669    2.731277
1.other_ne~o |   2.217198    .041429    42.61   0.000     2.137468    2.299903
             |
         ckd |
          2  |   1.086901   .0127076     7.13   0.000     1.062278    1.112095
          3  |   1.372777   .0187597    23.19   0.000     1.336496    1.410042
          4  |   2.082576   .0389943    39.18   0.000     2.007534    2.160423
          5  |   3.725707   .1530433    32.02   0.000     3.437505    4.038072
             |
      1.esrf |   1.716911   .0829162    11.19   0.000     1.561852    1.887363
1.perm_imm~f |   1.008038   .1992356     0.04   0.968     .6842885    1.484958
1.temp_imm~f |   3.918505   .7065472     7.57   0.000     2.751946    5.579572
1.other_im~o |   1.232804   .2414863     1.07   0.285     .8397643      1.8098
1.ra_sle_p~s |   1.082106   .0162551     5.25   0.000     1.050711    1.114439
------------------------------------------------------------------------------
                                                             Stratified by stp
file E:\analyses\ethnicity-covid-research/output/tempdata/model2_onsdeath_eth5.
> ster saved
file E:\analyses\ethnicity-covid-research/output/tempdata/model2_onsdeath_eth5.
> dta saved

         failure _d:  onsdeath
   analysis time _t:  (stime_onsdeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: 1.asthma omitted because of collinearity
Iteration 0:   log likelihood = -718755.78
Iteration 1:   log likelihood = -675878.68
Iteration 2:   log likelihood =  -634041.1
Iteration 3:   log likelihood = -631241.35
Iteration 4:   log likelihood = -631068.67
Iteration 5:   log likelihood = -631044.49
Iteration 6:   log likelihood = -631043.44
Iteration 7:   log likelihood = -631043.43
Refining estimates:
Iteration 0:   log likelihood = -631043.43

Stratified Cox regr. -- Breslow method for ties

No. of subjects =    8,830,743                  Number of obs    =   8,830,743
No. of failures =       56,084
Time at risk    =   1592375010
                                                LR chi2(36)      =   175424.68
Log likelihood  =   -631043.43                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .8936551   .0212567    -4.73   0.000      .852949    .9363038
      Black  |   .8735913   .0328605    -3.59   0.000     .8115028    .9404301
      Mixed  |   .8930261   .0617485    -1.64   0.102     .7798437    1.022635
      Other  |   .8193347   .0428603    -3.81   0.000      .739493    .9077968
             |
        male |
       Male  |    1.19685   .0105333    20.42   0.000     1.176382    1.217674
        age1 |   1.203405   .0125702    17.73   0.000     1.179019    1.228296
        age2 |   .7878417   .0175593   -10.70   0.000     .7541669    .8230201
        age3 |   1.794976    .091802    11.44   0.000     1.623772    1.984232
             |
         imd |
          2  |   1.130884   .0156604     8.88   0.000     1.100603    1.161999
          3  |   1.236907   .0171879    15.30   0.000     1.203674    1.271058
          4  |   1.431188   .0199877    25.67   0.000     1.392544    1.470904
5 most de..  |   1.653702   .0239534    34.73   0.000     1.607414    1.701322
             |
     hh_size |   1.002771   .0000335    82.94   0.000     1.002705    1.002836
         bmi |    .960345   .0008814   -44.08   0.000     .9586189    .9620741
gp_consult~t |   1.012262     .00019    64.93   0.000     1.011889    1.012634
             |
smoke_nomiss |
     Former  |   1.212536   .0118619    19.70   0.000     1.189508    1.236009
    Current  |   1.847056   .0282156    40.17   0.000     1.792574    1.903194
             |
1.htdiag_o~p |   .9690397   .0100666    -3.03   0.002      .949509    .9889721
    1.asthma |          1  (omitted)
1.~c_disease |    1.42741   .0133759    37.98   0.000     1.401433    1.453868
             |
     dm_type |
       T1DM  |   2.203471   .0890656    19.55   0.000     2.035642    2.385138
       T2DM  |   1.389808   .0141574    32.31   0.000     1.362335    1.417835
 UNKNOWN_DM  |   .9609017   .0197987    -1.94   0.053     .9228702    1.000501
             |
    1.cancer |   2.575021   .0232924   104.57   0.000     2.529771    2.621081
1.~r_disease |   2.866834   .0719555    41.96   0.000     2.729217    3.011391
    1.stroke |   1.528046   .0177571    36.49   0.000     1.493636    1.563249
  1.dementia |   2.580336   .0460728    53.09   0.000     2.491596    2.672235
1.other_ne~o |   2.209392   .0412845    42.42   0.000      2.12994    2.291808
             |
         ckd |
          2  |    1.08816    .012722     7.23   0.000     1.063508    1.113382
          3  |   1.374173   .0187778    23.26   0.000     1.337858    1.411474
          4  |   2.083956   .0390157    39.22   0.000     2.008873    2.161846
          5  |   3.732151   .1532874    32.07   0.000     3.443488    4.045013
             |
      1.esrf |   1.719117   .0830242    11.22   0.000     1.563857    1.889792
1.perm_imm~f |   1.014053   .2004177     0.07   0.944     .6883812      1.4938
1.temp_imm~f |   3.938224    .710116     7.60   0.000     2.765777    5.607687
1.other_im~o |    1.22954   .2408504     1.05   0.291     .8375365    1.805019
1.ra_sle_p~s |   1.082611   .0162708     5.28   0.000     1.051186    1.114975
------------------------------------------------------------------------------
                                                             Stratified by stp
file E:\analyses\ethnicity-covid-research/output/tempdata/model3_onsdeath_eth5.
> ster saved
file E:\analyses\ethnicity-covid-research/output/tempdata/model3_onsdeath_eth5.
> dta saved
  58,991

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p | 10,973,518    1.98e+09           0   1.98e+09   1.98e+09
  2,277

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |  1,030,812    1.86e+08           0   1.86e+08   1.86e+08
  857

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    343,477    6.21e+07           0   6.21e+07   6.21e+07
  240

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    171,624    3.10e+07           0   3.10e+07   3.10e+07
  411

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    323,963    5.86e+07           0   5.86e+07   5.86e+07

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

      Eth 5 | outcome onscoviddeath
 categories |         0          1 |     Total
------------+----------------------+----------
      White |10,963,419     10,099 |10,973,518 
            |     99.91       0.09 |    100.00 
------------+----------------------+----------
South Asian | 1,030,075        737 | 1,030,812 
            |     99.93       0.07 |    100.00 
------------+----------------------+----------
      Black |   343,176        301 |   343,477 
            |     99.91       0.09 |    100.00 
------------+----------------------+----------
      Mixed |   171,549         75 |   171,624 
            |     99.96       0.04 |    100.00 
------------+----------------------+----------
      Other |   323,830        133 |   323,963 
            |     99.96       0.04 |    100.00 
------------+----------------------+----------
          . | 4,582,454      3,875 | 4,586,329 
            |     99.92       0.08 |    100.00 
------------+----------------------+----------
      Total |17,414,503     15,220 |17,429,723 
            |     99.91       0.09 |    100.00 

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -185666.86
Iteration 1:   log likelihood = -185570.25
Iteration 2:   log likelihood =  -185564.9
Iteration 3:   log likelihood = -185564.86
Iteration 4:   log likelihood = -185564.86
Refining estimates:
Iteration 0:   log likelihood = -185564.86

Cox regression -- Breslow method for ties

No. of subjects =   12,843,394                  Number of obs    =  12,843,394
No. of failures =       11,345
Time at risk    =   2317942353
                                                LR chi2(4)       =      204.02
Log likelihood  =   -185564.86                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |    .775488   .0295894    -6.66   0.000     .7196092    .8357058
      Black  |   .9506923   .0556076    -0.86   0.387     .8477186    1.066174
      Mixed  |   .4737782     .05491    -6.45   0.000     .3775049    .5946038
      Other  |   .4450689   .0388457    -9.28   0.000      .375089    .5281049
------------------------------------------------------------------------------
file E:\analyses\ethnicity-covid-research/output/tempdata/crude_onscoviddeath_e
> th5.ster saved
file E:\analyses\ethnicity-covid-research/output/tempdata/crude_onscoviddeath_e
> th5.dta saved

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -148825.64
Iteration 1:   log likelihood = -135748.23
Iteration 2:   log likelihood = -130750.51
Iteration 3:   log likelihood = -130530.74
Iteration 4:   log likelihood = -130529.78
Iteration 5:   log likelihood = -130529.77
Iteration 6:   log likelihood = -130529.77
Refining estimates:
Iteration 0:   log likelihood = -130529.77

Stratified Cox regr. -- Breslow method for ties

No. of subjects =   12,729,506                  Number of obs    =  12,729,506
No. of failures =       11,271
Time at risk    =   2297364917
                                                LR chi2(12)      =    36591.74
Log likelihood  =   -130529.77                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.373557   .0562118     7.76   0.000     1.267686    1.488269
      Black  |   1.496005   .0912452     6.60   0.000     1.327444    1.685971
      Mixed  |   1.379288   .1609528     2.76   0.006     1.097302     1.73374
      Other  |   1.194936   .1061054     2.01   0.045     1.004064    1.422092
             |
        male |
       Male  |   1.664528   .0318001    26.67   0.000     1.603353    1.728036
        age1 |   1.169478   .0256236     7.15   0.000      1.12032    1.220793
        age2 |   .9083496   .0430518    -2.03   0.043     .8277701     .996773
        age3 |   1.279754   .1399453     2.26   0.024     1.032868    1.585653
             |
         imd |
          2  |   1.219304   .0389517     6.21   0.000     1.145301    1.298088
          3  |   1.372063   .0438481     9.90   0.000     1.288759    1.460752
          4  |   1.722633   .0541157    17.31   0.000     1.619768    1.832031
5 most de..  |   2.067182   .0666416    22.53   0.000     1.940608    2.202012
------------------------------------------------------------------------------
                                                             Stratified by stp
file E:\analyses\ethnicity-covid-research/output/tempdata/model1_onscoviddeath_
> eth5.ster saved
file E:\analyses\ethnicity-covid-research/output/tempdata/model1_onscoviddeath_
> eth5.dta saved

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: 1.asthma omitted because of collinearity
Iteration 0:   log likelihood = -131721.81
Iteration 1:   log likelihood = -130165.93
Iteration 2:   log likelihood = -116957.13
Iteration 3:   log likelihood = -115681.01
Iteration 4:   log likelihood = -115372.61
Iteration 5:   log likelihood = -115353.27
Iteration 6:   log likelihood = -115352.93
Iteration 7:   log likelihood = -115352.93
Refining estimates:
Iteration 0:   log likelihood = -115352.93

Stratified Cox regr. -- Breslow method for ties

No. of subjects =    8,830,743                  Number of obs    =   8,830,743
No. of failures =       10,253
Time at risk    =   1592375010
                                                LR chi2(35)      =    32737.75
Log likelihood  =   -115352.93                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |     1.3042   .0567413     6.10   0.000     1.197599     1.42029
      Black  |   1.291819   .0838737     3.94   0.000     1.137459    1.467126
      Mixed  |   1.290821   .1619248     2.04   0.042     1.009459    1.650607
      Other  |   1.272226   .1179201     2.60   0.009     1.060884    1.525669
             |
        male |
       Male  |   1.492042   .0309468    19.29   0.000     1.432604    1.553947
        age1 |   1.120604   .0280463     4.55   0.000      1.06696    1.176944
        age2 |   .9574248   .0516026    -0.81   0.420     .8614444    1.064099
        age3 |   1.131854   .1405189     1.00   0.318     .8873896    1.443665
             |
         imd |
          2  |   1.173021   .0394833     4.74   0.000     1.098132    1.253016
          3  |   1.291087   .0434933     7.58   0.000     1.208595    1.379209
          4  |   1.575959   .0522149    13.73   0.000     1.476872    1.681694
5 most de..  |   1.825766   .0622513    17.66   0.000     1.707743    1.951945
             |
         bmi |   .9985862    .002044    -0.69   0.489     .9945881      1.0026
gp_consult~t |   1.009701    .000572    17.04   0.000     1.008581    1.010823
             |
smoke_nomiss |
     Former  |   1.265958   .0285812    10.45   0.000     1.211161    1.323234
    Current  |   1.107139   .0476785     2.36   0.018     1.017526    1.204644
             |
1.htdiag_o~p |   .8770629   .0214319    -5.37   0.000     .8360472    .9200907
    1.asthma |          1  (omitted)
1.~c_disease |   1.234034   .0269806     9.62   0.000      1.18227    1.288065
             |
     dm_type |
       T1DM  |   2.207032   .2122294     8.23   0.000     1.827917    2.664775
       T2DM  |   1.507066   .0348623    17.73   0.000     1.440263    1.576968
 UNKNOWN_DM  |   .9388616    .043603    -1.36   0.174     .8571755    1.028332
             |
    1.cancer |   1.252217   .0307103     9.17   0.000      1.19345    1.313878
1.~r_disease |   1.952636   .1391872     9.39   0.000     1.698033    2.245413
    1.stroke |   1.558936   .0417505    16.58   0.000     1.479217    1.642951
  1.dementia |   3.597425   .1321342    34.85   0.000     3.347549    3.865953
1.other_ne~o |   2.488129   .1020571    22.22   0.000      2.29593    2.696417
             |
         ckd |
          2  |   1.244381   .0330667     8.23   0.000      1.18123    1.310907
          3  |   1.517627    .047624    13.29   0.000     1.427098    1.613898
          4  |   2.099092   .0928546    16.76   0.000     1.924766    2.289206
          5  |   3.167751   .3077244    11.87   0.000     2.618562    3.832121
             |
      1.esrf |   2.517113   .2613454     8.89   0.000     2.053641    3.085182
1.perm_imm~f |   .3229767   .3321018    -1.10   0.272     .0430448    2.423382
1.temp_imm~f |   .8894265   .8901712    -0.12   0.907     .1250823    6.324472
1.other_im~o |   4.324253   4.439864     1.43   0.154     .5780325    32.34968
1.ra_sle_p~s |    1.14284   .0398505     3.83   0.000     1.067343    1.223676
------------------------------------------------------------------------------
                                                             Stratified by stp
file E:\analyses\ethnicity-covid-research/output/tempdata/model2_onscoviddeath_
> eth5.ster saved
file E:\analyses\ethnicity-covid-research/output/tempdata/model2_onscoviddeath_
> eth5.dta saved

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: 1.asthma omitted because of collinearity
Iteration 0:   log likelihood = -131721.81
Iteration 1:   log likelihood = -125052.55
Iteration 2:   log likelihood = -118459.94
Iteration 3:   log likelihood = -115284.64
Iteration 4:   log likelihood =  -115088.3
Iteration 5:   log likelihood = -115069.44
Iteration 6:   log likelihood = -115067.93
Iteration 7:   log likelihood = -115067.92
Refining estimates:
Iteration 0:   log likelihood = -115067.92

Stratified Cox regr. -- Breslow method for ties

No. of subjects =    8,830,743                  Number of obs    =   8,830,743
No. of failures =       10,253
Time at risk    =   1592375010
                                                LR chi2(36)      =    33307.77
Log likelihood  =   -115067.92                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   1.318612    .057374     6.36   0.000     1.210823    1.435997
      Black  |   1.309987   .0850331     4.16   0.000     1.153491    1.487715
      Mixed  |   1.311525   .1645169     2.16   0.031     1.025658    1.677069
      Other  |   1.286915    .119256     2.72   0.006     1.073175    1.543224
             |
        male |
       Male  |    1.48611   .0308623    19.08   0.000     1.426835    1.547847
        age1 |   1.134919   .0289006     4.97   0.000     1.079666    1.193001
        age2 |   .9467528   .0516794    -1.00   0.316     .8506933    1.053659
        age3 |   1.144137   .1436377     1.07   0.283     .8945739    1.463322
             |
         imd |
          2  |    1.17371   .0395058     4.76   0.000     1.098779    1.253751
          3  |   1.274765   .0430154     7.19   0.000     1.193184    1.361924
          4  |   1.574241    .052159    13.70   0.000      1.47526    1.679863
5 most de..  |    1.81751   .0620055    17.51   0.000     1.699955    1.943193
             |
     hh_size |   1.003162   .0000605    52.35   0.000     1.003044    1.003281
         bmi |   .9988627   .0020359    -0.56   0.577     .9948805    1.002861
gp_consult~t |   1.009454    .000554    17.14   0.000     1.008369    1.010541
             |
smoke_nomiss |
     Former  |    1.26495   .0285648    10.41   0.000     1.210185    1.322193
    Current  |   1.094687   .0473026     2.09   0.036     1.005793    1.191437
             |
1.htdiag_o~p |   .8802101   .0215203    -5.22   0.000     .8390257    .9234161
    1.asthma |          1  (omitted)
1.~c_disease |   1.236103   .0270277     9.69   0.000     1.184249    1.290228
             |
     dm_type |
       T1DM  |   2.214714   .2129812     8.27   0.000     1.834259    2.674081
       T2DM  |   1.510495   .0349394    17.83   0.000     1.443544     1.58055
 UNKNOWN_DM  |     .94369   .0438123    -1.25   0.212     .8616104    1.033589
             |
    1.cancer |   1.254499   .0307556     9.25   0.000     1.195645    1.316251
1.~r_disease |   1.959207   .1396552     9.43   0.000     1.703749    2.252969
    1.stroke |   1.554753   .0416413    16.48   0.000     1.475243    1.638548
  1.dementia |   3.512944   .1290549    34.20   0.000     3.268893    3.775216
1.other_ne~o |   2.480649   .1017532    22.15   0.000     2.289022    2.688317
             |
         ckd |
          2  |   1.245928   .0331086     8.27   0.000     1.182698    1.312539
          3  |   1.518987   .0476642    13.32   0.000     1.428382     1.61534
          4  |   2.102422    .092982    16.80   0.000     1.927856    2.292795
          5  |   3.174774   .3082986    11.90   0.000     2.624543    3.840361
             |
      1.esrf |   2.521873   .2618115     8.91   0.000      2.05757    3.090949
1.perm_imm~f |   .3261845    .335395    -1.09   0.276     .0434737    2.447374
1.temp_imm~f |   .8982915   .8990543    -0.11   0.915     .1263261    6.387658
1.other_im~o |   4.299695     4.4147     1.42   0.155     .5747365     32.1667
1.ra_sle_p~s |   1.144512   .0399233     3.87   0.000     1.068878    1.225497
------------------------------------------------------------------------------
                                                             Stratified by stp
file E:\analyses\ethnicity-covid-research/output/tempdata/model3_onscoviddeath_
> eth5.ster saved
file E:\analyses\ethnicity-covid-research/output/tempdata/model3_onscoviddeath_
> eth5.dta saved
  10,099

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p | 10,973,518    1.98e+09           0   1.98e+09   1.98e+09
  737

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |  1,030,812    1.86e+08           0   1.86e+08   1.86e+08
  301

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    343,477    6.21e+07           0   6.21e+07   6.21e+07
  75

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    171,624    3.10e+07           0   3.10e+07   3.10e+07
  133

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    323,963    5.86e+07           0   5.86e+07   5.86e+07

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

            |        outcome
      Eth 5 |   ons_noncoviddeath
 categories |         0          1 |     Total
------------+----------------------+----------
      White |10,924,626     48,892 |10,973,518 
            |     99.55       0.45 |    100.00 
------------+----------------------+----------
South Asian | 1,029,272      1,540 | 1,030,812 
            |     99.85       0.15 |    100.00 
------------+----------------------+----------
      Black |   342,921        556 |   343,477 
            |     99.84       0.16 |    100.00 
------------+----------------------+----------
      Mixed |   171,459        165 |   171,624 
            |     99.90       0.10 |    100.00 
------------+----------------------+----------
      Other |   323,685        278 |   323,963 
            |     99.91       0.09 |    100.00 
------------+----------------------+----------
          . | 4,565,074     21,255 | 4,586,329 
            |     99.54       0.46 |    100.00 
------------+----------------------+----------
      Total |17,357,037     72,686 |17,429,723 
            |     99.58       0.42 |    100.00 

         failure _d:  ons_noncoviddeath
   analysis time _t:  (stime_ons_noncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood = -841719.49
Iteration 1:   log likelihood = -839448.16
Iteration 2:   log likelihood = -839190.15
Iteration 3:   log likelihood =  -839179.5
Iteration 4:   log likelihood = -839179.43
Iteration 5:   log likelihood = -839179.43
Refining estimates:
Iteration 0:   log likelihood = -839179.43

Cox regression -- Breslow method for ties

No. of subjects =   12,843,394                  Number of obs    =  12,843,394
No. of failures =       51,431
Time at risk    =   2317942353
                                                LR chi2(4)       =     5080.11
Log likelihood  =   -839179.43                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .3347976   .0086648   -42.28   0.000     .3182385    .3522183
      Black  |   .3628111   .0154739   -23.77   0.000     .3337159    .3944429
      Mixed  |   .2153711   .0167949   -19.69   0.000     .1848459    .2509372
      Other  |   .1922275   .0115618   -27.42   0.000     .1708515    .2162779
------------------------------------------------------------------------------
file E:\analyses\ethnicity-covid-research/output/tempdata/crude_ons_noncoviddea
> th_eth5.ster saved
file E:\analyses\ethnicity-covid-research/output/tempdata/crude_ons_noncoviddea
> th_eth5.dta saved

         failure _d:  ons_noncoviddeath
   analysis time _t:  (stime_ons_noncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

Iteration 0:   log likelihood =  -673367.5
Iteration 1:   log likelihood = -617153.41
Iteration 2:   log likelihood = -600276.39
Iteration 3:   log likelihood = -599803.93
Iteration 4:   log likelihood = -599792.26
Iteration 5:   log likelihood = -599791.99
Iteration 6:   log likelihood = -599791.99
Refining estimates:
Iteration 0:   log likelihood = -599791.99

Stratified Cox regr. -- Breslow method for ties

No. of subjects =   12,729,506                  Number of obs    =  12,729,506
No. of failures =       51,174
Time at risk    =   2297364917
                                                LR chi2(12)      =   147151.02
Log likelihood  =   -599791.99                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .7340562   .0198139   -11.45   0.000     .6962311    .7739362
      Black  |   .7348857   .0321795    -7.03   0.000     .6744458    .8007419
      Mixed  |   .7210818   .0565959    -4.17   0.000     .6182667    .8409945
      Other  |   .6121186   .0371315    -8.09   0.000      .543502     .689398
             |
        male |
       Male  |   1.343985   .0120062    33.09   0.000     1.320658    1.367724
        age1 |   1.182185   .0099579    19.87   0.000     1.162828    1.201864
        age2 |   .8341496   .0154769    -9.77   0.000     .8043604    .8650421
        age3 |   1.618369   .0698614    11.15   0.000     1.487075    1.761254
             |
         imd |
          2  |   1.148959   .0164773     9.68   0.000     1.117114    1.181712
          3  |    1.29143   .0185402    17.81   0.000     1.255598    1.328284
          4  |   1.506577   .0218465    28.26   0.000     1.464362     1.55001
5 most de..  |   1.850902   .0276998    41.14   0.000       1.7974    1.905997
------------------------------------------------------------------------------
                                                             Stratified by stp
file E:\analyses\ethnicity-covid-research/output/tempdata/model1_ons_noncovidde
> ath_eth5.ster saved
file E:\analyses\ethnicity-covid-research/output/tempdata/model1_ons_noncovidde
> ath_eth5.dta saved

         failure _d:  ons_noncoviddeath
   analysis time _t:  (stime_ons_noncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: 1.asthma omitted because of collinearity
Iteration 0:   log likelihood = -587033.97
Iteration 1:   log likelihood = -538562.47
Iteration 2:   log likelihood = -516822.66
Iteration 3:   log likelihood = -515223.61
Iteration 4:   log likelihood = -515092.26
Iteration 5:   log likelihood = -515070.63
Iteration 6:   log likelihood = -515069.48
Iteration 7:   log likelihood = -515069.48
Refining estimates:
Iteration 0:   log likelihood = -515069.48

Stratified Cox regr. -- Breslow method for ties

No. of subjects =    8,830,743                  Number of obs    =   8,830,743
No. of failures =       45,831
Time at risk    =   1592375010
                                                LR chi2(35)      =   143928.98
Log likelihood  =   -515069.48                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .7682334    .022045    -9.19   0.000     .7262185    .8126791
      Black  |   .7336566   .0341211    -6.66   0.000     .6697379    .8036755
      Mixed  |   .7773196   .0644793    -3.04   0.002      .660681      .91455
      Other  |   .6953807   .0441847    -5.72   0.000     .6139557    .7876045
             |
        male |
       Male  |   1.147574    .011155    14.16   0.000     1.125918    1.169647
        age1 |   1.212534   .0138115    16.92   0.000     1.185764    1.239908
        age2 |   .7605428   .0185076   -11.25   0.000     .7251201     .797696
        age3 |   1.971271   .1101124    12.15   0.000     1.766849    2.199344
             |
         imd |
          2  |    1.12182   .0170458     7.57   0.000     1.088904    1.155732
          3  |    1.23592   .0188307    13.90   0.000     1.199558    1.273384
          4  |   1.400509   .0215891    21.85   0.000     1.358828    1.443468
5 most de..  |   1.619908   .0259393    30.12   0.000     1.569858    1.671555
             |
         bmi |   .9512428   .0009783   -48.60   0.000     .9493272    .9531622
gp_consult~t |   1.012886   .0002038    63.64   0.000     1.012487    1.013286
             |
smoke_nomiss |
     Former  |   1.200043   .0130253    16.80   0.000     1.174783    1.225845
    Current  |   2.011967   .0330342    42.58   0.000     1.948252    2.077766
             |
1.htdiag_o~p |   .9867836   .0113177    -1.16   0.246     .9648488    1.009217
    1.asthma |          1  (omitted)
1.~c_disease |   1.473701    .015282    37.39   0.000     1.444051     1.50396
             |
     dm_type |
       T1DM  |   2.194822   .0977603    17.65   0.000     2.011341    2.395041
       T2DM  |   1.360124   .0154645    27.05   0.000      1.33015    1.390775
 UNKNOWN_DM  |   .9650262   .0221944    -1.55   0.122     .9224918    1.009522
             |
    1.cancer |   2.959293   .0291573   110.12   0.000     2.902694    3.016996
1.~r_disease |   3.064831   .0822608    41.73   0.000     2.907771    3.230376
    1.stroke |   1.523427   .0196542    32.63   0.000     1.485389     1.56244
  1.dementia |   2.423929   .0496233    43.25   0.000     2.328595    2.523167
1.other_ne~o |   2.152652   .0452034    36.51   0.000     2.065854    2.243098
             |
         ckd |
          2  |     1.0536   .0137251     4.01   0.000      1.02704    1.080847
          3  |   1.342839   .0203892    19.41   0.000     1.303466    1.383402
          4  |    2.07936    .042974    35.42   0.000     1.996815    2.165317
          5  |   3.876492   .1754832    29.93   0.000     3.547368    4.236152
             |
      1.esrf |   1.547082   .0847277     7.97   0.000     1.389621    1.722385
1.perm_imm~f |   1.077578   .2185197     0.37   0.713     .7241618    1.603475
1.temp_imm~f |   4.416371   .8098787     8.10   0.000     3.082985    6.326446
1.other_im~o |   1.120376   .2246973     0.57   0.571     .7562249     1.65988
1.ra_sle_p~s |   1.069825   .0178069     4.06   0.000     1.035487    1.105301
------------------------------------------------------------------------------
                                                             Stratified by stp
file E:\analyses\ethnicity-covid-research/output/tempdata/model2_ons_noncovidde
> ath_eth5.ster saved
file E:\analyses\ethnicity-covid-research/output/tempdata/model2_ons_noncovidde
> ath_eth5.dta saved

         failure _d:  ons_noncoviddeath
   analysis time _t:  (stime_ons_noncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

note: 1.asthma omitted because of collinearity
Iteration 0:   log likelihood = -587033.97
Iteration 1:   log likelihood = -541369.35
Iteration 2:   log likelihood = -516623.07
Iteration 3:   log likelihood = -514777.66
Iteration 4:   log likelihood = -514608.59
Iteration 5:   log likelihood =  -514577.9
Iteration 6:   log likelihood = -514575.85
Iteration 7:   log likelihood = -514575.84
Refining estimates:
Iteration 0:   log likelihood = -514575.84

Stratified Cox regr. -- Breslow method for ties

No. of subjects =    8,830,743                  Number of obs    =   8,830,743
No. of failures =       45,831
Time at risk    =   1592375010
                                                LR chi2(36)      =   144916.26
Log likelihood  =   -514575.84                  Prob > chi2      =      0.0000

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .7725282   .0221683    -8.99   0.000     .7302784    .8172223
      Black  |   .7395631   .0343934    -6.49   0.000     .6751343    .8101405
      Mixed  |   .7842682   .0650549    -2.93   0.003     .6665882    .9227235
      Other  |   .6996297   .0444513    -5.62   0.000     .6177131    .7924095
             |
        male |
       Male  |   1.145587   .0111434    13.97   0.000     1.123953    1.167637
        age1 |   1.218107   .0139618    17.21   0.000     1.191048    1.245782
        age2 |   .7582477   .0185321   -11.32   0.000     .7227817    .7954539
        age3 |   1.971493   .1105339    12.11   0.000     1.766329    2.200487
             |
         imd |
          2  |   1.122433   .0170542     7.60   0.000       1.0895    1.156361
          3  |   1.229159   .0187444    13.53   0.000     1.192964    1.266451
          4  |   1.399885   .0215789    21.82   0.000     1.358224    1.442825
5 most de..  |   1.617489   .0259039    30.03   0.000     1.567506    1.669065
             |
     hh_size |   1.002661   .0000404    65.95   0.000     1.002582     1.00274
         bmi |   .9515866   .0009776   -48.31   0.000     .9496725    .9535045
gp_consult~t |   1.012736   .0002009    63.78   0.000     1.012342     1.01313
             |
smoke_nomiss |
     Former  |   1.200349   .0130297    16.82   0.000     1.175081    1.226161
    Current  |   2.007455   .0330051    42.39   0.000     1.943797    2.073197
             |
1.htdiag_o~p |   .9895858   .0113563    -0.91   0.362     .9675763    1.012096
    1.asthma |          1  (omitted)
1.~c_disease |   1.474927   .0152969    37.47   0.000     1.445249    1.505216
             |
     dm_type |
       T1DM  |   2.199828   .0979854    17.70   0.000     2.015924    2.400508
       T2DM  |   1.361241   .0154751    27.13   0.000     1.331246    1.391912
 UNKNOWN_DM  |   .9678126   .0222529    -1.42   0.155      .925166    1.012425
             |
    1.cancer |   2.960918    .029157   110.23   0.000     2.904319     3.01862
1.~r_disease |   3.068151   .0823472    41.77   0.000     2.910925    3.233869
    1.stroke |   1.520207    .019613    32.46   0.000     1.482248    1.559138
  1.dementia |   2.372992   .0485928    42.20   0.000     2.279638    2.470169
1.other_ne~o |   2.144848   .0450409    36.34   0.000     2.058362    2.234969
             |
         ckd |
          2  |   1.054754   .0137398     4.09   0.000     1.028165     1.08203
          3  |   1.344185   .0204086    19.48   0.000     1.304774    1.384786
          4  |    2.08025   .0429886    35.45   0.000     1.997677    2.166235
          5  |   3.881859   .1757054    29.97   0.000     3.552317    4.241973
             |
      1.esrf |   1.549061    .084837     7.99   0.000     1.391397    1.724591
1.perm_imm~f |   1.083161   .2196451     0.39   0.694     .7279222    1.611762
1.temp_imm~f |   4.433782   .8130833     8.12   0.000     3.095123     6.35142
1.other_im~o |   1.117933   .2242095     0.56   0.578     .7545727    1.656267
1.ra_sle_p~s |   1.070192   .0178209     4.07   0.000     1.035827    1.105696
------------------------------------------------------------------------------
                                                             Stratified by stp
file E:\analyses\ethnicity-covid-research/output/tempdata/model3_ons_noncovidde
> ath_eth5.ster saved
file E:\analyses\ethnicity-covid-research/output/tempdata/model3_ons_noncovidde
> ath_eth5.dta saved
  48,892

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p | 10,973,518    1.98e+09           0   1.98e+09   1.98e+09
  1,540

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |  1,030,812    1.86e+08           0   1.86e+08   1.86e+08
  556

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    343,477    6.21e+07           0   6.21e+07   6.21e+07
  165

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    171,624    3.10e+07           0   3.10e+07   3.10e+07
  278

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
total_foll~p |    323,963    5.86e+07           0   5.86e+07   5.86e+07

. 
. file close tablecontent

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  E:\analyses\ethnicity-covid-research/output/log\06b_eth_an_multiva
> riable_eth5.log
  log type:  text
 closed on:  23 Jul 2020, 15:07:23
-------------------------------------------------------------------------------
