-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/01_eth_cr_analysis_dataset.log
  log type:  text
 opened on:  15 Jan 2021, 15:47:49

. 
. clear

. import delimited ./output/input.csv
(80 vars, 100,000 obs)

. 
. di "STARTING count FROM IMPORT:"
STARTING count FROM IMPORT:

. 
. ****************************
. *  Create required cohort  *
. ****************************
. 
. /* DROP ALL KIDS */
. noi di "DROPPING AGE<18:" 
DROPPING AGE<18:

. drop if age<18
(21,270 observations deleted)

. count
  78,730

. 
. * Age: Exclude those with implausible ages
. cap assert age<.

. noi di "DROPPING AGE<105:" 
DROPPING AGE<105:

. drop if age>105
(14 observations deleted)

. count
  78,716

. 
. * Sex: Exclude categories other than M and F
. cap assert inlist(sex, "M", "F", "I", "U")

. noi di "DROPPING GENDER NOT M/F:" 
DROPPING GENDER NOT M/F:

. drop if inlist(sex, "I", "U")
(0 observations deleted)

. 
. gen male = 1 if sex == "M"
(40,208 missing values generated)

. replace male = 0 if sex == "F"
(40,208 real changes made)

. label define male 0"Female" 1"Male"

. label values male male

. tab male

       male |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |     40,208       51.08       51.08
       Male |     38,508       48.92      100.00
------------+-----------------------------------
      Total |     78,716      100.00

. count
  78,716

. 
. /*  IMD  */
. * Group into 5 groups
. rename imd imd_o

. egen imd = cut(imd_o), group(5) icodes

. 
. * add one to create groups 1 - 5 
. replace imd = imd + 1
(78,716 real changes made)

. 
. * - 1 is missing, should be excluded from population 
. replace imd = .u if imd_o == -1
(0 real changes made)

. drop imd_o

. 
. * Reverse the order (so high is more deprived)
. recode imd 5 = 1 4 = 2 3 = 3 2 = 4 1 = 5 .u = .u
(imd: 78716 changes made)

. 
. label define imd 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived" .
> u "Unknown"

. label values imd imd 

. tab imd, m

             imd |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |     55,187       70.11       70.11
               4 |     15,665       19.90       90.01
 5 most deprived |      7,864        9.99      100.00
-----------------+-----------------------------------
           Total |     78,716      100.00

. 
. drop if imd==.u
(0 observations deleted)

. count
  78,716

. 
. 
. * Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. 
. *Start dates
. gen index                       = "01/02/2020"

. 
. * Date of cohort entry, 1 Feb 2020
. gen indexdate = date(index, "DMY")

. format indexdate %d

. 
. 
. *****************************************************************************
> **
. 
. 
. 
. /* CREATE VARIABLES==========================================================
> =*/
. 
. /* OUTCOME AND SURVIVAL TIME=================================================
> =*/
. 
.         
. /****   Outcome definitions   ****/
. ren primary_care_suspect_case   suspected_date

. ren primary_care_case                   confirmed_date

. ren first_tested_for_covid              tested_date

. ren first_positive_test_date    positivetest_date

. ren a_e_consult_date                    ae_date

. ren icu_date_admitted                   icu_date

. ren died_date_cpns                              cpnsdeath_date

. ren died_date_ons                               onsdeath_date

. ren covid_admission_date                hes_date

. 
. * Date of Covid death in ONS
. gen onscoviddeath_date = onsdeath_date if died_ons_covid_flag_any == 1
(73,780 missing values generated)

. gen onsconfirmeddeath_date = onsdeath_date if died_ons_confirmedcovid_flag_an
> y ==1
(74,782 missing values generated)

. gen onssuspecteddeath_date = onsdeath_date if died_ons_suspectedcovid_flag_an
> y ==1
(74,729 missing values generated)

. gen onsunderlyingdeath_date= onsdeath_date if died_ons_covid_flag_underlying=
> =1
(73,708 missing values generated)

. * Date of non-COVID death in ONS 
. * If missing date of death resulting died_date will also be missing
. gen ons_noncoviddeath_date = onsdeath_date if died_ons_covid_flag_any != 1
(63,955 missing values generated)

. 
. 
. /* CONVERT STRINGS TO DATE FOR OUTCOME VARIABLES ============================
> =*/
. * Recode to dates from the strings 
. *gen dummy date for infected and replace later on
. 
. foreach var of global outcomes {
  2.         confirm string variable `var'_date
  3.         rename `var'_date `var'_dstr
  4.         gen `var'_date = date(`var'_dstr, "YMD")
  5.         drop `var'_dstr
  6.         format `var'_date %td 
  7. 
. }
(59,007 missing values generated)
(59,023 missing values generated)
(62,947 missing values generated)
(59,057 missing values generated)
(73,780 missing values generated)
(74,782 missing values generated)
(73,708 missing values generated)
(63,955 missing values generated)
(59,019 missing values generated)

. 
. *If outcome occurs on the first day of follow-up add one day
. foreach i of global outcomes {
  2.         di "`i'"
  3.         count if `i'_date==indexdate
  4.         replace `i'_date=`i'_date+1 if `i'_date==indexdate
  5. }
tested
  0
(0 real changes made)
positivetest
  0
(0 real changes made)
icu
  0
(0 real changes made)
hes
  0
(0 real changes made)
onscoviddeath
  0
(0 real changes made)
onsconfirmeddeath
  0
(0 real changes made)
onsunderlyingdeath
  0
(0 real changes made)
ons_noncoviddeath
  0
(0 real changes made)
onsdeath
  0
(0 real changes made)

. *date of deregistration
. rename dereg_date dereg_dstr

.         gen dereg_date = date(dereg_dstr, "YMD")
(78,716 missing values generated)

.         drop dereg_dstr

.         format dereg_date %td 

. 
. * Binary indicators for outcomes
. foreach i of global outcomes {
  2.                 gen `i'=0
  3.                 replace  `i'=1 if `i'_date < .
  4.                 tab `i'
  5. }
(19,709 real changes made)

     tested |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     59,007       74.96       74.96
          1 |     19,709       25.04      100.00
------------+-----------------------------------
      Total |     78,716      100.00
(19,693 real changes made)

positivetes |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     59,023       74.98       74.98
          1 |     19,693       25.02      100.00
------------+-----------------------------------
      Total |     78,716      100.00
(15,769 real changes made)

        icu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     62,947       79.97       79.97
          1 |     15,769       20.03      100.00
------------+-----------------------------------
      Total |     78,716      100.00
(19,659 real changes made)

        hes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     59,057       75.03       75.03
          1 |     19,659       24.97      100.00
------------+-----------------------------------
      Total |     78,716      100.00
(4,936 real changes made)

onscoviddea |
         th |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     73,780       93.73       93.73
          1 |      4,936        6.27      100.00
------------+-----------------------------------
      Total |     78,716      100.00
(3,934 real changes made)

onsconfirme |
     ddeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     74,782       95.00       95.00
          1 |      3,934        5.00      100.00
------------+-----------------------------------
      Total |     78,716      100.00
(5,008 real changes made)

onsunderlyi |
    ngdeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     73,708       93.64       93.64
          1 |      5,008        6.36      100.00
------------+-----------------------------------
      Total |     78,716      100.00
(14,761 real changes made)

ons_noncovi |
     ddeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,955       81.25       81.25
          1 |     14,761       18.75      100.00
------------+-----------------------------------
      Total |     78,716      100.00
(19,697 real changes made)

   onsdeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     59,019       74.98       74.98
          1 |     19,697       25.02      100.00
------------+-----------------------------------
      Total |     78,716      100.00

. 
. /* CENSORING */
. /* SET FU DATES==============================================================
> =*/ 
. 
. * Censoring dates for each outcome (last date outcome data available)
. *https://github.com/opensafely/rapid-reports/blob/master/notebooks/latest-dat
> es.ipynb
. gen tested_censor_date = d("03/08/2020")

. gen positivetest_censor_date = d("03/08/2020")

. gen ae_censor_date = d("03/08/2020")

. gen hes_censor_date = d("03/08/2020")

. gen icu_censor_date = d("30/07/2020")

. gen cpnsdeath_censor_date  = d("03/08/2020")

. gen onsdeath_censor_date = d("03/08/2020")

. gen onscoviddeath_censor_date = d("03/08/2020")

. gen ons_noncoviddeath_censor_date = d("03/08/2020")

. gen onsconfirmeddeath_censor_date=d("03/08/2020")

. gen onsunderlyingdeath_censor_date=d("03/08/2020")

. *****************************************************************************
> **
. format *censor_date %d

. sum *censor_date, format

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
tested_cen~e |     78,716   03aug2020           0  03aug2020  03aug2020
posit~r_date |     78,716   03aug2020           0  03aug2020  03aug2020
ae_censor_~e |     78,716   03aug2020           0  03aug2020  03aug2020
hes_censor~e |     78,716   03aug2020           0  03aug2020  03aug2020
icu_censor~e |     78,716   30jul2020           0  30jul2020  30jul2020
-------------+---------------------------------------------------------
cpnsd~r_date |     78,716   03aug2020           0  03aug2020  03aug2020
onsdeath_c~e |     78,716   03aug2020           0  03aug2020  03aug2020
onscovidde.. |     78,716   03aug2020           0  03aug2020  03aug2020
ons_n~r_date |     78,716   03aug2020           0  03aug2020  03aug2020
onsconfirm.. |     78,716   03aug2020           0  03aug2020  03aug2020
-------------+---------------------------------------------------------
onsun~r_date |     78,716   03aug2020           0  03aug2020  03aug2020

. 
. 
. /* DEMOGRAPHICS */ 
. 
. * Ethnicity (5 category)
. label define ethnicity  1 "White"                                       ///
>                                                 2 "Mixed"                    
>                    ///
>                                                 3 "Asian or Asian British"   
>    ///
>                                                 4 "Black"                    
>                    ///
>                                                 5 "Other"                    
>                    

.                                                 
. label values ethnicity ethnicity

. tab ethnicity, m

             ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |     11,874       15.08       15.08
                 Mixed |     11,776       14.96       30.04
Asian or Asian British |     11,902       15.12       45.16
                 Black |     11,791       14.98       60.14
                 Other |     11,712       14.88       75.02
                     . |     19,661       24.98      100.00
-----------------------+-----------------------------------
                 Total |     78,716      100.00

. 
.  *re-order ethnicity
.  gen eth5=1 if ethnicity==1
(66,842 missing values generated)

.  replace eth5=2 if ethnicity==3
(11,902 real changes made)

.  replace eth5=3 if ethnicity==4
(11,791 real changes made)

.  replace eth5=4 if ethnicity==2
(11,776 real changes made)

.  replace eth5=5 if ethnicity==5
(11,712 real changes made)

.  replace eth5=6 if ethnicity==.
(19,661 real changes made)

. 
.  label define eth5              1 "White"                                    
>    ///
>                                                 2 "South Asian"           ///
>                                            
>                                                 3 "Black"                    
>                    ///
>                                                 4 "Mixed"                    
>                    ///
>                                                 5 "Other"                    
>                    ///
>                                                 6 "Unknown"

.                                         
. 
. label values eth5 eth5

. tab eth5, m

       eth5 |      Freq.     Percent        Cum.
------------+-----------------------------------
      White |     11,874       15.08       15.08
South Asian |     11,902       15.12       30.20
      Black |     11,791       14.98       45.18
      Mixed |     11,776       14.96       60.14
      Other |     11,712       14.88       75.02
    Unknown |     19,661       24.98      100.00
------------+-----------------------------------
      Total |     78,716      100.00

. 
. * Ethnicity (16 category)
. replace ethnicity_16 = 17 if ethnicity_16==.
(19,715 real changes made)

. label define ethnicity_16                                                    
>                    ///
>                                                 1 "British"             ///
>                                                 2 "Irish"                    
>                                    ///
>                                                 3 "Other White"              
>                            ///
>                                                 4 "White + Caribbean"        
>    ///
>                                                 5 "White + African"          
>            ///
>                                                 6 "White + Asian"            
>                            ///
>                                                 7 "Other mixed"              
>                            ///
>                                                 8 "Indian"              ///
>                                                 9 "Pakistani"   ///
>                                                 10 "Bangladeshi" ///
>                                                 11 "Other Asian"             
>                            ///
>                                                 12 "Caribbean"               
>                            ///
>                                                 13 "African"                 
>                            ///
>                                                 14 "Other Black"             
>                            ///
>                                                 15 "Chinese"                 
>                            ///
>                                                 16 "Other"                   
>                                    ///
>                                                 17 "Unknown"

.                                                 
. label values ethnicity_16 ethnicity_16

. tab ethnicity_16,m

     ethnicity_16 |      Freq.     Percent        Cum.
------------------+-----------------------------------
          British |      3,747        4.76        4.76
            Irish |      3,625        4.61        9.37
      Other White |      3,714        4.72       14.08
White + Caribbean |      3,790        4.81       18.90
  White + African |      3,676        4.67       23.57
    White + Asian |      3,709        4.71       28.28
      Other mixed |      3,666        4.66       32.94
           Indian |      3,685        4.68       37.62
        Pakistani |      3,741        4.75       42.37
      Bangladeshi |      3,753        4.77       47.14
      Other Asian |      3,671        4.66       51.80
        Caribbean |      3,711        4.71       56.52
          African |      3,574        4.54       61.06
      Other Black |      3,670        4.66       65.72
          Chinese |      3,608        4.58       70.30
            Other |      3,661        4.65       74.95
          Unknown |     19,715       25.05      100.00
------------------+-----------------------------------
            Total |     78,716      100.00

. 
. 
. * Ethnicity (16 category grouped further)
. * Generate a version of the full breakdown with mixed in one group
. gen eth16 = ethnicity_16

. recode eth16 4/7 = 99 //mixed
(eth16: 14841 changes made)

. recode eth16 8 = 4
(eth16: 3685 changes made)

. recode eth16 9 = 5
(eth16: 3741 changes made)

. recode eth16 10 = 6
(eth16: 3753 changes made)

. recode eth16 11= 7
(eth16: 3671 changes made)

. recode eth16 12 = 8
(eth16: 3711 changes made)

. recode eth16 13 = 9
(eth16: 3574 changes made)

. recode eth16 14 = 10
(eth16: 3670 changes made)

. recode eth16 15 = 11
(eth16: 3608 changes made)

. recode eth16 99 = 12
(eth16: 14841 changes made)

. recode eth16 16 = 13
(eth16: 3661 changes made)

. recode eth16 17 = 14
(eth16: 19715 changes made)

. 
. label define eth16      ///
>                                                 1 "British" ///
>                                                 2 "Irish" ///
>                                                 3 "Other White" ///
>                                                 4 "Indian" ///
>                                                 5 "Pakistani" ///
>                                                 6 "Bangladeshi" ///     
>                                                 7 "Other Asian" ///
>                                                 8 "Caribbean" ///
>                                                 9 "African" ///
>                                                 10 "Other Black" ///
>                                                 11 "Chinese" ///
>                                                 12 "All mixed" ///
>                                                 13  "Other" ///
>                                                 14 "Unknown"

. label values eth16 eth16

. tab eth16,m

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |      3,747        4.76        4.76
      Irish |      3,625        4.61        9.37
Other White |      3,714        4.72       14.08
     Indian |      3,685        4.68       18.76
  Pakistani |      3,741        4.75       23.52
Bangladeshi |      3,753        4.77       28.29
Other Asian |      3,671        4.66       32.95
  Caribbean |      3,711        4.71       37.66
    African |      3,574        4.54       42.20
Other Black |      3,670        4.66       46.87
    Chinese |      3,608        4.58       51.45
  All mixed |     14,841       18.85       70.30
      Other |      3,661        4.65       74.95
    Unknown |     19,715       25.05      100.00
------------+-----------------------------------
      Total |     78,716      100.00

. 
. tab eth16 eth5, m

            |                    eth5
      eth16 |     White  South Asi      Black      Mixed |     Total
------------+--------------------------------------------+----------
    British |       559        573        560        560 |     3,747 
      Irish |       568        533        530        553 |     3,625 
Other White |       562        576        597        499 |     3,714 
     Indian |       567        562        530        543 |     3,685 
  Pakistani |       584        523        575        533 |     3,741 
Bangladeshi |       571        562        547        577 |     3,753 
Other Asian |       570        582        563        558 |     3,671 
  Caribbean |       519        560        586        558 |     3,711 
    African |       571        538        523        509 |     3,574 
Other Black |       534        590        528        529 |     3,670 
    Chinese |       564        536        547        521 |     3,608 
  All mixed |     2,225      2,268      2,124      2,287 |    14,841 
      Other |       515        521        512        589 |     3,661 
    Unknown |     2,965      2,978      3,069      2,960 |    19,715 
------------+--------------------------------------------+----------
      Total |    11,874     11,902     11,791     11,776 |    78,716 


            |         eth5
      eth16 |     Other    Unknown |     Total
------------+----------------------+----------
    British |       570        925 |     3,747 
      Irish |       534        907 |     3,625 
Other White |       523        957 |     3,714 
     Indian |       564        919 |     3,685 
  Pakistani |       536        990 |     3,741 
Bangladeshi |       572        924 |     3,753 
Other Asian |       529        869 |     3,671 
  Caribbean |       559        929 |     3,711 
    African |       538        895 |     3,574 
Other Black |       572        917 |     3,670 
    Chinese |       541        899 |     3,608 
  All mixed |     2,234      3,703 |    14,841 
      Other |       570        954 |     3,661 
    Unknown |     2,870      4,873 |    19,715 
------------+----------------------+----------
      Total |    11,712     19,661 |    78,716 

. bysort eth5: tab eth16, m

-------------------------------------------------------------------------------
-> eth5 = White

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |        559        4.71        4.71
      Irish |        568        4.78        9.49
Other White |        562        4.73       14.22
     Indian |        567        4.78       19.00
  Pakistani |        584        4.92       23.92
Bangladeshi |        571        4.81       28.73
Other Asian |        570        4.80       33.53
  Caribbean |        519        4.37       37.90
    African |        571        4.81       42.71
Other Black |        534        4.50       47.20
    Chinese |        564        4.75       51.95
  All mixed |      2,225       18.74       70.69
      Other |        515        4.34       75.03
    Unknown |      2,965       24.97      100.00
------------+-----------------------------------
      Total |     11,874      100.00

-------------------------------------------------------------------------------
-> eth5 = South Asian

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |        573        4.81        4.81
      Irish |        533        4.48        9.29
Other White |        576        4.84       14.13
     Indian |        562        4.72       18.85
  Pakistani |        523        4.39       23.25
Bangladeshi |        562        4.72       27.97
Other Asian |        582        4.89       32.86
  Caribbean |        560        4.71       37.57
    African |        538        4.52       42.09
Other Black |        590        4.96       47.04
    Chinese |        536        4.50       51.55
  All mixed |      2,268       19.06       70.60
      Other |        521        4.38       74.98
    Unknown |      2,978       25.02      100.00
------------+-----------------------------------
      Total |     11,902      100.00

-------------------------------------------------------------------------------
-> eth5 = Black

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |        560        4.75        4.75
      Irish |        530        4.49        9.24
Other White |        597        5.06       14.31
     Indian |        530        4.49       18.80
  Pakistani |        575        4.88       23.68
Bangladeshi |        547        4.64       28.32
Other Asian |        563        4.77       33.09
  Caribbean |        586        4.97       38.06
    African |        523        4.44       42.50
Other Black |        528        4.48       46.98
    Chinese |        547        4.64       51.62
  All mixed |      2,124       18.01       69.63
      Other |        512        4.34       73.97
    Unknown |      3,069       26.03      100.00
------------+-----------------------------------
      Total |     11,791      100.00

-------------------------------------------------------------------------------
-> eth5 = Mixed

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |        560        4.76        4.76
      Irish |        553        4.70        9.45
Other White |        499        4.24       13.69
     Indian |        543        4.61       18.30
  Pakistani |        533        4.53       22.83
Bangladeshi |        577        4.90       27.73
Other Asian |        558        4.74       32.46
  Caribbean |        558        4.74       37.20
    African |        509        4.32       41.53
Other Black |        529        4.49       46.02
    Chinese |        521        4.42       50.44
  All mixed |      2,287       19.42       69.86
      Other |        589        5.00       74.86
    Unknown |      2,960       25.14      100.00
------------+-----------------------------------
      Total |     11,776      100.00

-------------------------------------------------------------------------------
-> eth5 = Other

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |        570        4.87        4.87
      Irish |        534        4.56        9.43
Other White |        523        4.47       13.89
     Indian |        564        4.82       18.71
  Pakistani |        536        4.58       23.28
Bangladeshi |        572        4.88       28.17
Other Asian |        529        4.52       32.68
  Caribbean |        559        4.77       37.46
    African |        538        4.59       42.05
Other Black |        572        4.88       46.93
    Chinese |        541        4.62       51.55
  All mixed |      2,234       19.07       70.63
      Other |        570        4.87       75.50
    Unknown |      2,870       24.50      100.00
------------+-----------------------------------
      Total |     11,712      100.00

-------------------------------------------------------------------------------
-> eth5 = Unknown

      eth16 |      Freq.     Percent        Cum.
------------+-----------------------------------
    British |        925        4.70        4.70
      Irish |        907        4.61        9.32
Other White |        957        4.87       14.19
     Indian |        919        4.67       18.86
  Pakistani |        990        5.04       23.90
Bangladeshi |        924        4.70       28.59
Other Asian |        869        4.42       33.01
  Caribbean |        929        4.73       37.74
    African |        895        4.55       42.29
Other Black |        917        4.66       46.96
    Chinese |        899        4.57       51.53
  All mixed |      3,703       18.83       70.36
      Other |        954        4.85       75.21
    Unknown |      4,873       24.79      100.00
------------+-----------------------------------
      Total |     19,661      100.00


. 
. * STP 
. rename stp stp_old

. bysort stp_old: gen stp = 1 if _n==1
(78,706 missing values generated)

. replace stp = sum(stp)
(78,715 real changes made)

. drop stp_old

. 
. 
. 
. 
. /*  Age variables  */ 
. 
. * Create categorised age 
. recode age      0/17.9999=0 ///
>                         18/29.9999 = 1 /// 
>                     30/39.9999 = 2 /// 
>                         40/49.9999 = 3 ///
>                         50/59.9999 = 4 ///
>                         60/69.9999 = 5 ///
>                         70/79.9999 = 6 ///
>                         80/max = 7, gen(agegroup) 
(78716 differences between age and agegroup)

. 
. label define agegroup   0 "0-<18" ///
>                                                 1 "18-<30" ///
>                                                 2 "30-<40" ///
>                                                 3 "40-<50" ///
>                                                 4 "50-<60" ///
>                                                 5 "60-<70" ///
>                                                 6 "70-<80" ///
>                                                 7 "80+"

.                                                 
. label values agegroup agegroup

. 
. 
. 
. 
. 
. 
. **************************** HOUSEHOLD VARS**********************************
> *********
. **care home
. encode care_home_type, gen(carehometype)

. drop care_home_type

. 
. gen carehome=0

. replace carehome=1 if carehometype<4
(11,732 real changes made)

. tab  carehometype carehome, m

carehomety |       carehome
        pe |         0          1 |     Total
-----------+----------------------+----------
        PC |         0      3,869 |     3,869 
        PN |         0      3,882 |     3,882 
        PS |         0      3,981 |     3,981 
         U |    66,984          0 |    66,984 
-----------+----------------------+----------
     Total |    66,984     11,732 |    78,716 

. 
. *check for missing household size values
. codebook  hh_size, d

-------------------------------------------------------------------------------
hh_size                                                             (unlabeled)
-------------------------------------------------------------------------------

                  type:  numeric (byte)

                 range:  [3,12]                       units:  1
         unique values:  10                       missing .:  0/78,716

                  mean:   7.49802
              std. dev:   1.03912

           percentiles:        10%       25%       50%       75%       90%
                                 6         7         7         8         9

. 
. *gen categories of household size.
. gen hh_total_cat=.
(78,716 missing values generated)

. replace hh_total_cat=1 if hh_size >=1 & hh_size<=2
(0 real changes made)

. replace hh_total_cat=2 if hh_size >=3 & hh_size<=5
(1,737 real changes made)

. replace hh_total_cat=3 if hh_size >=6 & hh_size<=10
(76,867 real changes made)

. replace hh_total_cat=4 if hh_size>10 & hh_size!=.
(112 real changes made)

. replace hh_total_cat=9 if hh_size==0  //unknown
(0 real changes made)

. replace hh_total_cat=5 if carehome==1  
(11,732 real changes made)

. 
. 
. *who are people with missing household size
. count if hh_total_cat==.
  0

. count if hh_size==.
  0

. bysort  hh_total_cat: summ hh_size

-------------------------------------------------------------------------------
-> hh_total_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     hh_size |      1,489    4.912021    .2995009          3          5

-------------------------------------------------------------------------------
-> hh_total_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     hh_size |     65,399    7.553174    .9663189          6         10

-------------------------------------------------------------------------------
-> hh_total_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     hh_size |         96    11.05208    .2233615         11         12

-------------------------------------------------------------------------------
-> hh_total_cat = 5

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
     hh_size |     11,732    7.489686    1.028937          3         11


. 
. label define hh_total_cat 1 "1-2" ///
>                                                 2 "3-5" ///
>                                                 3 "6-10" ///
>                                                 4 "11+" ///
>                                                 5 "carehome" ///
>                                                 9 "Unknown"

.                                                                              
>            
. label values hh_total_cat hh_total_cat

. 
. tab hh_total_cat,m

hh_total_ca |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
        3-5 |      1,489        1.89        1.89
       6-10 |     65,399       83.08       84.97
        11+ |         96        0.12       85.10
   carehome |     11,732       14.90      100.00
------------+-----------------------------------
      Total |     78,716      100.00

. tab hh_total_cat carehome,m 

hh_total_c |       carehome
        at |         0          1 |     Total
-----------+----------------------+----------
       3-5 |     1,489          0 |     1,489 
      6-10 |    65,399          0 |    65,399 
       11+ |        96          0 |        96 
  carehome |         0     11,732 |    11,732 
-----------+----------------------+----------
     Total |    66,984     11,732 |    78,716 

. 
. *create second hh_total_cat excluding 11+ households for sensitivity analysis
. gen hh_cat_2=hh_total_cat

. replace hh_cat_2=. if hh_total_cat==4
(96 real changes made, 96 to missing)

. label values  hh_cat_2 hh_total_cat

. 
. 
. *log linear household size
. gen hh_linear=hh_size if hh_size>=1 & hh_size!=.

. replace hh_linear=11 if hh_linear>=11 & hh_linear!=.
(5 real changes made)

. gen hh_log_linear=log(hh_linear)

. sum hh_log_linear hh_linear

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hh_log_lin~r |     78,716    2.004722    .1423114   1.098612   2.397895
   hh_linear |     78,716    7.497955    1.038879          3         11

. 
. 
. /* CONVERT STRINGS TO DATE===================================================
> =*/
. /* Comorb dates dates are given with month only, so adding day 
> 15 to enable  them to be processed as dates                       */
. 
. *cr date for diabetes based on adjudicated type
. gen diabetes=type1_diabetes if diabetes_type=="T1DM"
(78,219 missing values generated)

. replace diabetes=type2_diabetes if diabetes_type=="T2DM"
(3,046 real changes made)

. replace diabetes=unknown_diabetes if diabetes_type=="UNKNOWN_DM"
(315 real changes made)

. 
. drop type1_diabetes type2_diabetes unknown_diabetes

. 
. foreach var of varlist  chronic_respiratory_disease ///
>                                                 chronic_cardiac_disease  ///
>                                                 cancer  ///
>                                                 permanent_immunodeficiency  /
> //
>                                                 temporary_immunodeficiency  /
> //
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke                  ///
>                                                 dementia ///
>                                                 esrf  ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 diabetes ///
>                                                 bmi_date_measured   ///
>                                                 bp_sys_date_measured   ///
>                                                 bp_dias_date_measured   ///
>                                                 creatinine_date  ///
>                                                 hba1c_mmol_per_mol_date  ///
>                                                 hba1c_percentage_date ///
>                                                 smoking_status_date ///
>                                                 insulin ///
>                                                 statin ///
>                                                 ace_inhibitors ///
>                                                 arbs ///
>                                                 alpha_blockers ///
>                                                 betablockers ///
>                                                 calcium_channel_blockers ///
>                                                 spironolactone  ///
>                                                 thiazide_diuretics ///       
>                                    
>                                                 {
  2.                                                         
.                 capture confirm string variable `var'
  3.                 if _rc!=0 {
  4.                         cap assert `var'==.
  5.                         rename `var' `var'_date
  6.                 }
  7.         
.                 else {
  8.                                 replace `var' = `var' + "-15"
  9.                                 rename `var' `var'_dstr
 10.                                 replace `var'_dstr = " " if `var'_dstr == 
> "-15"
 11.                                 gen `var'_date = date(`var'_dstr, "YMD") 
 12.                                 order `var'_date, after(`var'_dstr)
 13.                                 drop `var'_dstr
 14.                 }
 15.         
.         format `var'_date %td
 16. }
variable chronic_respiratory_disease was str7 now str10
(78,716 real changes made)
(62,940 real changes made)
(62,940 missing values generated)
variable chronic_cardiac_disease was str7 now str10
(78,716 real changes made)
(62,994 real changes made)
(62,994 missing values generated)
variable cancer was str7 now str10
(78,716 real changes made)
(62,973 real changes made)
(62,973 missing values generated)
variable permanent_immunodeficiency was str7 now str10
(78,716 real changes made)
(63,047 real changes made)
(63,047 missing values generated)
variable temporary_immunodeficiency was str7 now str10
(78,716 real changes made)
(62,955 real changes made)
(62,955 missing values generated)
variable chronic_liver_disease was str7 now str10
(78,716 real changes made)
(62,896 real changes made)
(62,896 missing values generated)
variable other_neuro was str7 now str10
(78,716 real changes made)
(63,027 real changes made)
(63,027 missing values generated)
variable stroke was str7 now str10
(78,716 real changes made)
(63,059 real changes made)
(63,059 missing values generated)
variable dementia was str7 now str10
(78,716 real changes made)
(62,970 real changes made)
(62,970 missing values generated)
variable esrf was str7 now str10
(78,716 real changes made)
(62,874 real changes made)
(62,874 missing values generated)
variable hypertension was str7 now str10
(78,716 real changes made)
(63,007 real changes made)
(63,007 missing values generated)
variable ra_sle_psoriasis was str7 now str10
(78,716 real changes made)
(62,956 real changes made)
(62,956 missing values generated)
variable diabetes was str7 now str10
(78,716 real changes made)
(74,858 real changes made)
(74,858 missing values generated)
variable bmi_date_measured was str7 now str10
(78,716 real changes made)
(3,937 real changes made)
(3,937 missing values generated)
variable bp_sys_date_measured was str7 now str10
(78,716 real changes made)
(3,915 real changes made)
(3,915 missing values generated)
variable bp_dias_date_measured was str7 now str10
(78,716 real changes made)
(3,944 real changes made)
(3,944 missing values generated)
variable creatinine_date was str7 now str10
(78,716 real changes made)
(3,949 real changes made)
(3,949 missing values generated)
variable hba1c_mmol_per_mol_date was str7 now str10
(78,716 real changes made)
(3,970 real changes made)
(3,970 missing values generated)
variable hba1c_percentage_date was str7 now str10
(78,716 real changes made)
(3,956 real changes made)
(3,956 missing values generated)
variable smoking_status_date was str7 now str10
(78,716 real changes made)
(63,344 real changes made)
(63,344 missing values generated)
variable insulin was str7 now str10
(78,716 real changes made)
(63,028 real changes made)
(63,028 missing values generated)
variable statin was str7 now str10
(78,716 real changes made)
(63,001 real changes made)
(63,001 missing values generated)

. 
. * Note - outcome dates are handled separtely below 
. 
. * Some names too long for loops below, shorten
. rename permanent_immunodeficiency_date  perm_immunodef_date

. rename temporary_immunodeficiency_date  temp_immunodef_date

. rename bmi_date_measured_date                   bmi_measured_date

. 
. /* CREATE BINARY VARIABLES===================================================
> =*/
. *  Make indicator variables for all conditions where relevant 
. 
. foreach var of varlist  chronic_respiratory_disease ///
>                                                 chronic_cardiac_disease  ///
>                                                 cancer  ///
>                                                 perm_immunodef  ///
>                                                 temp_immunodef  ///
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke                  ///
>                                                 dementia ///
>                                                 esrf  ///
>                                                 hypertension  ///
>                                                 ra_sle_psoriasis  ///
>                                                 bmi_measured_date   ///
>                                                 bp_sys_date_measured   ///
>                                                 bp_dias_date_measured   ///
>                                                 creatinine_date  ///
>                                                 hba1c_mmol_per_mol_date  ///
>                                                 hba1c_percentage_date ///
>                                                 smoking_status_date ///
>                                                 insulin ///
>                                                 statin ///
>                                                 ace_inhibitors ///
>                                                 arbs ///
>                                                 alpha_blockers ///
>                                                 betablockers ///
>                                                 calcium_channel_blockers ///
>                                                 spironolactone  ///
>                                                 thiazide_diuretics ///       
>                                    
>                                                 {
  2.                                                 
.         /* date ranges are applied in python, so presence of date indicates p
> resence of 
>           disease in the correct time frame */ 
.         local newvar =  substr("`var'", 1, length("`var'") - 5)
  3.         gen `newvar' = (`var'!=. )
  4.         order `newvar', after(`var')
  5.         tab `newvar', m
  6.         
. }

chronic_res |
piratory_di |
      sease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     62,940       79.96       79.96
          1 |     15,776       20.04      100.00
------------+-----------------------------------
      Total |     78,716      100.00

chronic_car |
diac_diseas |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     62,994       80.03       80.03
          1 |     15,722       19.97      100.00
------------+-----------------------------------
      Total |     78,716      100.00

     cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     62,973       80.00       80.00
          1 |     15,743       20.00      100.00
------------+-----------------------------------
      Total |     78,716      100.00

perm_immuno |
        def |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,047       80.09       80.09
          1 |     15,669       19.91      100.00
------------+-----------------------------------
      Total |     78,716      100.00

temp_immuno |
        def |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     62,955       79.98       79.98
          1 |     15,761       20.02      100.00
------------+-----------------------------------
      Total |     78,716      100.00

chronic_liv |
 er_disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     62,896       79.90       79.90
          1 |     15,820       20.10      100.00
------------+-----------------------------------
      Total |     78,716      100.00

other_neuro |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,027       80.07       80.07
          1 |     15,689       19.93      100.00
------------+-----------------------------------
      Total |     78,716      100.00

     stroke |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,059       80.11       80.11
          1 |     15,657       19.89      100.00
------------+-----------------------------------
      Total |     78,716      100.00

   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     62,970       80.00       80.00
          1 |     15,746       20.00      100.00
------------+-----------------------------------
      Total |     78,716      100.00

       esrf |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     62,874       79.87       79.87
          1 |     15,842       20.13      100.00
------------+-----------------------------------
      Total |     78,716      100.00

hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,007       80.04       80.04
          1 |     15,709       19.96      100.00
------------+-----------------------------------
      Total |     78,716      100.00

ra_sle_psor |
      iasis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     62,956       79.98       79.98
          1 |     15,760       20.02      100.00
------------+-----------------------------------
      Total |     78,716      100.00

bmi_measure |
          d |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,937        5.00        5.00
          1 |     74,779       95.00      100.00
------------+-----------------------------------
      Total |     78,716      100.00

bp_sys_date |
  _measured |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,915        4.97        4.97
          1 |     74,801       95.03      100.00
------------+-----------------------------------
      Total |     78,716      100.00

bp_dias_dat |
 e_measured |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,944        5.01        5.01
          1 |     74,772       94.99      100.00
------------+-----------------------------------
      Total |     78,716      100.00

creatinine_ |
       date |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,949        5.02        5.02
          1 |     74,767       94.98      100.00
------------+-----------------------------------
      Total |     78,716      100.00

hba1c_mmol_ |
per_mol_dat |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,970        5.04        5.04
          1 |     74,746       94.96      100.00
------------+-----------------------------------
      Total |     78,716      100.00

hba1c_perce |
 ntage_date |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,956        5.03        5.03
          1 |     74,760       94.97      100.00
------------+-----------------------------------
      Total |     78,716      100.00

smoking_sta |
   tus_date |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,344       80.47       80.47
          1 |     15,372       19.53      100.00
------------+-----------------------------------
      Total |     78,716      100.00

    insulin |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,028       80.07       80.07
          1 |     15,688       19.93      100.00
------------+-----------------------------------
      Total |     78,716      100.00

     statin |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,001       80.04       80.04
          1 |     15,715       19.96      100.00
------------+-----------------------------------
      Total |     78,716      100.00

ace_inhibit |
        ors |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     55,085       69.98       69.98
          1 |     23,631       30.02      100.00
------------+-----------------------------------
      Total |     78,716      100.00

       arbs |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     55,198       70.12       70.12
          1 |     23,518       29.88      100.00
------------+-----------------------------------
      Total |     78,716      100.00

alpha_block |
        ers |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     55,083       69.98       69.98
          1 |     23,633       30.02      100.00
------------+-----------------------------------
      Total |     78,716      100.00

betablocker |
          s |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     55,232       70.17       70.17
          1 |     23,484       29.83      100.00
------------+-----------------------------------
      Total |     78,716      100.00

calcium_cha |
nnel_blocke |
         rs |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     55,119       70.02       70.02
          1 |     23,597       29.98      100.00
------------+-----------------------------------
      Total |     78,716      100.00

spironolact |
        one |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     55,134       70.04       70.04
          1 |     23,582       29.96      100.00
------------+-----------------------------------
      Total |     78,716      100.00

thiazide_di |
    uretics |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     55,112       70.01       70.01
          1 |     23,604       29.99      100.00
------------+-----------------------------------
      Total |     78,716      100.00

. 
. 
. /*  Body Mass Index  */
. * NB: watch for missingness
. 
. * Recode strange values 
. replace bmi = . if bmi == 0 
(0 real changes made)

. replace bmi = . if !inrange(bmi, 15, 50)
(6,635 real changes made, 6,635 to missing)

. 
. * Restrict to within 10 years of index and aged > 16 
. gen bmi_time = (indexdate - bmi_measured_date)/365.25
(3,937 missing values generated)

. gen bmi_age = age - bmi_time
(3,937 missing values generated)

. 
. replace bmi = . if bmi_age < 16 
(3,659 real changes made, 3,659 to missing)

. replace bmi = . if bmi_time > 10 & bmi_time != . 
(0 real changes made)

. 
. * Set to missing if no date, and vice versa 
. replace bmi = . if bmi_measured_date == . 
(0 real changes made)

. replace bmi_measured_date = . if bmi == . 
(10,294 real changes made, 10,294 to missing)

. replace bmi_measured = . if bmi == . 
(14,231 real changes made, 14,231 to missing)

. 
. * BMI (NB: watch for missingness)
. gen     bmicat = .
(78,716 missing values generated)

. recode  bmicat . = 1 if bmi<18.5
(bmicat: 1936 changes made)

. recode  bmicat . = 2 if bmi<25
(bmicat: 7757 changes made)

. recode  bmicat . = 3 if bmi<30
(bmicat: 10615 changes made)

. recode  bmicat . = 4 if bmi<35
(bmicat: 13528 changes made)

. recode  bmicat . = 5 if bmi<40
(bmicat: 13565 changes made)

. recode  bmicat . = 6 if bmi<.
(bmicat: 17084 changes made)

. replace bmicat = .u if bmi>=.
(14,231 real changes made, 14,231 to missing)

. 
. label define bmicat 1 "Underweight (<18.5)"     ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                  
>    ///
>                                         .u "Unknown (.u)"

. label values bmicat bmicat

. 
. * Create more granular categorisation
. recode bmicat 1/3 .u = 1 4=2 5=3 6=4, gen(obese4cat)
(76780 differences between bmicat and obese4cat)

. 
. label define obese4cat  1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9)"        
>    ///
>                                                 3 "Obese II (35-39.9)"       
>    ///
>                                                 4 "Obese III (40+)"          
>    

. label values obese4cat obese4cat

. order obese4cat, after(bmicat)

. 
. 
. 
. **generate BMI categories for south asians
. *https://www.nice.org.uk/guidance/ph46/chapter/1-Recommendations#recommendati
> on-2-bmi-assessment-multi-component-interventions-and-best-practice-standards
. 
. gen bmicat_sa=bmicat
(14,231 missing values generated)

. replace bmicat_sa = 2 if bmi>=18.5 & bmi <23 & eth5==2
(0 real changes made)

. replace bmicat_sa = 3 if bmi>=23 & bmi < 27.5 & eth5==2
(468 real changes made)

. replace bmicat_sa = 4 if bmi>=27.5 & bmi < 32.5 & eth5==2
(869 real changes made)

. replace bmicat_sa = 5 if bmi>=32.5 & bmi < 37.5 & eth5==2
(1,079 real changes made)

. replace bmicat_sa = 6 if bmi>=37.5 & bmi < . & eth5==2
(942 real changes made)

. replace bmicat_sa = 7 if bmi==.
(14,231 real changes made)

. 
. tab bmicat_sa

  bmicat_sa |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,936        2.46        2.46
          2 |      7,289        9.26       11.72
          3 |     10,214       12.98       24.70
          4 |     13,318       16.92       41.61
          5 |     13,702       17.41       59.02
          6 |     18,026       22.90       81.92
          7 |     14,231       18.08      100.00
------------+-----------------------------------
      Total |     78,716      100.00

. 
. label define bmicat_sa 1 "Underweight (<18.5)"  ///
>                                         2 "Normal (18.5-24.9 / 22.9)"        
>    ///
>                                         3 "Overweight (25-29.9 / 23-27.4)"   
>    ///
>                                         4 "Obese I (30-34.9 / 27.4-32.4)"    
>            ///
>                                         5 "Obese II (35-39.9 / 32.5- 37.4)"  
>            ///
>                                         6 "Obese III (40+ / 37.5+)"          
>            ///
>                                         7 "Unknown"

. label values bmicat_sa bmicat_sa

. 
. * Create more granular categorisation
. recode bmicat_sa 1/3 .u = 1 4=2 5=3 6=4, gen(obese4cat_sa)
(62549 differences between bmicat_sa and obese4cat_sa)

. 
. label define obese4cat_sa       1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9 / 27.5-32
> .5)"               ///
>                                                 3 "Obese II (35-39.9 / 32.5- 
> 37.4)"             ///
>                                                 4 "Obese III (40+ / 37.5+)"  
>            

. label values obese4cat_sa obese4cat_sa

. order obese4cat_sa, after(bmicat_sa)

. 
. 
. /*  Smoking  */
. 
. * Smoking 
. label define smoke 1 "Never" 2 "Former" 3 "Current" .u "Unknown (.u)"

. 
. gen     smoke = 1  if smoking_status == "N"
(75,530 missing values generated)

. replace smoke = 2  if smoking_status == "E"
(1,611 real changes made)

. replace smoke = 3  if smoking_status == "S"
(9,482 real changes made)

. replace smoke = .u if smoking_status == "M"
(1,497 real changes made, 1,497 to missing)

. replace smoke = .u if smoking_status == "" 
(62,940 real changes made, 62,940 to missing)

. 
. label values smoke smoke

. drop smoking_status

. 
. * Create non-missing 3-category variable for current smoking
. * Assumes missing smoking is never smoking 
. recode smoke .u = 1, gen(smoke_nomiss)
(64437 differences between smoke and smoke_nomiss)

. order smoke_nomiss, after(smoke)

. label values smoke_nomiss smoke

. 
. /* CLINICAL COMORBIDITIES */ 
. 
. /*  Cancer */
. label define cancer 1 "Never" 2 "Last year" 3 "2-5 years ago" 4 "5+ years"

. 
. * malignancies
. gen     cancer_cat = 4 if inrange(cancer_date, d(1/1/1900), d(1/2/2015))
(64,570 missing values generated)

. replace cancer_cat = 3 if inrange(cancer_date, d(1/2/2015), d(1/2/2019))
(1,270 real changes made)

. replace cancer_cat = 2 if inrange(cancer_date, d(1/2/2019), d(1/2/2020))
(327 real changes made)

. recode  cancer_cat . = 1
(cancer_cat: 62973 changes made)

. label values cancer_cat cancer

. 
. /*  Immunosuppression  */
. 
. * Immunosuppressed:
. * Permanent immunodeficiency ever, OR 
. * Temporary immunodeficiency  last year
. gen temp1  = 1 if perm_immunodef_date!=.
(63,047 missing values generated)

. gen temp2  = inrange(temp_immunodef_date, (indexdate - 365), indexdate)

. 
. 
. gen immunosuppressed=0

. replace immunosuppressed=1 if perm_immunodef==1 | temp_immunodef==1
(28,271 real changes made)

. tab immunosuppressed

immunosuppr |
      essed |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     50,445       64.08       64.08
          1 |     28,271       35.92      100.00
------------+-----------------------------------
      Total |     78,716      100.00

. 
. /*  Blood pressure   */
. 
. /*set implausible BP values to missing
> https://onlinelibrary.wiley.com/doi/full/10.1111/jch.12743
> SBP (DBP) values outside of the range of 50–300 (30–250) mm Hg were considere
> d implausible and threrefore excluded. */
. 
. replace bp_sys=. if bp_sys<50 | bp_sys>300
(117 real changes made, 117 to missing)

. replace bp_dias=. if bp_dias<30 | bp_dias>250
(0 real changes made)

. 
. * Categorise
. gen     bpcat = 1 if bp_sys < 120 &  bp_dias < 80
(78,714 missing values generated)

. replace bpcat = 2 if inrange(bp_sys, 120, 130) & bp_dias<80
(0 real changes made)

. replace bpcat = 3 if inrange(bp_sys, 130, 140) | inrange(bp_dias, 80, 90)
(89 real changes made)

. replace bpcat = 4 if (bp_sys>=140 & bp_sys<.) | (bp_dias>=90 & bp_dias<.) 
(74,681 real changes made)

. replace bpcat = 5 if bp_sys>=. | bp_dias>=. | bp_sys==0 | bp_dias==0
(7,784 real changes made)

. 
. label define bpcat 1 "Normal" 2 "Elevated" 3 "High, stage I"    ///
>                                         4 "High, stage II" 5 "Unknown"

. label values bpcat bpcat

. 
. recode bpcat 5=1, gen(bpcat_nomiss)
(7784 differences between bpcat and bpcat_nomiss)

. label values bpcat_nomiss bpcat

. 
. * Create non-missing indicator of known high blood pressure
. gen bphigh = (bpcat==4)

. 
. /*  Hypertension  */
. 
. gen htdiag_or_highbp = bphigh

. recode htdiag_or_highbp 0 = 1 if hypertension==1 
(htdiag_or_highbp: 1574 changes made)

. 
. 
. 
. *Mean arterial pressure MAP = (SBP+(DBP*2))/3
. gen bp_map=(bp_sys + (bp_dias*2))/3
(7,784 missing values generated)

. 
. ren bpcat bp_cat

. ************
. *   eGFR   *
. ************
. 
. * Set implausible creatinine values to missing (Note: zero changed to missing
> )
. replace creatinine = . if !inrange(creatinine, 20, 3000) 
(277 real changes made, 277 to missing)

.         
. * Divide by 88.4 (to convert umol/l to mg/dl)
. gen SCr_adj = creatinine/88.4
(4,226 missing values generated)

. 
. gen min=.
(78,716 missing values generated)

. replace min = SCr_adj/0.7 if male==0
(38,019 real changes made)

. replace min = SCr_adj/0.9 if male==1
(36,471 real changes made)

. replace min = min^-0.329  if male==0
(38,019 real changes made)

. replace min = min^-0.411  if male==1
(36,471 real changes made)

. replace min = 1 if min<1
(20,803 real changes made)

. 
. gen max=.
(78,716 missing values generated)

. replace max=SCr_adj/0.7 if male==0
(38,019 real changes made)

. replace max=SCr_adj/0.9 if male==1
(36,471 real changes made)

. replace max=max^-1.209
(74,490 real changes made)

. replace max=1 if max>1
(57,913 real changes made)

. 
. gen egfr=min*max*141
(4,226 missing values generated)

. replace egfr=egfr*(0.993^age)
(74,490 real changes made)

. replace egfr=egfr*1.018 if male==0
(38,019 real changes made)

. label var egfr "egfr calculated using CKD-EPI formula with no eth"

. 
. * Categorise into ckd stages
. egen egfr_cat = cut(egfr), at(0, 30, 60, 5000)
(4226 missing values generated)

. 
. label define egfr_cat 5000 "None" 60 "Stage 3 egfr 30-6" 30 "Stage 4/5 egfr<3
> 0"

. label values egfr_cat egfr_cat 

. lab var  egfr_cat "CKD category"

. tab egfr_cat

     CKD category |      Freq.     Percent        Cum.
------------------+-----------------------------------
Stage 4/5 egfr<30 |        858        1.15        1.15
Stage 3 egfr 30-6 |     73,632       98.85      100.00
------------------+-----------------------------------
            Total |     74,490      100.00

. 
. gen egfr60=0

. replace egfr60=1 if egfr<60
(858 real changes made)

. lab define egfr60 0"egfr >=60" 1"eGFR <60"

. label values egfr60 egfr60

. tab egfr60

     egfr60 |      Freq.     Percent        Cum.
------------+-----------------------------------
  egfr >=60 |     77,858       98.91       98.91
   eGFR <60 |        858        1.09      100.00
------------+-----------------------------------
      Total |     78,716      100.00

. 
. /* Hb1AC */
. 
. /*  Diabetes severity  */
. 
. * Set zero or negative to missing
. replace hba1c_percentage   = . if hba1c_percentage <= 0
(462 real changes made, 462 to missing)

. replace hba1c_mmol_per_mol = . if hba1c_mmol_per_mol <= 0
(1,738 real changes made, 1,738 to missing)

. 
. /* Express  HbA1c as percentage  */ 
. 
. * Express all values as perecentage 
. noi summ hba1c_percentage hba1c_mmol_per_mol 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hba1c_per~ge |     74,298    5.030218    1.951432   .0009638   14.31793
hba1c_mmol~l |     73,008    41.12605    18.83106     .00049   126.9083

. gen     hba1c_pct = hba1c_percentage 
(4,418 missing values generated)

. replace hba1c_pct = (hba1c_mmol_per_mol/10.929)+2.15 if hba1c_mmol_per_mol<. 
(73,008 real changes made)

. 
. * Valid % range between 0-20  /195 mmol/mol
. replace hba1c_pct = . if !inrange(hba1c_pct, 0, 20) 
(0 real changes made)

. replace hba1c_pct = round(hba1c_pct, 0.1)
(78,414 real changes made)

. 
. 
. /* Categorise hba1c and diabetes  */
. /* Diabetes type */
. gen dm_type=1 if diabetes_type=="T1DM"
(76,294 missing values generated)

. replace dm_type=2 if diabetes_type=="T2DM"
(15,623 real changes made)

. replace dm_type=3 if diabetes_type=="UNKNOWN_DM"
(1,533 real changes made)

. replace dm_type=0 if diabetes_type=="NO_DM"
(59,138 real changes made)

. 
. tab dm_type diabetes_type

           |                diabetes_type
   dm_type |     NO_DM       T1DM       T2DM  UNKNOWN.. |     Total
-----------+--------------------------------------------+----------
         0 |    59,138          0          0          0 |    59,138 
         1 |         0      2,422          0          0 |     2,422 
         2 |         0          0     15,623          0 |    15,623 
         3 |         0          0          0      1,533 |     1,533 
-----------+--------------------------------------------+----------
     Total |    59,138      2,422     15,623      1,533 |    78,716 

. label define dm_type 0"No DM" 1"T1DM" 2"T2DM" 3"UNKNOWN_DM"

. label values dm_type dm_type

. 
. *Open safely diabetes codes with exeter algorithm
. gen dm_type_exeter_os=1 if diabetes_exeter_os=="T1DM_EX_OS"
(76,331 missing values generated)

. replace dm_type_exeter_os=2 if diabetes_exeter_os=="T2DM_EX_OS"
(15,827 real changes made)

. replace dm_type_exeter_os=0 if diabetes_exeter_os=="NO_DM"
(60,504 real changes made)

. label values  dm_type_exeter_os dm_type

. 
. * Group hba1c
. gen     hba1ccat = 0 if hba1c_pct <  6.5
(28,691 missing values generated)

. replace hba1ccat = 1 if hba1c_pct >= 6.5  & hba1c_pct < 7.5
(14,002 real changes made)

. replace hba1ccat = 2 if hba1c_pct >= 7.5  & hba1c_pct < 8
(4,916 real changes made)

. replace hba1ccat = 3 if hba1c_pct >= 8    & hba1c_pct < 9
(6,059 real changes made)

. replace hba1ccat = 4 if hba1c_pct >= 9    & hba1c_pct !=.
(3,412 real changes made)

. replace hba1ccat = 5 if hba1c_pct==.
(302 real changes made)

. label define hba1ccat 0 "<6.5%" 1">=6.5-7.4" 2">=7.5-7.9" 3">=8-8.9" 4">=9" 5
> "Unknown"

. label values hba1ccat hba1ccat

. tab hba1ccat

   hba1ccat |      Freq.     Percent        Cum.
------------+-----------------------------------
      <6.5% |     50,025       63.55       63.55
  >=6.5-7.4 |     14,002       17.79       81.34
  >=7.5-7.9 |      4,916        6.25       87.58
    >=8-8.9 |      6,059        7.70       95.28
        >=9 |      3,412        4.33       99.62
    Unknown |        302        0.38      100.00
------------+-----------------------------------
      Total |     78,716      100.00

. 
. gen hba1c75=0 if hba1c_pct<7.5
(14,689 missing values generated)

. replace hba1c75=1 if hba1c_pct>=7.5 & hba1c_pct!=.
(14,387 real changes made)

. label define hba1c75 0"<7.5" 1">=7.5"

. tab hba1c75, m

    hba1c75 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     64,027       81.34       81.34
          1 |     14,387       18.28       99.62
          . |        302        0.38      100.00
------------+-----------------------------------
      Total |     78,716      100.00

. 
. * Create diabetes, split by control/not
. gen     diabcat = 1 if dm_type==0
(19,578 missing values generated)

. replace diabcat = 2 if dm_type==1 & inlist(hba1ccat, 0, 1)
(1,946 real changes made)

. replace diabcat = 3 if dm_type==1 & inlist(hba1ccat, 2, 3, 4)
(468 real changes made)

. replace diabcat = 4 if dm_type==2 & inlist(hba1ccat, 0, 1)
(12,736 real changes made)

. replace diabcat = 5 if dm_type==2 & inlist(hba1ccat, 2, 3, 4)
(2,818 real changes made)

. replace diabcat = 6 if dm_type==1 & hba1c_pct==. | dm_type==2 & hba1c_pct==.
(77 real changes made)

. 
. 
. label define diabcat    1 "No diabetes"                         ///
>                                                 2 "T1DM, controlled"         
>    ///
>                                                 3 "T1DM, uncontrolled"       
>    ///
>                                                 4 "T2DM, controlled"         
>    ///
>                                                 5 "T2DM, uncontrolled"       
>    ///
>                                                 6 "Diabetes, no HbA1c"

. label values diabcat diabcat

. tab diabcat, m

           diabcat |      Freq.     Percent        Cum.
-------------------+-----------------------------------
       No diabetes |     59,138       75.13       75.13
  T1DM, controlled |      1,946        2.47       77.60
T1DM, uncontrolled |        468        0.59       78.20
  T2DM, controlled |     12,736       16.18       94.37
T2DM, uncontrolled |      2,818        3.58       97.95
Diabetes, no HbA1c |         77        0.10       98.05
                 . |      1,533        1.95      100.00
-------------------+-----------------------------------
             Total |     78,716      100.00

. 
. /*  Asthma  */
. * Asthma  (coded: 0 No, 1 Yes no OCS, 2 Yes with OCS)
. tab asthma

     asthma |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     12,615       79.63       79.63
          1 |      1,620       10.23       89.85
          2 |      1,608       10.15      100.00
------------+-----------------------------------
      Total |     15,843      100.00

. replace asthma=0 if asthma==.
(62,873 real changes made)

. replace asthma=1 if asthma==2
(1,608 real changes made)

. tab asthma

     asthma |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     75,488       95.90       95.90
          1 |      3,228        4.10      100.00
------------+-----------------------------------
      Total |     78,716      100.00

. 
. *gen count of co-morbidities
. gen comorbidity_count=0

. 
. foreach var of varlist  chronic_respiratory_disease ///
>                                                 chronic_cardiac_disease  ///
>                                                 cancer  ///
>                                                 perm_immunodef  ///
>                                                 temp_immunodef  ///
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke                  ///
>                                                 dementia ///
>                                                 esrf  ///
>                                                 hypertension  ///
>                                                 asthma ///
>                                                 ra_sle_psoriasis  ///
>                                                 {
  2. replace comorbidity_count=comorbidity_count+1 if `var'==1
  3.                                                 }
(15,776 real changes made)
(15,722 real changes made)
(15,743 real changes made)
(15,669 real changes made)
(15,761 real changes made)
(15,820 real changes made)
(15,689 real changes made)
(15,657 real changes made)
(15,746 real changes made)
(15,842 real changes made)
(15,709 real changes made)
(3,228 real changes made)
(15,760 real changes made)

. 
. summ comorbidity_count

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidit~t |     78,716    2.440698    1.394576          0         10

. 
. *comorbidities category 
. gen comorbidity_cat =comorbidity_count

. replace comorbidity_cat=4 if comorbidity_count>=4 & comorbidity_count!=.
(6,087 real changes made)

. bysort comorbidity_cat: sum comorbidity_count

-------------------------------------------------------------------------------
-> comorbidity_cat = 0

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidi~nt |      5,184           0           0          0          0

-------------------------------------------------------------------------------
-> comorbidity_cat = 1

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidi~nt |     15,544           1           0          1          1

-------------------------------------------------------------------------------
-> comorbidity_cat = 2

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidi~nt |     22,405           2           0          2          2

-------------------------------------------------------------------------------
-> comorbidity_cat = 3

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidi~nt |     18,723           3           0          3          3

-------------------------------------------------------------------------------
-> comorbidity_cat = 4

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
comorbidi~nt |     16,860    4.483926    .7446607          4         10


. tab comorbidity_cat,m

comorbidity |
       _cat |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,184        6.59        6.59
          1 |     15,544       19.75       26.33
          2 |     22,405       28.46       54.80
          3 |     18,723       23.79       78.58
          4 |     16,860       21.42      100.00
------------+-----------------------------------
      Total |     78,716      100.00

. 
. *******************************
. *  Recode implausible values  *
. *******************************
. 
. *make combination_bp_meds binary
. tab combination_bp_meds

combination |
   _bp_meds |      Freq.     Percent        Cum.
------------+-----------------------------------
         -5 |          1        0.00        0.00
         -4 |          6        0.03        0.03
         -3 |         31        0.13        0.16
         -2 |        106        0.45        0.61
         -1 |        422        1.79        2.40
          0 |      3,177       13.49       15.89
          1 |      3,557       15.10       31.00
          2 |      4,414       18.74       49.74
          3 |      4,585       19.47       69.20
          4 |      3,501       14.86       84.07
          5 |      2,161        9.18       93.24
          6 |      1,053        4.47       97.72
          7 |        403        1.71       99.43
          8 |         94        0.40       99.83
          9 |         36        0.15       99.98
         10 |          5        0.02      100.00
------------+-----------------------------------
      Total |     23,552      100.00

. replace combination_bp_meds=0 if combination_bp_meds<0 
(566 real changes made)

. replace combination_bp_meds=1 if combination_bp_meds>0 & combination_bp_meds!
> =.
(16,252 real changes made)

. tab combination_bp_meds

combination |
   _bp_meds |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,743       15.89       15.89
          1 |     19,809       84.11      100.00
------------+-----------------------------------
      Total |     23,552      100.00

. 
. * BMI 
. * Set implausible BMIs to missing:
. replace bmi = . if !inrange(bmi, 15, 50)
(0 real changes made)

. 
. *GP consult count
. replace gp_consult_count=0 if gp_consult_count==. | gp_consult_count<0
(23,807 real changes made)

. summ gp_consult_count

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
gp_consult~t |     78,716    2.479928    2.299544          0         12

. 
. /**** Create survival times  ****/
. * For looping later, name must be stime_binary_outcome_name
. 
. * Survival time = last followup date (first: deregistration date, end study, 
> death, or that outcome)
. *Ventilation does not have a survival time because it is a yes/no flag
. foreach i of global outcomes {
  2.         gen stime_`i' = min(`i'_censor_date, onsdeath_date, `i'_date, dere
> g_date)
  3. }

. 
. * If outcome occurs after censoring, set to zero
. foreach i of global outcomes {
  2.         replace `i'=0 if `i'_date>stime_`i'
  3.         tab `i'
  4. }
(9,955 real changes made)

     tested |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     68,962       87.61       87.61
          1 |      9,754       12.39      100.00
------------+-----------------------------------
      Total |     78,716      100.00
(9,956 real changes made)

positivetes |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     68,979       87.63       87.63
          1 |      9,737       12.37      100.00
------------+-----------------------------------
      Total |     78,716      100.00
(15,687 real changes made)

        icu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     78,634       99.90       99.90
          1 |         82        0.10      100.00
------------+-----------------------------------
      Total |     78,716      100.00
(10,132 real changes made)

        hes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     69,189       87.90       87.90
          1 |      9,527       12.10      100.00
------------+-----------------------------------
      Total |     78,716      100.00
(2,302 real changes made)

onscoviddea |
         th |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     76,082       96.65       96.65
          1 |      2,634        3.35      100.00
------------+-----------------------------------
      Total |     78,716      100.00
(1,830 real changes made)

onsconfirme |
     ddeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     76,612       97.33       97.33
          1 |      2,104        2.67      100.00
------------+-----------------------------------
      Total |     78,716      100.00
(2,381 real changes made)

onsunderlyi |
    ngdeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     76,089       96.66       96.66
          1 |      2,627        3.34      100.00
------------+-----------------------------------
      Total |     78,716      100.00
(6,928 real changes made)

ons_noncovi |
     ddeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     70,883       90.05       90.05
          1 |      7,833        9.95      100.00
------------+-----------------------------------
      Total |     78,716      100.00
(9,230 real changes made)

   onsdeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     68,249       86.70       86.70
          1 |     10,467       13.30      100.00
------------+-----------------------------------
      Total |     78,716      100.00

. 
. * Format date variables
. format  stime* %td 

. 
. /*distribution of outcome dates
> foreach i of global outcomes {
>         histogram `i'_date, discrete width(15) frequency ytitle(`i') xtitle(D
> ate) scheme(meta) 
> graph export "$Tabfigdir/outcome_`i'_freq.svg", as(svg) replace
> }
> */
. /* LABEL VARIABLES===========================================================
> =*/
. *  Label variables you are intending to keep, drop the rest 
. 
. *HH variable
. label var  hh_size "# people in household"

. label var  hh_id "Household ID"

. label var hh_total "# people in household calculated"

. label var hh_total_cat "Number of people in household"

. label var hh_log_linear "Log linear household size"

. label var hh_linear "Linear household size"

. label var hh_cat_2 "Household carehome excluding 11+"

. label var is_prison "Household status is a prison"

. 
. * Demographics
. label var patient_id                            "Patient ID"

. label var age                                           "Age (years)"

. label var agegroup                                      "Grouped age"

. label var sex                                           "Sex"

. label var male                                          "Male"

. label var bmi                                           "Body Mass Index (BMI
> , kg/m2)"

. label var bmicat                                        "BMI"

. label var bmicat_sa                                     "BMI with SA categori
> es"

. label var bmi_measured_date             "Body Mass Index (BMI, kg/m2), date m
> easured"

. label var obese4cat                                     "Obesity (4 categorie
> s)"

. label var obese4cat_sa                          "Obesity with SA categories"

. label var smoke                                         "Smoking status"

. label var smoke_nomiss                          "Smoking status (missing set 
> to non)"

. label var imd                                           "Index of Multiple De
> privation (IMD)"

. label var eth5                                          "Eth 5 categories"

. label var ethnicity_16                          "Eth 16 categories"

. label var eth16                                         "Eth 16 collapsed"

. label var stp                                           "Sustainability and T
> ransformation Partnership"

. label var age1                                          "Age spline 1"

. label var age2                                          "Age spline 2"

. label var age3                                          "Age spline 3"

. lab var region                                          "Region of England"

. lab var rural_urban                                     "Rural-Urban Indicato
> r"

. lab var carehome                                        "Care home y/n"

. lab var hba1c_mmol_per_mol                      "HbA1c mmo/mol"

. lab var hba1c_pct                                       "HbA1c %"

. lab var hba1ccat                                        "HbA1c category"

. lab var hba1c75                                         "HbA1c >= 7.5%"

. lab var gp_consult_count                        "Number of GP consultations i
> n the 12 months prior to baseline"

. 
. * Comorbidities of interest 
. label var comorbidity_count                     "Count of co-morbid condition
> s"

. label var comorbidity_cat                               "Catgeorised co-morbi
> dity count"

. label var asthma                                                "Asthma categ
> ory"

. label var hypertension                              "Diagnosed hypertension"

. label var chronic_respiratory_disease   "Chronic Respiratory Diseases"

. label var chronic_cardiac_disease               "Chronic Cardiac Diseases"

. label var dm_type                                               "Diabetes Typ
> e"

. label var dm_type_exeter_os                             "Diabetes type (Exete
> r definition)"

. label var cancer                                                "Cancer"

. label var immunosuppressed                              "Immunosuppressed (pe
> rm or temp)"

. label var chronic_liver_disease                 "Chronic liver disease"

. label var other_neuro                                   "Neurological disease
> "                  

. label var stroke                                            "Stroke"

. lab var dementia                                                "Dementia"   
>                                                    

. label var ra_sle_psoriasis                              "Autoimmune disease"

. lab var egfr                                                    "eGFR"

. lab var egfr_cat                                                "CKD category
>  defined by eGFR"

. lab var egfr60                                                  "CKD defined 
> by egfr<60"

. lab var  bphigh                                                 "non-missing 
> indicator of known high blood pressure"

. lab var bp_cat                                                  "Blood pressu
> re four levels non-missing"

. lab var htdiag_or_highbp                                "High blood pressure 
> or hypertension diagnosis"

. lab var bp_sys                                                  "Systolic BP"

. lab var bp_dias                                                 "Diastolic BP
> "

. lab var bp_map                                                  "Mean Arteria
> l Pressure"

. lab var esrf                                                    "end stage re
> nal failure"

. label var hypertension_date                                     "Diagnosed hy
> pertension Date"

. label var chronic_respiratory_disease_date      "Other Respiratory Diseases D
> ate"

. label var chronic_cardiac_disease_date          "Other Heart Diseases Date"

. label var diabetes_date                                         "Diabetes Dat
> e"

. label var cancer_date                                           "Cancer Date"

. label var chronic_liver_disease_date            "Chronic liver disease Date"

. label var other_neuro_date                                      "Neurological
>  disease  Date"

. label var stroke_date                                   "Stroke date"        
>    

. label var dementia_date                                         "DDementia da
> te"                                        

. label var ra_sle_psoriasis_date                         "Autoimmune disease  
> Date"

. lab var esrf_date                                                       "end 
> stage renal failure"

. lab var hba1c_percentage_date                           "HbA1c % date"

. 
. 
. *medications
. lab var statin                                                          "Stat
> in in last 12 months"

. lab var insulin                                                         "Insu
> lin in last 12 months"

. lab var ace_inhibitors                                          "ACE in last 
> 12 months"

. lab var alpha_blockers                                          "Alpha blocke
> r in last 12 months"

. lab var arbs                                                            "ARB 
> in last 12 months"

. lab var betablockers                                            "Beta blocker
>  in last 12 months"

. lab var calcium_channel_blockers                        "CCB in last 12 month
> s"

. lab var combination_bp_meds                             "BP med in last 12 mo
> nths"

. lab var spironolactone                                          "Spironolacto
> ne in last 12 months"

. lab var thiazide_diuretics                                      "TZD in last 
> 12 months"

. 
. lab var statin_date                                                     "Stat
> in in last 12 months"

. lab var insulin_date                                            "Insulin in l
> ast 12 months"

. lab var ace_inhibitors_date                             "ACE in last 12 month
> s"

. lab var alpha_blockers_date                             "Alpha blocker in las
> t 12 months"

. lab var arbs_date                                                       "ARB 
> in last 12 months"

. lab var betablockers_date                                       "Beta blocker
>  in last 12 months"

. lab var calcium_channel_blockers_date           "CCB in last 12 months"

. lab var spironolactone_date                             "Spironolactone in la
> st 12 months"

. lab var thiazide_diuretics_date                         "TZD in last 12 month
> s"

. 
. * Outcomes and follow-up
. label var indexdate                                     "Date of study start 
> (Feb 1 2020)"

. foreach i of global outcomes {
  2.         label var `i'_censor_date                "Date of admin censoring"
  3. }

. *Outcome dates
. foreach i of global outcomes {
  2.         label var `i'_date                                      "Failure d
> ate:  `i'"
  3.         d `i'_date
  4. }

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
tested_date     float   %td                   Failure date:  tested

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
positive~t_date float   %td                   Failure date:  positivetest

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
icu_date        float   %td                   Failure date:  icu

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
hes_date        float   %td                   Failure date:  hes

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
onscovid~h_date float   %td                   Failure date:  onscoviddeath

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
onsconfi~h_date float   %td                   Failure date:  onsconfirmeddeath

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
onsunder~h_date float   %td                   Failure date:  onsunderlyingdeath

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
ons_nonc~h_date float   %td                   Failure date:  ons_noncoviddeath

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
onsdeath_date   float   %td                   Failure date:  onsdeath

. 
. * Survival times
. foreach i of global outcomes {
  2.         lab var stime_`i'                                       "Survivati
> me (date): `i'"
  3.         d stime_`i'
  4. }

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_tested    float   %td                   Survivatime (date): tested

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_positiv~t float   %td                   Survivatime (date): positivetest

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_icu       float   %td                   Survivatime (date): icu

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_hes       float   %td                   Survivatime (date): hes

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_onscovi~h float   %td                   Survivatime (date): onscoviddeath

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_onsconf~h float   %td                   Survivatime (date):
                                                onsconfirmeddeath

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_onsunde~h float   %td                   Survivatime (date):
                                                onsunderlyingdeath

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_ons_non~h float   %td                   Survivatime (date):
                                                ons_noncoviddeath

              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------
stime_onsdeath  float   %td                   Survivatime (date): onsdeath

. 
. * binary outcome indicators
. foreach i of global outcomes {
  2.         lab var `i'                                     "outcome `i'"
  3.         tab `i'
  4. }

    outcome |
     tested |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     68,962       87.61       87.61
          1 |      9,754       12.39      100.00
------------+-----------------------------------
      Total |     78,716      100.00

    outcome |
positivetes |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     68,979       87.63       87.63
          1 |      9,737       12.37      100.00
------------+-----------------------------------
      Total |     78,716      100.00

outcome icu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     78,634       99.90       99.90
          1 |         82        0.10      100.00
------------+-----------------------------------
      Total |     78,716      100.00

outcome hes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     69,189       87.90       87.90
          1 |      9,527       12.10      100.00
------------+-----------------------------------
      Total |     78,716      100.00

    outcome |
onscoviddea |
         th |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     76,082       96.65       96.65
          1 |      2,634        3.35      100.00
------------+-----------------------------------
      Total |     78,716      100.00

    outcome |
onsconfirme |
     ddeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     76,612       97.33       97.33
          1 |      2,104        2.67      100.00
------------+-----------------------------------
      Total |     78,716      100.00

    outcome |
onsunderlyi |
    ngdeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     76,089       96.66       96.66
          1 |      2,627        3.34      100.00
------------+-----------------------------------
      Total |     78,716      100.00

    outcome |
ons_noncovi |
     ddeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     70,883       90.05       90.05
          1 |      7,833        9.95      100.00
------------+-----------------------------------
      Total |     78,716      100.00

    outcome |
   onsdeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     68,249       86.70       86.70
          1 |     10,467       13.30      100.00
------------+-----------------------------------
      Total |     78,716      100.00

. label var advanced_resp_support_flag            "outcome: Advanced respirator
> y support"

. 
. label var basic_resp_support_flag               "outcome: Basic respiratory s
> upport"

. label var any_resp_support_flag "outcome: Any respiratory support"

. 
. /* TIDY DATA=================================================================
> =*/
. *  Drop variables that are not needed (those not labelled)
. ds, not(varlabel)
confirmed_~e  bp_sys_dat~d  perm_immun~e  hba1c_per~ge  carehometype
primary_c~se  bp_dias_da~e  perm_immun~f  creatinine    bmi_time
primary_c~re  bp_dias_da~d  temp_immun~e  diabetes_t~e  bmi_age
suspected_~e  ~l_date_date  temp_immun~f  diabetes_e~s  cancer_cat
ae_date       hba1c~l_date  died_ons_c..  diabetes_e~r  temp1
cpnsd~h_date  hba1c_perc..  d~nfirmedc~y  index         temp2
ethni~6_date  crea~te_date  died_ons_s~y  onssuspect~e  SCr_adj
ethni~y_date  crea~ne_date  died_ons_c~g  dereg_date    min
bmi_measured  smoki~e_date  ethnicity     ae_censor_~e  max
bp_sys_dat~e  smoki~s_date  has_consul~y  cpnsd~r_date  diabcat

. drop `r(varlist)'

.         
. 
. /* APPLY INCLUSION/EXCLUIONS=================================================
> =*/ 
. 
. count
  78,716

. 
. noi di "DROP AGE >110:"
DROP AGE >110:

. drop if age > 110 & age != .
(0 observations deleted)

. 
. count
  78,716

. noi di "DROP IF DIED BEFORE INDEX"
DROP IF DIED BEFORE INDEX

. 
. *fix death dates
. drop if onsdeath_date <= indexdate
(0 observations deleted)

. count 
  78,716

. 
. sort patient_id

. save ./output/analysis_dataset.dta, replace
(note: file ./output/analysis_dataset.dta not found)
file ./output/analysis_dataset.dta saved

. 
. /****************************************************************
> *  Create outcome specific datasets for the whole population  *
> *****************************************************************
> 
> 
> foreach i of global outcomes {
>         use ./output/analysis_dataset.dta, clear
>         drop if `i'_date <= indexdate 
>         stset stime_`i', fail(`i')                              ///     
>         id(patient_id) enter(indexdate) origin(indexdate)
>         save ./output/analysis_dataset_STSET_`i'.dta, replace
> }       
> 
> 
>         
> * Close log file 
> log close
> 
> 

end of do-file
