-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/07a_eth_sensanalysis_nostp_eth16.log
  log type:  text
 opened on:   6 Jan 2021, 15:55:47

. 
. cap file close tablecontent

. file open tablecontent using ./output/sens_nostp_eth16.txt, write text replac
> e
(note: file ./output/sens_nostp_eth16.txt not found)

. file write tablecontent ("Table 2: Association between ethnicity in 16 catego
> ries and COVID-19 outcomes - no STP") _n

. file write tablecontent _tab ("Denominator") _tab ("Event") _tab ("Total pers
> on-weeks") _tab ("Rate per 1,000") _tab ("with stp") _tab _tab ("without stp"
> )   _tab _tab  _n

. file write tablecontent _tab _tab _tab _tab _tab   ("HR") _tab ("95% CI") _ta
> b  ("HR") _tab ("95% CI")  _tab _tab _n

. 
. 
. foreach i of global outcomes {
  2.         di "`i'"
  3.         
. * Open Stata dataset
. use ./output/analysis_dataset_STSET_`i'.dta, clear
  4. drop if carehome==1
  5. 
. 
. /* Main Model================================================================
> =*/
.  
.                                                                              
>    
. * with strata
. stcox i.ethnicity_16 i.male age1 age2 age3      i.imd                        
>                    ///
>                                                                              
>    i.bmicat_sa     i.hba1ccat                      ///
>                                                                              
>    gp_consult_count                        ///
>                                                                              
>    i.smoke_nomiss                          ///
>                                                                              
>    i.hypertension i.bp_cat         ///     
>                                                                              
>    i.asthma                                        ///
>                                                                              
>    i.chronic_respiratory_disease ///
>                                                                              
>    i.chronic_cardiac_disease       ///
>                                                                              
>    i.dm_type                                       ///     
>                                                                              
>    i.cancer                    ///
>                                                                              
>    i.chronic_liver_disease         ///
>                                                                              
>    i.stroke                                        ///
>                                                                              
>    i.dementia                                      ///
>                                                                              
>    i.other_neuro                           ///
>                                                                              
>    i.egfr60                                        ///
>                                                                              
>    i.esrf                                          ///
>                                                                              
>    i.immunosuppressed                      ///
>                                                                              
>    i.ra_sle_psoriasis                      ///
>                                                                              
>    i.hh_total_cat, strata(stp) nolog               
  6. estimates save ./output/model/modela_`i'_eth16, replace
  7. eststo modela
  8. 
. parmest, label eform format(estimate p lb ub) saving(./output/model/modela_`i
> '_eth16, replace) idstr(modela_`i'_eth16) 
  9. local hr "`hr' ./output/model/modela_`i'_eth16 "
 10. 
. 
. * without strata
. stcox i.ethnicity_16 i.male age1 age2 age3      i.imd                        
>                    ///
>                                                                              
>    i.bmicat_sa     i.hba1ccat                      ///
>                                                                              
>    gp_consult_count                        ///
>                                                                              
>    i.smoke_nomiss                          ///
>                                                                              
>    i.hypertension i.bp_cat         ///     
>                                                                              
>    i.asthma                                        ///
>                                                                              
>    i.chronic_respiratory_disease ///
>                                                                              
>    i.chronic_cardiac_disease       ///
>                                                                              
>    i.dm_type                                       ///     
>                                                                              
>    i.cancer                    ///
>                                                                              
>    i.chronic_liver_disease         ///
>                                                                              
>    i.stroke                                        ///
>                                                                              
>    i.dementia                                      ///
>                                                                              
>    i.other_neuro                           ///
>                                                                              
>    i.egfr60                                        ///
>                                                                              
>    i.esrf                                          ///
>                                                                              
>    i.immunosuppressed                      ///
>                                                                              
>    i.ra_sle_psoriasis                      ///
>                                                                              
>    i.hh_total_cat,  nolog          
 11. estimates save ./output/model/modelb_`i'_eth16, replace
 12. eststo modelb
 13. 
. parmest, label eform format(estimate p lb ub) saving(./output/model/modelb_`i
> '_eth16, replace) idstr(modelb_`i'_eth16) 
 14. local hr "`hr' ./output/model/modelb_`i'_eth16 "
 15. 
. /* Estout================================================================*/ 
. esttab modela modelb using ./output/estout_sens_nostp_eth16.txt, b(a2) ci(2) 
> label wide compress eform ///
>         title ("`i'") ///
>         varlabels(`e(labels)') ///
>         stats(N_sub) ///
>         append 
 16. eststo clear
 17. 
.                                                                              
>    
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. 
. * Column headings 
. file write tablecontent ("`i'") _n
 18. 
. * eth16 labelled columns
. 
. local lab1: label ethnicity_16 1
 19. local lab2: label ethnicity_16 2
 20. local lab3: label ethnicity_16 3
 21. local lab4: label ethnicity_16 4
 22. local lab5: label ethnicity_16 5
 23. local lab6: label ethnicity_16 6
 24. local lab7: label ethnicity_16 7
 25. local lab8: label ethnicity_16 8
 26. local lab9: label ethnicity_16 9
 27. local lab10: label ethnicity_16 10
 28. local lab11: label ethnicity_16 11
 29. local lab12: label ethnicity_16 12
 30. local lab13: label ethnicity_16 13
 31. local lab14: label ethnicity_16 14
 32. local lab15: label ethnicity_16 15
 33. local lab16: label ethnicity_16 16
 34. local lab17: label ethnicity_16 17
 35. 
. /* counts */
.  
. * First row, eth16 = 1 (White British) reference cat
.         qui safecount if ethnicity_16==1
 36.         local denominator = r(N)
 37.         qui safecount if ethnicity_16 == 1 & `i' == 1
 38.         local event = r(N)
 39.     bysort eth16: egen total_follow_up = total(_t)
 40.         qui su total_follow_up if ethnicity_16 == 1
 41.         local person_week = r(mean)/7
 42.         local rate = 1000*(`event'/`person_week')
 43.         
.         file write tablecontent  ("`lab1'") _tab (`denominator') _tab (`event
> ') _tab %10.0f (`person_week') _tab %3.2f (`rate') _tab
 44.         file write tablecontent ("1.00") _tab _tab ("1.00") _tab _tab ("1.
> 00")  _tab _tab ("1.00") _tab _tab ("1.00") _n
 45.         
. * Subsequent ethnic groups
. forvalues eth=2/17 {
 46.         qui safecount if ethnicity_16==`eth'
 47.         local denominator = r(N)
 48.         qui safecount if ethnicity_16 == `eth' & `i' == 1
 49.         local event = r(N)
 50.         qui su total_follow_up if ethnicity_16 == `eth'
 51.         local person_week = r(mean)/7
 52.         local rate = 1000*(`event'/`person_week')
 53.         file write tablecontent  ("`lab`eth''") _tab (`denominator') _tab 
> (`event') _tab %10.0f (`person_week') _tab %3.2f (`rate') _tab  
 54.         cap estimates use ./output/model/modela_`i'_eth16 
 55.          cap lincom `eth'.ethnicity_16, eform
 56.         file write tablecontent  %4.2f (r(estimate)) _tab ("(") %4.2f (r(l
> b)) (" - ") %4.2f (r(ub)) (")") _tab 
 57.         cap estimates clear
 58.         cap estimates use ./output/model/modelb_`i'_eth16 
 59.          cap lincom `eth'.ethnicity_16, eform
 60.         file write tablecontent  %4.2f (r(estimate)) _tab ("(") %4.2f (r(l
> b)) (" - ") %4.2f (r(ub)) (")") _n
 61. }  //end ethnic group
 62. 
. 
. } //end outcomes
tested
(1,189 observations deleted)

         failure _d:  tested
   analysis time _t:  (stime_tested-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,684                  Number of obs    =       6,684
No. of failures =           11
Time at risk    =      1228652
                                                LR chi2(48)      =       62.16
Log likelihood  =   -40.806155                  Prob > chi2      =      0.0823

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   3.46e-09   7.106619    -0.00   1.000            0           .
Other White  |   2.34e-09   4.739244    -0.00   1.000            0           .
White + C..  |   3.05e-09   7.101501    -0.00   1.000            0           .
White + A..  |   1.04e+10   1.65e+10    14.56   0.000     4.66e+08    2.32e+11
White + A..  |   1.56e-09          .        .       .            .           .
Other mixed  |   1.79e+10   2.74e+10    15.43   0.000     8.94e+08    3.60e+11
     Indian  |   3.99e+10   5.43e+10    17.94   0.000     2.77e+09    5.74e+11
  Pakistani  |   1.79e+10   2.83e+10    14.91   0.000     8.01e+08    3.98e+11
Bangladeshi  |   6.64e+09          .        .       .            .           .
Other Asian  |   7.17e-10          .        .       .            .           .
  Caribbean  |   1.08e-09   3.254667    -0.00   1.000            0           .
    African  |   5.27e-10          .        .       .            .           .
Other Black  |   3.70e-10   1.052204    -0.00   1.000            0           .
    Chinese  |   7.26e-10          .        .       .            .           .
      Other  |   1.18e+10   1.86e+10    14.73   0.000     5.40e+08    2.58e+11
    Unknown  |   8.41e+09   1.10e+10    17.52   0.000     6.53e+08    1.08e+11
             |
        male |
       Male  |   .1702549   .1521347    -1.98   0.048     .0295455    .9810878
        age1 |   .9779323   .0952472    -0.23   0.819     .8079876    1.183622
        age2 |   1.015401   .3578483     0.04   0.965     .5089279    2.025903
        age3 |   1.114872   1.017412     0.12   0.905     .1863951    6.668308
             |
         imd |
          4  |   6.67e-18   8.49e-10    -0.00   1.000            0           .
5 most de..  |   1.038362   1.198607     0.03   0.974     .1080903    9.974963
             |
   bmicat_sa |
Normal (..)  |   1.71e+08   2.74e+08    11.83   0.000      7380425    3.95e+09
Overweig..)  |   1.81e+08          .        .       .            .           .
Obese I ..)  |   1.42e+08   1.96e+08    13.63   0.000      9565304    2.11e+09
Obese II..)  |   7.17e+07   1.07e+08    12.12   0.000      3847564    1.34e+09
Obese II..)  |   5.56e+08   6.57e+08    17.02   0.000     5.47e+07    5.64e+09
    Unknown  |   7.47e+07   1.15e+08    11.73   0.000      3611385    1.54e+09
             |
    hba1ccat |
  >=6.5-7.4  |   1.077629   .9850788     0.08   0.935     .1796271    6.464975
  >=7.5-7.9  |   2.211301   2.759081     0.64   0.525     .1916849    25.50984
    >=8-8.9  |    6.59363   5.557375     2.24   0.025     1.263857    34.39944
        >=9  |   3.27e-17   1.21e-08    -0.00   1.000            0           .
    Unknown  |   6.95e-18   1.29e-08    -0.00   1.000            0           .
             |
gp_consult~t |   .7581277   .1450425    -1.45   0.148     .5210666    1.103041
             |
smoke_nomiss |
     Former  |   5.03e-18   5.18e-09    -0.00   1.000            0           .
    Current  |   1.94e-17   2.59e-09    -0.00   1.000            0           .
             |
1.hyperten~n |   5.60e-18   1.24e-09    -0.00   1.000            0           .
             |
      bp_cat |
High, sta..  |   3.50e-17          .        .       .            .           .
    Unknown  |   9.86e-34   1.92e-25    -0.00   1.000            0           .
             |
    1.asthma |   4.32e-18   2.10e-09    -0.00   1.000            0           .
1.~y_disease |   1.172143   1.015603     0.18   0.855     .2145149    6.404779
1.~c_disease |   .4092102   .4571612    -0.80   0.424     .0458144    3.655032
             |
     dm_type |
       T1DM  |   1.31e-17   2.02e-09    -0.00   1.000            0           .
       T2DM  |   .5444234   .4932429    -0.67   0.502     .0922052    3.214534
 UNKNOWN_DM  |   2.63e-17   2.74e-08    -0.00   1.000            0           .
             |
    1.cancer |   1.322323   1.001505     0.37   0.712     .2996757    5.834764
1.~r_disease |   .3542347   .4205848    -0.87   0.382     .0345665    3.630172
    1.stroke |   1.246371   .9276706     0.30   0.767     .2898011    5.360366
  1.dementia |   .6840422   .6143696    -0.42   0.672     .1176467    3.977279
1.other_ne~o |   .9713739   .8584421    -0.03   0.974     .1718484    5.490696
             |
      egfr60 |
   eGFR <60  |   5.77e-18   4.78e-09    -0.00   1.000            0           .
      1.esrf |   .5496012   .6097715    -0.54   0.590     .0624679     4.83547
1.immunosu~d |   3.493455   2.565329     1.70   0.088     .8283181    14.73374
1.ra_sle_p~s |   1.169336   1.029603     0.18   0.859     .2081873    6.567867
             |
hh_total_cat |
       6-10  |   1.20e+16          .        .       .            .           .
        11+  |   .2973581   5.16e+08    -0.00   1.000            0           .
------------------------------------------------------------------------------
                                                             Stratified by stp
file ./output/model/modela_tested_eth16.ster saved
file ./output/model/modela_tested_eth16.dta saved

         failure _d:  tested
   analysis time _t:  (stime_tested-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Cox regression -- no ties

No. of subjects =        6,684                  Number of obs    =       6,684
No. of failures =           11
Time at risk    =      1228652
                                                LR chi2(39)      =       60.36
Log likelihood  =   -66.681891                  Prob > chi2      =      0.0157

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.08e-09          .        .       .            .           .
Other White  |   2.11e-12   .0046162    -0.00   1.000            0           .
White + C..  |   9.06e-10          .        .       .            .           .
White + A..  |   1.29e+10   1.94e+10    15.49   0.000     6.77e+08    2.45e+11
White + A..  |   1.70e-09          .        .       .            .           .
Other mixed  |   1.72e+10   2.59e+10    15.69   0.000     9.06e+08    3.27e+11
     Indian  |   5.29e+10   6.56e+10    19.89   0.000     4.64e+09    6.02e+11
  Pakistani  |   1.43e+10   2.12e+10    15.74   0.000     7.76e+08    2.63e+11
Bangladeshi  |   1.42e+10   2.15e+10    15.41   0.000     7.25e+08    2.76e+11
Other Asian  |   7.66e-10          .        .       .            .           .
  Caribbean  |   4.39e-10          .        .       .            .           .
    African  |   9.88e-10          .        .       .            .           .
Other Black  |   5.75e-10          .        .       .            .           .
    Chinese  |   1.27e-09          .        .       .            .           .
      Other  |   1.46e+10          .        .       .            .           .
    Unknown  |   9.62e+09   1.17e+10    18.89   0.000     8.85e+08    1.04e+11
             |
        male |
       Male  |   .2647913   .2117282    -1.66   0.097     .0552433    1.269194
        age1 |   .9858093   .0939627    -0.15   0.881     .8178251    1.188298
        age2 |    .994872   .3315177    -0.02   0.988      .517755    1.911657
        age3 |   1.148464   .9797757     0.16   0.871     .2157454    6.113544
             |
         imd |
          4  |   3.75e-19   3.07e-10    -0.00   1.000            0           .
5 most de..  |   .9771945   1.089053    -0.02   0.983     .1099875    8.681979
             |
   bmicat_sa |
Normal (..)  |   3.46e+08   5.19e+08    13.10   0.000     1.83e+07    6.55e+09
Overweig..)  |   3.35e+08   5.01e+08    13.14   0.000     1.79e+07    6.27e+09
Obese I ..)  |   3.22e+08   4.24e+08    14.86   0.000     2.43e+07    4.26e+09
Obese II..)  |   1.60e+08   2.37e+08    12.73   0.000      8715737    2.92e+09
Obese II..)  |   7.99e+08   9.52e+08    17.21   0.000     7.74e+07    8.26e+09
    Unknown  |   1.30e+08          .        .       .            .           .
             |
    hba1ccat |
  >=6.5-7.4  |   1.214128   1.058006     0.22   0.824     .2200477     6.69903
  >=7.5-7.9  |   2.620372   3.072632     0.82   0.411     .2631777    26.09015
    >=8-8.9  |   6.215469   4.985184     2.28   0.023     1.290502    29.93569
        >=9  |   1.14e-18   2.22e-09    -0.00   1.000            0           .
    Unknown  |   6.62e-18          .        .       .            .           .
             |
gp_consult~t |   .8116301   .1383412    -1.22   0.221     .5811284    1.133559
             |
smoke_nomiss |
     Former  |   3.06e-19          .        .       .            .           .
    Current  |   2.59e-19   2.95e-10    -0.00   1.000            0           .
             |
1.hyperten~n |   3.65e-21   8.07e-13    -0.00   1.000            0           .
             |
      bp_cat |
High, sta..  |   2.49e-06          .        .       .            .           .
    Unknown  |   6.52e-25   1.39e-15    -0.00   1.000            0           .
             |
    1.asthma |   2.92e-20   6.32e-12    -0.00   1.000            0           .
1.~y_disease |   1.512942   1.132322     0.55   0.580     .3489497    6.559665
1.~c_disease |   .4101325   .4502819    -0.81   0.417     .0476865    3.527386
             |
     dm_type |
       T1DM  |   4.51e-19   6.12e-10    -0.00   1.000            0           .
       T2DM  |   .7453855   .6453886    -0.34   0.734     .1365753    4.068083
 UNKNOWN_DM  |   5.13e-19          .        .       .            .           .
             |
    1.cancer |   1.438341   1.017026     0.51   0.607     .3597427    5.750846
1.~r_disease |   .4046758   .4433718    -0.83   0.409      .047262    3.464995
    1.stroke |   1.614643   1.152021     0.67   0.502     .3988027    6.537245
  1.dementia |   .8282076   .6956067    -0.22   0.822     .1596688    4.295941
1.other_ne~o |    1.11122   .9108624     0.13   0.898     .2228813    5.540212
             |
      egfr60 |
   eGFR <60  |   3.16e-19          .        .       .            .           .
      1.esrf |   .4402214   .4951616    -0.73   0.466     .0485555    3.991202
1.immunosu~d |   2.399589   1.593058     1.32   0.187     .6531828     8.81534
1.ra_sle_p~s |   .9600819     .80246    -0.05   0.961     .1865749    4.940414
             |
hh_total_cat |
       6-10  |   1.23e+16          .        .       .            .           .
        11+  |    .000281          .        .       .            .           .
------------------------------------------------------------------------------
file ./output/model/modelb_tested_eth16.ster saved
file ./output/model/modelb_tested_eth16.dta saved
(note: file ./output/estout_sens_nostp_eth16.txt not found)
(output written to ./output/estout_sens_nostp_eth16.txt)
positivetest
(1,189 observations deleted)

         failure _d:  positivetest
   analysis time _t:  (stime_positivetest-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =        6,684                  Number of obs    =       6,684
No. of failures =           19
Time at risk    =      1228481
                                                LR chi2(41)      =       67.84
Log likelihood  =    -89.86632                  Prob > chi2      =      0.0053

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.31e-19          .        .       .            .           .
Other White  |   1.499644   2.365793     0.26   0.797     .0681018    33.02311
White + C..  |    2.01431   3.172522     0.44   0.657     .0919372    44.13282
White + A..  |   1.683128   2.635206     0.33   0.739     .0782393    36.20839
White + A..  |   1.628373   2.515564     0.32   0.752     .0788479     33.6293
Other mixed  |   9.234359   12.27399     1.67   0.094      .682369    124.9667
     Indian  |   3.406027   4.787445     0.87   0.383     .2166785    53.54024
  Pakistani  |   1.08e-19          .        .       .            .           .
Bangladeshi  |   4.174253   5.905751     1.01   0.313     .2607926    66.81321
Other Asian  |   4.40e-20          .        .       .            .           .
  Caribbean  |   8.57e-20          .        .       .            .           .
    African  |   1.04e-19          .        .       .            .           .
Other Black  |   1.32e-19          .        .       .            .           .
    Chinese  |   1.897719   2.999522     0.41   0.685       .08567    42.03733
      Other  |   4.97e-20          .        .       .            .           .
    Unknown  |   1.851358   2.373272     0.48   0.631     .1500816    22.83775
             |
        male |
       Male  |    .761658    .372033    -0.56   0.577      .292408     1.98395
        age1 |    .941518   .0618487    -0.92   0.359      .827776    1.070889
        age2 |   1.371078   .3530258     1.23   0.220     .8277412    2.271067
        age3 |   .3774595   .2732215    -1.35   0.178     .0913553    1.559577
             |
         imd |
          4  |   3.365189   1.734239     2.35   0.019     1.225591    9.240031
5 most de..  |   .6978631   .7649423    -0.33   0.743     .0814236    5.981223
             |
   bmicat_sa |
Normal (..)  |   1.20e+10   1.43e+10    19.55   0.000     1.17e+09    1.23e+11
Overweig..)  |   3.71e+09          .        .       .            .           .
Obese I ..)  |   2.79e-10          .        .       .            .           .
Obese II..)  |   8.67e+09   1.02e+10    19.51   0.000     8.70e+08    8.63e+10
Obese II..)  |   1.29e+10   1.43e+10    20.96   0.000     1.46e+09    1.14e+11
    Unknown  |   1.88e+10   2.06e+10    21.59   0.000     2.20e+09    1.61e+11
             |
    hba1ccat |
  >=6.5-7.4  |   .6041639   .4705551    -0.65   0.518     .1312785    2.780456
  >=7.5-7.9  |   1.718769   1.401198     0.66   0.506     .3477681    8.494645
    >=8-8.9  |   .7770521   .8392914    -0.23   0.815     .0935557    6.454016
        >=9  |   1.233243   1.357208     0.19   0.849     .1426545    10.66135
    Unknown  |   15.39284   19.92712     2.11   0.035     1.217244    194.6523
             |
gp_consult~t |   1.080223    .113655     0.73   0.463      .878931    1.327615
             |
smoke_nomiss |
     Former  |   1.15e-19          .        .       .            .           .
    Current  |   .3888009   .4054144    -0.91   0.365     .0503679    3.001241
             |
1.hyperten~n |    .434705   .3373043    -1.07   0.283      .094998    1.989183
             |
      bp_cat |
High, sta..  |   3.08e+07   2.51e+07    21.14   0.000      6229885    1.52e+08
    Unknown  |   2.33e+07          .        .       .            .           .
             |
    1.asthma |   7.060232   5.087205     2.71   0.007     1.719853    28.98323
1.~y_disease |   .9761836   .5851511    -0.04   0.968     .3015075    3.160566
1.~c_disease |   .4386436   .3355603    -1.08   0.281      .097937    1.964613
             |
     dm_type |
       T1DM  |   1.43e-19          .        .       .            .           .
       T2DM  |   2.116766   1.057904     1.50   0.133      .794813    5.637426
 UNKNOWN_DM  |   8.66e-20          .        .       .            .           .
             |
    1.cancer |   .8213405   .5395851    -0.30   0.764     .2266317    2.976636
1.~r_disease |   1.658182   .9028874     0.93   0.353     .5703605    4.820756
    1.stroke |   1.220613   .6738891     0.36   0.718     .4136544     3.60179
  1.dementia |   1.976172   1.031988     1.30   0.192     .7100907    5.499656
1.other_ne~o |   1.094597   .6444749     0.15   0.878     .3452116    3.470749
             |
      egfr60 |
   eGFR <60  |   5.51e-19          .        .       .            .           .
      1.esrf |   .3915478     .30452    -1.21   0.228     .0852661    1.798015
1.immunosu~d |   1.116598   .5556981     0.22   0.825     .4209971    2.961522
1.ra_sle_p~s |   2.396144    1.20051     1.74   0.081     .8975242    6.397051
             |
hh_total_cat |
       6-10  |   .4942668   .5677298    -0.61   0.540      .052029     4.69545
        11+  |   2.63e-18          .        .       .            .           .
------------------------------------------------------------------------------
                                                             Stratified by stp
file ./output/model/modela_positivetest_eth16.ster saved
file ./output/model/modela_positivetest_eth16.dta saved

         failure _d:  positivetest
   analysis time _t:  (stime_positivetest-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Cox regression -- Breslow method for ties

No. of subjects =        6,684                  Number of obs    =       6,684
No. of failures =           19
Time at risk    =      1228481
                                                LR chi2(51)      =       66.62
Log likelihood  =   -133.97992                  Prob > chi2      =      0.0699

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.42e-19          .        .       .            .           .
Other White  |   1.505194   2.326453     0.26   0.791     .0727715    31.13319
White + C..  |   1.711056   2.643276     0.35   0.728     .0828534    35.33608
White + A..  |   1.482072   2.293614     0.25   0.799     .0713796    30.77265
White + A..  |    1.54644   2.357522     0.29   0.775     .0779274    30.68851
Other mixed  |   7.144136   9.206611     1.53   0.127     .5714928    89.30767
     Indian  |   3.371898   4.641866     0.88   0.377     .2270294    50.08027
  Pakistani  |   1.92e-19   4.58e-10    -0.00   1.000            0           .
Bangladeshi  |   3.409087   4.715304     0.89   0.375     .2266169    51.28423
Other Asian  |   4.12e-19   6.75e-10    -0.00   1.000            0           .
  Caribbean  |   3.14e-19   7.74e-10    -0.00   1.000            0           .
    African  |   1.25e-19   3.66e-10    -0.00   1.000            0           .
Other Black  |   2.34e-19   5.43e-10    -0.00   1.000            0           .
    Chinese  |   1.342522   2.073834     0.19   0.849     .0650196    27.72032
      Other  |   3.19e-19   6.35e-10    -0.00   1.000            0           .
    Unknown  |   1.624364   2.033199     0.39   0.698      .139715    18.88528
             |
        male |
       Male  |   .6934786   .3343834    -0.76   0.448     .2695246      1.7843
        age1 |   .9413944   .0605296    -0.94   0.348     .8299294     1.06783
        age2 |   1.355472   .3424155     1.20   0.229     .8261566    2.223917
        age3 |   .3974834    .281791    -1.30   0.193     .0990535    1.595027
             |
         imd |
          4  |   2.933437    1.47974     2.13   0.033     1.091434    7.884169
5 most de..  |   .6667001   .7233644    -0.37   0.709      .079503    5.590846
             |
   bmicat_sa |
Normal (..)  |   4.02e+10   4.78e+10    20.55   0.000     3.92e+09    4.13e+11
Overweig..)  |   1.27e+10          .        .       .            .           .
Obese I ..)  |   7.13e-09   8.789541    -0.00   1.000            0           .
Obese II..)  |   3.06e+10   3.57e+10    20.66   0.000     3.10e+09    3.02e+11
Obese II..)  |   4.34e+10   4.81e+10    22.09   0.000     4.93e+09    3.81e+11
    Unknown  |   6.06e+10   6.62e+10    22.75   0.000     7.14e+09    5.15e+11
             |
    hba1ccat |
  >=6.5-7.4  |   .6473105   .4992227    -0.56   0.573     .1427723     2.93482
  >=7.5-7.9  |   1.515649   1.227514     0.51   0.608     .3098965    7.412775
    >=8-8.9  |   .7303422   .7827246    -0.29   0.769     .0893869    5.967312
        >=9  |   1.057164   1.142825     0.05   0.959     .1270482    8.796624
    Unknown  |   10.79776    12.9283     1.99   0.047     1.033187    112.8466
             |
gp_consult~t |   1.062278   .1088137     0.59   0.555     .8690529    1.298466
             |
smoke_nomiss |
     Former  |   1.28e-19          .        .       .            .           .
    Current  |   .4119748   .4273784    -0.85   0.393     .0539316    3.147011
             |
1.hyperten~n |   .4122493   .3159755    -1.16   0.248     .0917788     1.85173
             |
      bp_cat |
High, sta..  |   7.74e+07   6.17e+07    22.80   0.000     1.62e+07    3.69e+08
    Unknown  |   7.55e+07          .        .       .            .           .
             |
    1.asthma |   5.837091   4.056584     2.54   0.011     1.494995    22.79047
1.~y_disease |   .9901234   .5820068    -0.02   0.987     .3128546    3.133546
1.~c_disease |   .4485781   .3430674    -1.05   0.295     .1001956    2.008294
             |
     dm_type |
       T1DM  |   2.56e-19   6.72e-10    -0.00   1.000            0           .
       T2DM  |   2.300238   1.137708     1.68   0.092     .8724988    6.064302
 UNKNOWN_DM  |   2.84e-19   8.08e-10    -0.00   1.000            0           .
             |
    1.cancer |   .7398329   .4835183    -0.46   0.645     .2055087    2.663404
1.~r_disease |   1.331554   .7176548     0.53   0.595     .4630152    3.829328
    1.stroke |   1.281375   .6981719     0.46   0.649     .4404426    3.727891
  1.dementia |    2.08737   1.076077     1.43   0.153      .759958     5.73336
1.other_ne~o |   1.060771   .6190574     0.10   0.919     .3379612    3.329477
             |
      egfr60 |
   eGFR <60  |   6.15e-19   1.93e-09    -0.00   1.000            0           .
      1.esrf |   .3871199   .2985112    -1.23   0.218     .0854038    1.754744
1.immunosu~d |    1.14315   .5656328     0.27   0.787     .4334382    3.014945
1.ra_sle_p~s |    2.37191    1.17195     1.75   0.080     .9005826    6.247021
             |
hh_total_cat |
       6-10  |   .4066799   .4468232    -0.82   0.413     .0472095    3.503291
        11+  |   1.28e-18          .        .       .            .           .
------------------------------------------------------------------------------
(note: file ./output/model/modelb_positivetest_eth16.ster not found)
file ./output/model/modelb_positivetest_eth16.ster saved
(note: file ./output/model/modelb_positivetest_eth16.dta not found)
file ./output/model/modelb_positivetest_eth16.dta saved
(output written to ./output/estout_sens_nostp_eth16.txt)
icu
(1,189 observations deleted)

         failure _d:  icu
   analysis time _t:  (stime_icu-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,684                  Number of obs    =       6,684
No. of failures =           12
Time at risk    =      1202083
                                                LR chi2(35)      =       48.83
Log likelihood  =   -53.834167                  Prob > chi2      =      0.0603

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   2.79e+10   3.69e+10    18.19   0.000     2.09e+09    3.72e+11
Other White  |   1.15e+10   1.73e+10    15.46   0.000     6.10e+08    2.17e+11
White + C..  |   6.59e-10          .        .       .            .           .
White + A..  |   1.47e+10          .        .       .            .           .
White + A..  |   6.97e-10          .        .       .            .           .
Other mixed  |   9.07e-10          .        .       .            .           .
     Indian  |   1.13e-09          .        .       .            .           .
  Pakistani  |   1.31e-09          .        .       .            .           .
Bangladeshi  |   8.62e+09   1.33e+10    14.88   0.000     4.24e+08    1.75e+11
Other Asian  |   5.61e-10          .        .       .            .           .
  Caribbean  |   9.76e-10          .        .       .            .           .
    African  |   1.07e+10   1.63e+10    15.15   0.000     5.39e+08    2.12e+11
Other Black  |   4.30e+10   5.77e+10    18.26   0.000     3.11e+09    5.96e+11
    Chinese  |   5.22e-10          .        .       .            .           .
      Other  |   5.73e-10          .        .       .            .           .
    Unknown  |   9.33e+09   1.11e+10    19.26   0.000     9.02e+08    9.64e+10
             |
        male |
       Male  |   2.131593   1.420628     1.14   0.256     .5773111    7.870435
        age1 |   .9447112   .0909413    -0.59   0.555     .7822748    1.140877
        age2 |   1.180272   .3953328     0.49   0.621     .6121692    2.275582
        age3 |   .7090255   .6153706    -0.40   0.692     .1293884    3.885336
             |
         imd |
          4  |   .7090841   .5943174    -0.41   0.682     .1371718    3.665478
5 most de..  |   3.16e-20          .        .       .            .           .
             |
   bmicat_sa |
Normal (..)  |   1.70e+09   2.21e+09    16.33   0.000     1.32e+08    2.17e+10
Overweig..)  |   9.63e+08   1.25e+09    15.89   0.000     7.50e+07    1.24e+10
Obese I ..)  |   3.23e+08          .        .       .            .           .
Obese II..)  |   3.39e+08   5.06e+08    13.17   0.000     1.83e+07    6.30e+09
Obese II..)  |   1.68e+09   1.98e+09    17.96   0.000     1.65e+08    1.70e+10
    Unknown  |   3.09e+08   4.73e+08    12.75   0.000     1.53e+07    6.23e+09
             |
    hba1ccat |
  >=6.5-7.4  |   .4078022   .4489413    -0.81   0.415     .0471388    3.527934
  >=7.5-7.9  |   3.806962   3.438126     1.48   0.139     .6484034    22.35177
    >=8-8.9  |   1.226057   1.388046     0.18   0.857      .133305    11.27651
        >=9  |   1.82e-19          .        .       .            .           .
    Unknown  |   7.63e-18          .        .       .            .           .
             |
gp_consult~t |    1.04585   .1370581     0.34   0.732     .8089469    1.352132
             |
smoke_nomiss |
     Former  |   5.547428   6.563021     1.45   0.148     .5458293    56.38019
    Current  |   1.037932   .8842469     0.04   0.965     .1954355    5.512318
             |
1.hyperten~n |   .2953032   .3315134    -1.09   0.277     .0327108    2.665903
             |
      bp_cat |
High, sta..  |   1.585408          .        .       .            .           .
    Unknown  |   1.371824   1.518556     0.29   0.775     .1566937    12.01006
             |
    1.asthma |   2.20e-19          .        .       .            .           .
1.~y_disease |    1.05502   .9035498     0.06   0.950     .1969095    5.652682
1.~c_disease |   1.15e-20          .        .       .            .           .
             |
     dm_type |
       T1DM  |   1.966728   2.260002     0.59   0.556       .20683    18.70144
       T2DM  |   .9927769    .841615    -0.01   0.993     .1884757    5.229351
 UNKNOWN_DM  |   1.42e-19          .        .       .            .           .
             |
    1.cancer |   2.787895   1.857118     1.54   0.124     .7555443     10.2871
1.~r_disease |   1.526211   1.048739     0.62   0.538     .3969262    5.868398
    1.stroke |   1.132567   .9313771     0.15   0.880     .2259799    5.676199
  1.dementia |    1.07728   .8185211     0.10   0.922     .2429866    4.776113
1.other_ne~o |   2.294502    1.57881     1.21   0.227     .5956486    8.838666
             |
      egfr60 |
   eGFR <60  |   2.42e-19          .        .       .            .           .
      1.esrf |   1.934823   1.387025     0.92   0.357     .4747189      7.8858
1.immunosu~d |   .5669318   .4064838    -0.79   0.429     .1390685    2.311175
1.ra_sle_p~s |   1.666545   1.131381     0.75   0.452     .4405089    6.304915
             |
hh_total_cat |
       6-10  |   1.14e+17          .        .       .            .           .
        11+  |   .6233918          .        .       .            .           .
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/modela_icu_eth16.ster not found)
file ./output/model/modela_icu_eth16.ster saved
(note: file ./output/model/modela_icu_eth16.dta not found)
file ./output/model/modela_icu_eth16.dta saved

         failure _d:  icu
   analysis time _t:  (stime_icu-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Cox regression -- Breslow method for ties

No. of subjects =        6,684                  Number of obs    =       6,684
No. of failures =           12
Time at risk    =      1202083
                                                LR chi2(53)      =       48.65
Log likelihood  =   -81.335266                  Prob > chi2      =      0.6439

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   4.24e+10   5.37e+10    19.30   0.000     3.53e+09    5.08e+11
Other White  |   1.64e+10   2.38e+10    16.19   0.000     9.51e+08    2.82e+11
White + C..  |   1.66e-06   140.1967    -0.00   1.000            0           .
White + A..  |   1.87e+10          .        .       .            .           .
White + A..  |   1.64e-06   170.7071    -0.00   1.000            0           .
Other mixed  |   2.93e-06   264.0595    -0.00   1.000            0           .
     Indian  |   1.93e-06   162.9818    -0.00   1.000            0           .
  Pakistani  |   2.73e-06   228.2845    -0.00   1.000            0           .
Bangladeshi  |   1.29e+10   1.88e+10    16.00   0.000     7.45e+08    2.24e+11
Other Asian  |   2.29e-06   196.4097    -0.00   1.000            0           .
  Caribbean  |   2.20e-06   203.8332    -0.00   1.000            0           .
    African  |   1.86e+10   2.71e+10    16.23   0.000     1.07e+09    3.23e+11
Other Black  |   5.52e+10   7.00e+10    19.50   0.000     4.59e+09    6.63e+11
    Chinese  |   2.60e-06   220.3221    -0.00   1.000            0           .
      Other  |   1.79e-06   185.1378    -0.00   1.000            0           .
    Unknown  |   1.31e+10   1.50e+10    20.30   0.000     1.38e+09    1.24e+11
             |
        male |
       Male  |   2.117141   1.328765     1.20   0.232      .618752    7.244077
        age1 |   .9615317   .0853106    -0.44   0.658     .8080569    1.144156
        age2 |   1.141717    .357209     0.42   0.672     .6183624    2.108016
        age3 |     .74394   .6029712    -0.36   0.715     .1519253    3.642887
             |
         imd |
          4  |   .7138322   .5625619    -0.43   0.669     .1523264    3.345161
5 most de..  |   2.81e-16   1.25e-08    -0.00   1.000            0           .
             |
   bmicat_sa |
Normal (..)  |   1.06e+09   1.36e+09    16.20   0.000     8.57e+07    1.31e+10
Overweig..)  |   7.15e+08   9.13e+08    15.96   0.000     5.84e+07    8.74e+09
Obese I ..)  |   2.47e+08   3.68e+08    12.96   0.000     1.33e+07    4.58e+09
Obese II..)  |   2.55e+08   3.74e+08    13.17   0.000     1.43e+07    4.54e+09
Obese II..)  |   1.02e+09   1.19e+09    17.82   0.000     1.04e+08    9.98e+09
    Unknown  |   2.11e+08          .        .       .            .           .
             |
    hba1ccat |
  >=6.5-7.4  |   .3768986   .4068235    -0.90   0.366     .0454401    3.126148
  >=7.5-7.9  |   3.145306   2.596367     1.39   0.165     .6237615    15.86015
    >=8-8.9  |   1.186816   1.294396     0.16   0.875     .1399665    10.06335
        >=9  |   7.04e-16   4.18e-08    -0.00   1.000            0           .
    Unknown  |   8.49e-16   2.20e-07    -0.00   1.000            0           .
             |
gp_consult~t |   1.034927   .1289893     0.28   0.783     .8106236    1.321296
             |
smoke_nomiss |
     Former  |   5.011333   5.594839     1.44   0.149     .5618757    44.69576
    Current  |   1.330353   1.064706     0.36   0.721     .2771628    6.385558
             |
1.hyperten~n |   .3268773    .350692    -1.04   0.297      .039918    2.676706
             |
      bp_cat |
High, sta..  |   1.151077          .        .       .            .           .
    Unknown  |   .9670535   1.036043    -0.03   0.975     .1184471    7.895443
             |
    1.asthma |   3.94e-16   2.50e-08    -0.00   1.000            0           .
1.~y_disease |   .9588087   .7657245    -0.05   0.958     .2004217    4.586899
1.~c_disease |   4.06e-16   1.05e-08    -0.00   1.000            0           .
             |
     dm_type |
       T1DM  |   2.565244   2.821534     0.86   0.392     .2970876    22.14995
       T2DM  |   .9463015   .7717573    -0.07   0.946     .1913512    4.679807
 UNKNOWN_DM  |   4.55e-16   3.71e-08    -0.00   1.000            0           .
             |
    1.cancer |   2.291823   1.475264     1.29   0.198     .6490167    8.092937
1.~r_disease |   1.808603   1.171551     0.91   0.360     .5081172    6.437578
    1.stroke |   .9401379   .7455568    -0.08   0.938     .1986845    4.448558
  1.dementia |   1.396877   .9779861     0.48   0.633     .3541703    5.509398
1.other_ne~o |   2.161599   1.380574     1.21   0.227     .6181992    7.558262
             |
      egfr60 |
   eGFR <60  |   2.81e-16   4.45e-08    -0.00   1.000            0           .
      1.esrf |   1.695106   1.167296     0.77   0.443     .4395781    6.536684
1.immunosu~d |   .5054966   .3468182    -0.99   0.320     .1317389    1.939646
1.ra_sle_p~s |   1.682151   1.071963     0.82   0.414     .4824253    5.865427
             |
hh_total_cat |
       6-10  |   9.11e+14   5.06e+22     0.00   1.000            0           .
        11+  |   .4063317   1.41e+08    -0.00   1.000            0           .
------------------------------------------------------------------------------
(note: file ./output/model/modelb_icu_eth16.ster not found)
file ./output/model/modelb_icu_eth16.ster saved
(note: file ./output/model/modelb_icu_eth16.dta not found)
file ./output/model/modelb_icu_eth16.dta saved
(output written to ./output/estout_sens_nostp_eth16.txt)
hes
(1,189 observations deleted)

         failure _d:  hes
   analysis time _t:  (stime_hes-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =        6,684                  Number of obs    =       6,684
No. of failures =          896
Time at risk    =      1147712
                                                LR chi2(55)      =       61.62
Log likelihood  =   -5734.9419                  Prob > chi2      =      0.2513

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.034804   .2487033     0.14   0.887      .646073    1.657428
Other White  |   .8877861   .2116845    -0.50   0.618     .5563487    1.416673
White + C..  |   1.362081   .3043812     1.38   0.167     .8789958    2.110664
White + A..  |   1.109153    .254175     0.45   0.651     .7078302    1.738017
White + A..  |   .9988008   .2412251    -0.00   0.996     .6221586    1.603454
Other mixed  |   1.384772    .313172     1.44   0.150     .8889465    2.157154
     Indian  |      .8656   .2077927    -0.60   0.548     .5407306     1.38565
  Pakistani  |   .9224499   .2228047    -0.33   0.738     .5745755    1.480943
Bangladeshi  |   1.370332    .304932     1.42   0.157     .8859576    2.119526
Other Asian  |   1.408152   .3132458     1.54   0.124     .9105388    2.177714
  Caribbean  |   1.246314   .2815237     0.97   0.330     .8004858    1.940444
    African  |   1.165106   .2672354     0.67   0.505     .7432395    1.826425
Other Black  |    1.20959   .2772563     0.83   0.406     .7718448    1.895599
    Chinese  |   1.116316   .2585601     0.48   0.635     .7089775    1.757687
      Other  |   1.201464   .2781876     0.79   0.428      .763173    1.891465
    Unknown  |   1.115201   .2064375     0.59   0.556     .7758636    1.602954
             |
        male |
       Male  |   1.010036   .0682144     0.15   0.882     .8848087    1.152986
        age1 |   .9889285   .0091029    -1.21   0.226     .9712471    1.006932
        age2 |   1.015746   .0341296     0.46   0.642     .9510081     1.08489
        age3 |   .9722863   .0868677    -0.31   0.753     .8161024     1.15836
             |
         imd |
          4  |   1.137769   .0921239     1.59   0.111     .9708079    1.333445
5 most de..  |   .8098102   .1013193    -1.69   0.092     .6337023    1.034859
             |
   bmicat_sa |
Normal (..)  |   .8189236    .172078    -0.95   0.342      .542479    1.236243
Overweig..)  |   .7410349    .151767    -1.46   0.143     .4960313    1.107053
Obese I ..)  |   .6478846   .1312526    -2.14   0.032     .4355678    .9636947
Obese II..)  |   .6669831   .1340534    -2.02   0.044     .4498175    .9889933
Obese II..)  |   .6913973    .136297    -1.87   0.061     .4698162    1.017483
    Unknown  |   .6773889   .1368442    -1.93   0.054     .4559117    1.006457
             |
    hba1ccat |
  >=6.5-7.4  |   1.112699   .0985425     1.21   0.228     .9353923    1.323614
  >=7.5-7.9  |   1.299859   .1668782     2.04   0.041     1.010689    1.671764
    >=8-8.9  |   1.064913   .1342817     0.50   0.618     .8317269    1.363477
        >=9  |   1.143734   .1906505     0.81   0.420     .8249676     1.58567
    Unknown  |   1.357861   .6137284     0.68   0.499     .5599226    3.292933
             |
gp_consult~t |    .995241   .0146514    -0.32   0.746      .966935    1.024376
             |
smoke_nomiss |
     Former  |   .6824667   .1917242    -1.36   0.174     .3935092    1.183608
    Current  |   .9483335   .0994427    -0.51   0.613     .7721536    1.164712
             |
1.hyperten~n |   .9346063   .0796653    -0.79   0.428     .7908111    1.104548
             |
      bp_cat |
High, sta..  |   2.44e+07    2756595   150.80   0.000     1.96e+07    3.05e+07
    Unknown  |   2.31e+07          .        .       .            .           .
             |
    1.asthma |   .9019394   .1584025    -0.59   0.557      .639272    1.272533
1.~y_disease |   .9989452    .084498    -0.01   0.990     .8463323    1.179078
1.~c_disease |    .864424   .0753351    -1.67   0.095     .7286921    1.025438
             |
     dm_type |
       T1DM  |    .910768   .1795837    -0.47   0.635      .618827    1.340436
       T2DM  |   1.015782   .0867994     0.18   0.855     .8591418    1.200982
 UNKNOWN_DM  |   .8516537   .2162226    -0.63   0.527     .5177919    1.400783
             |
    1.cancer |   1.094031   .0897902     1.09   0.274     .9314708    1.284962
1.~r_disease |    .994378   .0835098    -0.07   0.946     .8434629    1.172295
    1.stroke |   .8778504   .0756158    -1.51   0.130     .7414811      1.0393
  1.dementia |   1.031397   .0857515     0.37   0.710     .8763067    1.213936
1.other_ne~o |     .89677   .0775974    -1.26   0.208     .7568795    1.062516
             |
      egfr60 |
   eGFR <60  |   .8947603   .3452261    -0.29   0.773     .4200364    1.906016
      1.esrf |   .9611448   .0816176    -0.47   0.641     .8137804    1.135195
1.immunosu~d |   .9986312   .0696169    -0.02   0.984     .8710958    1.144839
1.ra_sle_p~s |   1.198887   .0954117     2.28   0.023     1.025739    1.401264
             |
hh_total_cat |
       6-10  |   .9606797   .2044756    -0.19   0.851     .6330017    1.457983
        11+  |   .9214072   .6829315    -0.11   0.912     .2155536    3.938654
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/modela_hes_eth16.ster not found)
file ./output/model/modela_hes_eth16.ster saved
(note: file ./output/model/modela_hes_eth16.dta not found)
file ./output/model/modela_hes_eth16.dta saved

         failure _d:  hes
   analysis time _t:  (stime_hes-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Cox regression -- Breslow method for ties

No. of subjects =        6,684                  Number of obs    =       6,684
No. of failures =          896
Time at risk    =      1147712
                                                LR chi2(55)      =       60.11
Log likelihood  =   -7798.2791                  Prob > chi2      =      0.2960

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.037505    .249161     0.15   0.878     .6479936    1.661153
Other White  |   .8969264   .2137865    -0.46   0.648     .5621717    1.431016
White + C..  |   1.355596   .3027628     1.36   0.173     .8750251    2.100101
White + A..  |   1.113101   .2549492     0.47   0.640     .7105129    1.743802
White + A..  |    1.00578   .2427488     0.02   0.981     .6267036    1.614149
Other mixed  |   1.398106   .3159054     1.48   0.138      .897861    2.177064
     Indian  |   .8737106   .2096058    -0.56   0.574     .5459612    1.398213
  Pakistani  |   .9232593   .2228984    -0.33   0.741      .575204    1.481922
Bangladeshi  |    1.36277   .3029402     1.39   0.164     .8814601    2.106893
Other Asian  |   1.410665   .3134878     1.55   0.122     .9125649    2.180639
  Caribbean  |   1.244566   .2809316     0.97   0.332     .7996121    1.937121
    African  |   1.161246   .2661717     0.65   0.514     .7410009    1.819827
Other Black  |    1.22062   .2795583     0.87   0.384     .7791664     1.91219
    Chinese  |   1.126974   .2608087     0.52   0.605     .7160209    1.773791
      Other  |   1.204346   .2786905     0.80   0.422     .7652082    1.895495
    Unknown  |   1.120868   .2073183     0.62   0.537     .7800354    1.610626
             |
        male |
       Male  |   1.011664   .0681991     0.17   0.863     .8864509    1.154565
        age1 |   .9890915   .0090949    -1.19   0.233     .9714256    1.007079
        age2 |   1.015813   .0341089     0.47   0.640     .9511137    1.084914
        age3 |   .9717089   .0867758    -0.32   0.748      .815684    1.157578
             |
         imd |
          4  |   1.130205   .0913361     1.51   0.130     .9646468    1.324177
5 most de..  |   .8073073    .100967    -1.71   0.087     .6318037    1.031562
             |
   bmicat_sa |
Normal (..)  |   .8146124   .1709496    -0.98   0.329      .539912    1.229077
Overweig..)  |    .733137   .1499567    -1.52   0.129     .4909976    1.094689
Obese I ..)  |   .6403155   .1295222    -2.20   0.028     .4307388    .9518621
Obese II..)  |    .664068   .1333197    -2.04   0.041      .448047    .9842413
Obese II..)  |   .6870427   .1352729    -1.91   0.057     .4670779    1.010597
    Unknown  |   .6649219   .1341505    -2.02   0.043      .447752    .9874243
             |
    hba1ccat |
  >=6.5-7.4  |   1.110561   .0982903     1.18   0.236     .9336982    1.320924
  >=7.5-7.9  |   1.290363   .1655349     1.99   0.047     1.003495    1.659238
    >=8-8.9  |   1.059076   .1334613     0.46   0.649     .8272974    1.355791
        >=9  |    1.16096   .1933632     0.90   0.370     .8376172    1.609121
    Unknown  |   1.334376   .6027471     0.64   0.523     .5505342    3.234238
             |
gp_consult~t |   .9941757   .0145962    -0.40   0.691     .9659753    1.023199
             |
smoke_nomiss |
     Former  |   .6969521   .1956337    -1.29   0.198     .4020422    1.208187
    Current  |    .943026   .0988209    -0.56   0.576     .7679362    1.158036
             |
1.hyperten~n |   .9340558   .0795611    -0.80   0.423     .7904404    1.103765
             |
      bp_cat |
High, sta..  |   2.46e+07    2771607   150.99   0.000     1.97e+07    3.07e+07
    Unknown  |   2.36e+07          .        .       .            .           .
             |
    1.asthma |   .9026724   .1584553    -0.58   0.560      .639897    1.273357
1.~y_disease |   .9927668    .083888    -0.09   0.932     .8412429    1.171583
1.~c_disease |   .8702009    .075784    -1.60   0.110     .7336521    1.032164
             |
     dm_type |
       T1DM  |   .9151531   .1803702    -0.45   0.653     .6219106    1.346665
       T2DM  |   1.015497   .0867501     0.18   0.857     .8589421    1.200587
 UNKNOWN_DM  |   .8526092   .2162719    -0.63   0.530     .5186032    1.401731
             |
    1.cancer |   1.092666   .0895176     1.08   0.279     .9305761    1.282989
1.~r_disease |   .9862605   .0827219    -0.16   0.869     .8367539     1.16248
    1.stroke |   .8772819   .0755475    -1.52   0.128      .741033    1.038582
  1.dementia |    1.03202   .0857366     0.38   0.704     .8769473    1.214515
1.other_ne~o |   .8972947    .077565    -1.25   0.210     .7574509    1.062957
             |
      egfr60 |
   eGFR <60  |   .8791554   .3391725    -0.33   0.738     .4127409    1.872638
      1.esrf |   .9622213   .0816359    -0.45   0.650     .8148134    1.136297
1.immunosu~d |    1.00015   .0697204     0.00   0.998     .8724245    1.146575
1.ra_sle_p~s |   1.193572   .0949124     2.23   0.026     1.021319    1.394877
             |
hh_total_cat |
       6-10  |   .9739387   .2071958    -0.12   0.901     .6418698    1.477802
        11+  |   .9361137   .6931646    -0.09   0.929     .2193002    3.995933
------------------------------------------------------------------------------
(note: file ./output/model/modelb_hes_eth16.ster not found)
file ./output/model/modelb_hes_eth16.ster saved
(note: file ./output/model/modelb_hes_eth16.dta not found)
file ./output/model/modelb_hes_eth16.dta saved
(output written to ./output/estout_sens_nostp_eth16.txt)
onscoviddeath
(1,189 observations deleted)

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,684                  Number of obs    =       6,684
No. of failures =            3
Time at risk    =      1229049
                                                LR chi2(44)      =       39.02
Log likelihood  =            0                  Prob > chi2      =      0.6844

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.80e+39   1.83e+48     0.00   1.000            0           .
Other White  |   8.28e+42   2.27e+51     0.00   1.000            0           .
White + C..  |   5.39e+54   1.80e+63     0.00   1.000            0           .
White + A..  |   1.03e+36   1.06e+44     0.00   1.000            0           .
White + A..  |   1.63e+54          .        .       .            .           .
Other mixed  |   7.56e+35   6.30e+44     0.00   1.000            0           .
     Indian  |   1.56e+47          .        .       .            .           .
  Pakistani  |   1.00e+53          .        .       .            .           .
Bangladeshi  |   1.11e+45   3.33e+53     0.00   1.000            0           .
Other Asian  |   1.06e+44   2.02e+52     0.00   1.000            0           .
  Caribbean  |   8.06e+86   4.38e+95     0.00   1.000            0           .
    African  |   3.37e+49          .        .       .            .           .
Other Black  |   1.70e+64   8.74e+72     0.00   1.000            0           .
    Chinese  |   1.44e+45   6.07e+53     0.00   1.000            0           .
      Other  |   8.00e+47   3.81e+56     0.00   1.000            0           .
    Unknown  |   1.21e+61   5.42e+69     0.00   1.000            0           .
             |
        male |
       Male  |   4.72e+08   6.46e+16     0.00   1.000            0           .
        age1 |    .211796    1851347    -0.00   1.000            0           .
        age2 |   668.5103   5.12e+09     0.00   1.000            0           .
        age3 |   3.05e-12          .        .       .            .           .
             |
         imd |
          4  |   3.13e-18   2.42e-10    -0.00   1.000            0           .
5 most de..  |   4.06e+07   2.11e+15     0.00   1.000            0           .
             |
   bmicat_sa |
Normal (..)  |   9.71e+10   1.14e+19     0.00   1.000            0           .
Overweig..)  |     120603          .        .       .            .           .
Obese I ..)  |   8.89e+09   9.06e+17     0.00   1.000            0           .
Obese II..)  |   2.18e+08          .        .       .            .           .
Obese II..)  |   9.78e+17   2.01e+26     0.00   1.000            0           .
    Unknown  |   4.23e+17   7.73e+25     0.00   1.000            0           .
             |
    hba1ccat |
  >=6.5-7.4  |   2.73e-26   1.84e-18    -0.00   1.000            0           .
  >=7.5-7.9  |   2.50e-13    .000028    -0.00   1.000            0           .
    >=8-8.9  |   3.62e-16   3.59e-08    -0.00   1.000            0           .
        >=9  |   .0287952    4918486    -0.00   1.000            0           .
    Unknown  |   2.08e+29   7.86e+37     0.00   1.000            0           .
             |
gp_consult~t |   19.48214   1.76e+08     0.00   1.000            0           .
             |
smoke_nomiss |
     Former  |   .0003438   133666.9    -0.00   1.000            0           .
    Current  |   44.43701   1.53e+10     0.00   1.000            0           .
             |
1.hyperten~n |   3.68e+24   2.86e+32     0.00   1.000            0           .
             |
      bp_cat |
High, sta..  |   .1257097    5080869    -0.00   1.000            0           .
    Unknown  |   27.31176          .        .       .            .           .
             |
    1.asthma |   6.59e+22   7.57e+30     0.00   1.000            0           .
1.~y_disease |   9.91e-07   236.7107    -0.00   1.000            0           .
1.~c_disease |   7.72e-22   3.27e-14    -0.00   1.000            0           .
             |
     dm_type |
       T1DM  |   2.58e+09          .        .       .            .           .
       T2DM  |   199558.6   3.75e+13     0.00   1.000            0           .
 UNKNOWN_DM  |   .0598376   3.25e+07    -0.00   1.000            0           .
             |
    1.cancer |     14.304   6.44e+08     0.00   1.000            0           .
1.~r_disease |   .4952322          .        .       .            .           .
    1.stroke |   3.09e-36   6.42e-28    -0.00   1.000            0           .
  1.dementia |   2.22e+11   2.42e+19     0.00   1.000            0           .
1.other_ne~o |   584521.6   5.55e+13     0.00   1.000            0           .
             |
      egfr60 |
   eGFR <60  |   4.44e+32          .        .       .            .           .
      1.esrf |   5.82e-31   1.48e-22    -0.00   1.000            0           .
1.immunosu~d |   544817.1   2.21e+13     0.00   1.000            0           .
1.ra_sle_p~s |   4.953309   6.95e+08     0.00   1.000            0           .
             |
hh_total_cat |
       6-10  |   2.55e+11   4.87e+19     0.00   1.000            0           .
        11+  |   2.83e+12          .        .       .            .           .
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/modela_onscoviddeath_eth16.ster not found)
file ./output/model/modela_onscoviddeath_eth16.ster saved
(note: file ./output/model/modela_onscoviddeath_eth16.dta not found)
file ./output/model/modela_onscoviddeath_eth16.dta saved

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Cox regression -- no ties

No. of subjects =        6,684                  Number of obs    =       6,684
No. of failures =            3
Time at risk    =      1229049
                                                LR chi2(31)      =       52.84
Log likelihood  =   -1.437e-10                  Prob > chi2      =      0.0086

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   4.7e+222   3.9e+231     0.00   1.000            0           .
Other White  |   1.69e-99          .        .       .            .           .
White + C..  |   1.8e+222          .        .       .            .           .
White + A..  |   3.84e+23   1.05e+33     0.00   1.000            0           .
White + A..  |   2.5e+115          .        .       .            .           .
Other mixed  |   8.01e+91          .        .       .            .           .
     Indian  |   8.8e+241   1.6e+251     0.00   1.000            0           .
  Pakistani  |   4.43e+49          .        .       .            .           .
Bangladeshi  |   7.0e+141          .        .       .            .           .
Other Asian  |   1.3e+250   1.1e+257     0.00   1.000            0           .
  Caribbean  |          .          .        .       .            .           .
    African  |   2.0e+108          .        .       .            .           .
Other Black  |          .          .     0.00   0.999            0           .
    Chinese  |   5.1e+269   8.5e+278     0.00   1.000            0           .
      Other  |   1.2e+238   1.8e+247     0.00   1.000            0           .
    Unknown  |   1.2e+285   7.4e+290     0.00   0.999            0           .
             |
        male |
       Male  |   1.8e+103          .        .       .            .           .
        age1 |   1.18e-18   1.63e-14    -0.00   0.998            0           .
        age2 |   1.6e+111          .        .       .            .           .
        age3 |          0          .        .       .            .           .
             |
         imd |
          4  |   4.9e-199   4.2e-190    -0.00   1.000            0           .
5 most de..  |   7.3e-146   1.1e-137    -0.00   1.000            0           .
             |
   bmicat_sa |
Normal (..)  |   5.40e-80          .        .       .            .           .
Overweig..)  |   6.8e-142   1.9e-132    -0.00   1.000            0           .
Obese I ..)  |   6.00e+73   4.07e+79     0.00   1.000            0           .
Obese II..)  |   1.29e+26   1.47e+34     0.00   1.000            0           .
Obese II..)  |   8.2e+181          .        .       .            .           .
    Unknown  |   2.63e-93   1.69e-87    -0.00   1.000            0           .
             |
    hba1ccat |
  >=6.5-7.4  |   1.6e-162          .        .       .            .           .
  >=7.5-7.9  |   5.3e-141          .        .       .            .           .
    >=8-8.9  |   1.86e-83   4.35e-74    -0.00   1.000            0           .
        >=9  |   3.0e-287   4.7e-278    -0.00   1.000            0           .
    Unknown  |          .          .     0.00   1.000            0           .
             |
gp_consult~t |   15197.63          .        .       .            .           .
             |
smoke_nomiss |
     Former  |   5.7e-234   1.9e-226    -0.00   1.000            0           .
    Current  |   6.06e+40   1.09e+50     0.00   1.000            0           .
             |
1.hyperten~n |   7.32e+71   3.68e+77     0.00   1.000            0           .
             |
      bp_cat |
High, sta..  |   4.7e-185          .        .       .            .           .
    Unknown  |          0          0    -0.00   1.000            0           .
             |
    1.asthma |   7.5e+207   1.3e+214     0.00   1.000            0           .
1.~y_disease |   1.7e-226   4.3e-218    -0.00   1.000            0           .
1.~c_disease |   4.44e+40   1.96e+47     0.00   1.000            0           .
             |
     dm_type |
       T1DM  |   1.1e+171   2.6e+179     0.00   1.000            0           .
       T2DM  |   2.43e+60   1.39e+66     0.00   1.000            0           .
 UNKNOWN_DM  |   4.1e-104          .        .       .            .           .
             |
    1.cancer |   4.30e+15          .        .       .            .           .
1.~r_disease |   3.4e-207          .        .       .            .           .
    1.stroke |          0          .        .       .            .           .
  1.dementia |   5.9e+116   2.5e+122     0.00   1.000            0           .
1.other_ne~o |   2.33e+49          .        .       .            .           .
             |
      egfr60 |
   eGFR <60  |          .          .        .       .            .           .
      1.esrf |   3.3e-141   4.4e-132    -0.00   1.000            0           .
1.immunosu~d |   192887.7          .        .       .            .           .
1.ra_sle_p~s |   8.85e+25   1.57e+32     0.00   1.000            0           .
             |
hh_total_cat |
       6-10  |   6.70e+43          .        .       .            .           .
        11+  |          .          .     0.00   1.000            0           .
------------------------------------------------------------------------------
(note: file ./output/model/modelb_onscoviddeath_eth16.ster not found)
file ./output/model/modelb_onscoviddeath_eth16.ster saved
(note: file ./output/model/modelb_onscoviddeath_eth16.dta not found)
file ./output/model/modelb_onscoviddeath_eth16.dta saved
(output written to ./output/estout_sens_nostp_eth16.txt)
ons_noncoviddeath
(1,189 observations deleted)

         failure _d:  ons_noncoviddeath
   analysis time _t:  (stime_ons_noncoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,684                  Number of obs    =       6,684
No. of failures =           14
Time at risk    =      1229049
                                                LR chi2(54)      =       40.43
Log likelihood  =   -70.735907                  Prob > chi2      =      0.9145

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.29e-16   8.92e-09    -0.00   1.000            0           .
Other White  |   1.70e-16   1.15e-08    -0.00   1.000            0           .
White + C..  |   1.35e-16   9.39e-09    -0.00   1.000            0           .
White + A..  |   1.91e-16   1.16e-08    -0.00   1.000            0           .
White + A..  |   1.80e-16   1.28e-08    -0.00   1.000            0           .
Other mixed  |   .8771297   1.271728    -0.09   0.928     .0511598    15.03831
     Indian  |   .6756386   .9786599    -0.27   0.787     .0395141    11.55252
  Pakistani  |   1.566273   1.987594     0.35   0.724     .1302254    18.83818
Bangladeshi  |   .6409397   .9355952    -0.30   0.761     .0366689    11.20306
Other Asian  |   .7144281    1.03379    -0.23   0.816     .0419039    12.18043
  Caribbean  |   1.68e-16   1.20e-08    -0.00   1.000            0           .
    African  |   1.60e-16   9.82e-09    -0.00   1.000            0           .
Other Black  |   1.733944   2.202668     0.43   0.665     .1437918    20.90912
    Chinese  |   2.01e-16   1.35e-08    -0.00   1.000            0           .
      Other  |   .7737843   1.126323    -0.18   0.860      .044628    13.41628
    Unknown  |   .5332425   .6105812    -0.55   0.583     .0565288     5.03014
             |
        male |
       Male  |    2.60414   1.575794     1.58   0.114     .7954132    8.525816
        age1 |   1.045404   .0974973     0.48   0.634     .8707601    1.255074
        age2 |   .9215747   .2816553    -0.27   0.789     .5062709     1.67756
        age3 |   1.166495   .9158595     0.20   0.844     .2503643    5.434924
             |
         imd |
          4  |   1.185889   .8136032     0.25   0.804     .3090722    4.550175
5 most de..  |   1.408545   1.132977     0.43   0.670     .2911373    6.814646
             |
   bmicat_sa |
Normal (..)  |   1.95e-06   76.57374    -0.00   1.000            0           .
Overweig..)  |   6.37e+09   7.53e+09    19.11   0.000     6.29e+08    6.45e+10
Obese I ..)  |   6.82e+09   7.82e+09    19.75   0.000     7.21e+08    6.45e+10
Obese II..)  |   3.24e+09   4.05e+09    17.51   0.000     2.79e+08    3.75e+10
Obese II..)  |   4.65e+09   5.30e+09    19.51   0.000     4.97e+08    4.35e+10
    Unknown  |   1.89e+09          .        .       .            .           .
             |
    hba1ccat |
  >=6.5-7.4  |   .6324397   .4957007    -0.58   0.559      .136099    2.938891
  >=7.5-7.9  |   4.40e-16   2.08e-08    -0.00   1.000            0           .
    >=8-8.9  |   .8736429   .9317158    -0.13   0.899     .1080317    7.065073
        >=9  |   5.70e-16   2.83e-08    -0.00   1.000            0           .
    Unknown  |   4.45e-16   8.89e-08    -0.00   1.000            0           .
             |
gp_consult~t |   1.011425   .1213841     0.09   0.925     .7994265    1.279643
             |
smoke_nomiss |
     Former  |   9.75e-16   6.08e-08    -0.00   1.000            0           .
    Current  |   2.993451   1.853509     1.77   0.077     .8894435    10.07455
             |
1.hyperten~n |   .7122896   .5536656    -0.44   0.662     .1552438    3.268128
             |
      bp_cat |
High, sta..  |   .9655616   .7579763    -0.04   0.964     .2072896    4.497616
    Unknown  |   1.334856          .        .       .            .           .
             |
    1.asthma |   5.47e-16   3.18e-08    -0.00   1.000            0           .
1.~y_disease |   .6752658   .5268958    -0.50   0.615     .1463187    3.116374
1.~c_disease |   1.008778    .682088     0.01   0.990      .268073    3.796102
             |
     dm_type |
       T1DM  |   1.984288   2.166308     0.63   0.530     .2335187    16.86117
       T2DM  |   .6765632   .5308598    -0.50   0.619     .1453516    3.149175
 UNKNOWN_DM  |   7.78e-16   6.26e-08    -0.00   1.000            0           .
             |
    1.cancer |   1.018518   .6808386     0.03   0.978     .2747734    3.775399
1.~r_disease |   1.123027   .7538645     0.17   0.863     .3012979    4.185853
    1.stroke |   1.218541   .8197313     0.29   0.769     .3260047    4.554666
  1.dementia |   1.196117    .795148     0.27   0.788     .3250249    4.401804
1.other_ne~o |   2.193983   1.251156     1.38   0.168     .7174986    6.708809
             |
      egfr60 |
   eGFR <60  |   1.29e-15   1.66e-07    -0.00   1.000            0           .
      1.esrf |   .6369658   .4913873    -0.58   0.559     .1404289    2.889187
1.immunosu~d |   1.019068   .5860288     0.03   0.974     .3301477    3.145561
1.ra_sle_p~s |   .2684241   .2836362    -1.24   0.213     .0338361    2.129424
             |
hh_total_cat |
       6-10  |   2.16e+15   2.37e+23     0.00   1.000            0           .
        11+  |   2.741102   6.01e+08     0.00   1.000            0           .
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/modela_ons_noncoviddeath_eth16.ster not found)
file ./output/model/modela_ons_noncoviddeath_eth16.ster saved
(note: file ./output/model/modela_ons_noncoviddeath_eth16.dta not found)
file ./output/model/modela_ons_noncoviddeath_eth16.dta saved

         failure _d:  ons_noncoviddeath
   analysis time _t:  (stime_ons_noncoviddeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Cox regression -- no ties

No. of subjects =        6,684                  Number of obs    =       6,684
No. of failures =           14
Time at risk    =      1229049
                                                LR chi2(54)      =       40.38
Log likelihood  =    -103.0964                  Prob > chi2      =      0.9154

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   1.12e-18   9.45e-10    -0.00   1.000            0           .
Other White  |   1.24e-18   1.05e-09    -0.00   1.000            0           .
White + C..  |   1.09e-18   9.35e-10    -0.00   1.000            0           .
White + A..  |   1.38e-18   1.09e-09    -0.00   1.000            0           .
White + A..  |   1.45e-18   1.26e-09    -0.00   1.000            0           .
Other mixed  |   1.091226    1.56596     0.06   0.951     .0655242    18.17306
     Indian  |   .8741595   1.256441    -0.09   0.925     .0522574    14.62292
  Pakistani  |   1.782108   2.220539     0.46   0.643     .1549964    20.49021
Bangladeshi  |   .8678623   1.245382    -0.10   0.921     .0521167     14.4519
Other Asian  |   .8920569   1.278275    -0.08   0.936      .053785     14.7953
  Caribbean  |   1.31e-18   1.13e-09    -0.00   1.000            0           .
    African  |   1.28e-18   9.97e-10    -0.00   1.000            0           .
Other Black  |    1.85565   2.328393     0.49   0.622     .1586513    21.70444
    Chinese  |   1.39e-18   1.18e-09    -0.00   1.000            0           .
      Other  |   .9184215   1.318472    -0.06   0.953     .0550896    15.31137
    Unknown  |   .6168387   .6982854    -0.43   0.670     .0670777    5.672374
             |
        male |
       Male  |   2.575982   1.544428     1.58   0.115     .7954362    8.342191
        age1 |   1.034407   .0954473     0.37   0.714     .8632744    1.239464
        age2 |   .9665516   .2935261    -0.11   0.911     .5330021    1.752755
        age3 |   1.023693   .7998378     0.03   0.976     .2213625    4.734079
             |
         imd |
          4  |   1.041654   .7089015     0.06   0.952     .2744325    3.953774
5 most de..  |   1.460782   1.165444     0.48   0.635     .3058284    6.977388
             |
   bmicat_sa |
Normal (..)  |   1.27e-08    6.23231    -0.00   1.000            0           .
Overweig..)  |   6.53e+09   7.66e+09    19.25   0.000     6.54e+08    6.51e+10
Obese I ..)  |   6.17e+09   7.08e+09    19.66   0.000     6.52e+08    5.84e+10
Obese II..)  |   2.85e+09   3.56e+09    17.41   0.000     2.45e+08    3.30e+10
Obese II..)  |   4.68e+09   5.34e+09    19.54   0.000     5.02e+08    4.37e+10
    Unknown  |   1.79e+09          .        .       .            .           .
             |
    hba1ccat |
  >=6.5-7.4  |   .6053759   .4708661    -0.65   0.519     .1318117     2.78033
  >=7.5-7.9  |   3.03e-18   1.62e-09    -0.00   1.000            0           .
    >=8-8.9  |   .7088053   .7522628    -0.32   0.746     .0885396    5.674354
        >=9  |   3.32e-18   2.12e-09    -0.00   1.000            0           .
    Unknown  |   3.59e-18   8.81e-09    -0.00   1.000            0           .
             |
gp_consult~t |   1.010908    .120287     0.09   0.927     .8006233    1.276425
             |
smoke_nomiss |
     Former  |   5.13e-18   4.50e-09    -0.00   1.000            0           .
    Current  |   2.805989   1.709549     1.69   0.090     .8501415    9.261487
             |
1.hyperten~n |   .7446773   .5754986    -0.38   0.703     .1637366    3.386806
             |
      bp_cat |
High, sta..  |    1900051    1486437    18.48   0.000       410070     8803848
    Unknown  |    2546466          .        .       .            .           .
             |
    1.asthma |   4.16e-18   2.99e-09    -0.00   1.000            0           .
1.~y_disease |   .7292858   .5636407    -0.41   0.683     .1603365    3.317135
1.~c_disease |   1.033191   .6857943     0.05   0.961     .2813096    3.794696
             |
     dm_type |
       T1DM  |   2.156287    2.31103     0.72   0.473     .2638878     17.6195
       T2DM  |   .7198581   .5600956    -0.42   0.673     .1566599    3.307776
 UNKNOWN_DM  |   6.18e-18   5.14e-09    -0.00   1.000            0           .
             |
    1.cancer |   1.011605   .6685673     0.02   0.986     .2769837    3.694605
1.~r_disease |   1.062283   .7040075     0.09   0.927     .2898164    3.893656
    1.stroke |   1.183298   .7817307     0.25   0.799     .3241594    4.319461
  1.dementia |   1.201917   .7986963     0.28   0.782     .3267647    4.420932
1.other_ne~o |   2.149421   1.215258     1.35   0.176     .7096793        6.51
             |
      egfr60 |
   eGFR <60  |   4.82e-18   6.68e-09    -0.00   1.000            0           .
      1.esrf |   .6634767   .5117105    -0.53   0.595     .1463293    3.008293
1.immunosu~d |    1.02893   .5847637     0.05   0.960     .3377766    3.134314
1.ra_sle_p~s |   .2929907   .3056424    -1.18   0.239     .0379224    2.263661
             |
hh_total_cat |
       6-10  |   1.93e+15   9.15e+22     0.00   1.000            0           .
        11+  |     .01017   3.01e+07    -0.00   1.000            0           .
------------------------------------------------------------------------------
(note: file ./output/model/modelb_ons_noncoviddeath_eth16.ster not found)
file ./output/model/modelb_ons_noncoviddeath_eth16.ster saved
(note: file ./output/model/modelb_ons_noncoviddeath_eth16.dta not found)
file ./output/model/modelb_ons_noncoviddeath_eth16.dta saved
(output written to ./output/estout_sens_nostp_eth16.txt)
onsdeath
(1,189 observations deleted)

         failure _d:  onsdeath
   analysis time _t:  (stime_onsdeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,684                  Number of obs    =       6,684
No. of failures =           17
Time at risk    =      1229049
                                                LR chi2(38)      =       42.59
Log likelihood  =   -89.164958                  Prob > chi2      =      0.2800

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   4.24e-20          .        .       .            .           .
Other White  |   5.04e-20          .        .       .            .           .
White + C..  |   4.38e-20          .        .       .            .           .
White + A..  |   4.45e-20          .        .       .            .           .
White + A..  |   5.72e-20          .        .       .            .           .
Other mixed  |   .8230592   1.184039    -0.14   0.892     .0490803    13.80242
     Indian  |    .689615   .9939986    -0.26   0.797     .0408978    11.62822
  Pakistani  |   1.544813   1.927436     0.35   0.727     .1339204     17.8199
Bangladeshi  |   .7200486   1.035364    -0.23   0.819     .0429944    12.05902
Other Asian  |    .843435    1.20917    -0.12   0.905     .0507864    14.00735
  Caribbean  |   .8480089   1.214747    -0.12   0.908     .0511776    14.05143
    African  |   4.57e-20          .        .       .            .           .
Other Black  |   2.662035   3.140258     0.83   0.407     .2636923    26.87386
    Chinese  |   5.77e-20          .        .       .            .           .
      Other  |   .7641232   1.098669    -0.19   0.852     .0456343    12.79486
    Unknown  |   .6686208   .7424904    -0.36   0.717     .0758468    5.894169
             |
        male |
       Male  |   2.436057    1.32098     1.64   0.101     .8416153    7.051174
        age1 |   1.030633   .0761581     0.41   0.683     .8916715     1.19125
        age2 |   .9201844   .2357969    -0.32   0.745     .5568712     1.52053
        age3 |   1.194962   .8068349     0.26   0.792     .3181451    4.488311
             |
         imd |
          4  |    .946978   .6263415    -0.08   0.934     .2590276    3.462054
5 most de..  |   1.089826   .8540409     0.11   0.913     .2345923    5.062912
             |
   bmicat_sa |
Normal (..)  |   7.61e-11          .        .       .            .           .
Overweig..)  |   1.95e+09   1.84e+09    22.66   0.000     3.06e+08    1.24e+10
Obese I ..)  |   2.36e+09   2.06e+09    24.68   0.000     4.25e+08    1.31e+10
Obese II..)  |   9.66e+08   9.93e+08    20.14   0.000     1.29e+08    7.24e+09
Obese II..)  |   1.73e+09   1.51e+09    24.35   0.000     3.13e+08    9.60e+09
    Unknown  |   9.70e+08          .        .       .            .           .
             |
    hba1ccat |
  >=6.5-7.4  |   .4908084   .3744876    -0.93   0.351     .1100129    2.189677
  >=7.5-7.9  |   4.63e-20          .        .       .            .           .
    >=8-8.9  |   .6114692   .6408445    -0.47   0.639     .0783937    4.769449
        >=9  |   7.49e-20          .        .       .            .           .
    Unknown  |   1.01e-18          .        .       .            .           .
             |
gp_consult~t |   1.050487   .1131235     0.46   0.647     .8506043     1.29734
             |
smoke_nomiss |
     Former  |   2.10e-19          .        .       .            .           .
    Current  |   2.300984    1.35966     1.41   0.158     .7226618    7.326422
             |
1.hyperten~n |   .9126767   .5938665    -0.14   0.888      .254948     3.26725
             |
      bp_cat |
High, sta..  |    1994227    1537640    18.81   0.000     440006.6     9038365
    Unknown  |    2288178          .        .       .            .           .
             |
    1.asthma |   1.928761   2.052101     0.62   0.537     .2396869    15.52074
1.~y_disease |    .572662   .4361617    -0.73   0.464     .1287034    2.548043
1.~c_disease |   .7399542   .4813557    -0.46   0.643     .2067666    2.648069
             |
     dm_type |
       T1DM  |   2.124988   2.275783     0.70   0.482     .2604662    17.33651
       T2DM  |   .8315631   .5427939    -0.28   0.778     .2313569    2.988876
 UNKNOWN_DM  |   3.01e-19          .        .       .            .           .
             |
    1.cancer |   1.171067   .6819075     0.27   0.786     .3740505    3.666342
1.~r_disease |   .8974672   .5836816    -0.17   0.868     .2508572     3.21078
    1.stroke |   .8110988   .5281327    -0.32   0.748     .2263752    2.906154
  1.dementia |   1.280033   .7453744     0.42   0.672     .4088451     4.00759
1.other_ne~o |   1.973048   1.016222     1.32   0.187     .7189933    5.414401
             |
      egfr60 |
   eGFR <60  |   5.64e-19          .        .       .            .           .
      1.esrf |   .4804898   .3673866    -0.96   0.338     .1073614    2.150404
1.immunosu~d |   1.196849   .6024913     0.36   0.721     .4462175    3.210203
1.ra_sle_p~s |   .4803206    .366627    -0.96   0.337        .1076    2.144126
             |
hh_total_cat |
       6-10  |   1.25e+16          .        .       .            .           .
        11+  |     .00585          .        .       .            .           .
------------------------------------------------------------------------------
                                                             Stratified by stp
(note: file ./output/model/modela_onsdeath_eth16.ster not found)
file ./output/model/modela_onsdeath_eth16.ster saved
(note: file ./output/model/modela_onsdeath_eth16.dta not found)
file ./output/model/modela_onsdeath_eth16.dta saved

         failure _d:  onsdeath
   analysis time _t:  (stime_onsdeath-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Cox regression -- no ties

No. of subjects =        6,684                  Number of obs    =       6,684
No. of failures =           17
Time at risk    =      1229049
                                                LR chi2(54)      =       42.82
Log likelihood  =   -128.29797                  Prob > chi2      =      0.8633

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
ethnicity_16 |
      Irish  |   4.44e-16   1.89e-08    -0.00   1.000            0           .
Other White  |   5.21e-16   2.15e-08    -0.00   1.000            0           .
White + C..  |   4.55e-16   1.89e-08    -0.00   1.000            0           .
White + A..  |   4.82e-16   1.92e-08    -0.00   1.000            0           .
White + A..  |   5.86e-16   2.49e-08    -0.00   1.000            0           .
Other mixed  |   1.031477   1.474109     0.02   0.983     .0626594     16.9798
     Indian  |   .8262184   1.182843    -0.13   0.894     .0499442    13.66798
  Pakistani  |   1.752453   2.167969     0.45   0.650     .1551031    19.80032
Bangladeshi  |   .8543535   1.218237    -0.11   0.912      .052227    13.97591
Other Asian  |    .950206    1.35507    -0.04   0.971     .0580679     15.5489
  Caribbean  |    .944067    1.34889    -0.04   0.968     .0573852    15.53123
    African  |   4.74e-16   1.76e-08    -0.00   1.000            0           .
Other Black  |   2.986819   3.498263     0.93   0.350     .3007827    29.65957
    Chinese  |   5.79e-16   2.40e-08    -0.00   1.000            0           .
      Other  |   .9355633   1.336953    -0.05   0.963     .0568429     15.3982
    Unknown  |   .7569404   .8355185    -0.25   0.801     .0869955    6.586074
             |
        male |
       Male  |   2.485042   1.336876     1.69   0.091     .8657917      7.1327
        age1 |   1.022291   .0749744     0.30   0.764     .8854172    1.180325
        age2 |   .9570489   .2437175    -0.17   0.863     .5809934    1.576511
        age3 |   1.074452   .7208444     0.11   0.915     .2884832    4.001785
             |
         imd |
          4  |   .8340221   .5459985    -0.28   0.782     .2311705    3.009004
5 most de..  |   1.047021   .8133496     0.06   0.953     .2284141    4.799411
             |
   bmicat_sa |
Normal (..)  |   1.62e-06   35.33679    -0.00   1.000            0           .
Overweig..)  |   1.81e+09   1.70e+09    22.70   0.000     2.88e+08    1.14e+10
Obese I ..)  |   2.13e+09   1.86e+09    24.59   0.000     3.84e+08    1.18e+10
Obese II..)  |   7.93e+08   8.14e+08    19.96   0.000     1.06e+08    5.93e+09
Obese II..)  |   1.66e+09   1.45e+09    24.39   0.000     3.01e+08    9.15e+09
    Unknown  |   8.45e+08          .        .       .            .           .
             |
    hba1ccat |
  >=6.5-7.4  |   .4669819   .3549366    -1.00   0.316     .1052765    2.071422
  >=7.5-7.9  |   1.01e-15   2.66e-08    -0.00   1.000            0           .
    >=8-8.9  |   .5379127   .5615928    -0.59   0.553     .0695086    4.162797
        >=9  |   1.40e-15   3.81e-08    -0.00   1.000            0           .
    Unknown  |   1.33e-15   1.40e-07    -0.00   1.000            0           .
             |
gp_consult~t |   1.047029   .1112382     0.43   0.665     .8502089    1.289413
             |
smoke_nomiss |
     Former  |   1.62e-15   6.89e-08    -0.00   1.000            0           .
    Current  |   2.202211   1.289533     1.35   0.178      .698919    6.938906
             |
1.hyperten~n |   .9291439   .5996435    -0.11   0.909     .2622656    3.291734
             |
      bp_cat |
High, sta..  |    4719212    3612038    20.08   0.000      1052854    2.12e+07
    Unknown  |    5358627          .        .       .            .           .
             |
    1.asthma |   2.003491   2.105054     0.66   0.508     .2555263    15.70865
1.~y_disease |   .6068981   .4606146    -0.66   0.511     .1371145    2.686261
1.~c_disease |   .7667363   .4942591    -0.41   0.680     .2167397      2.7124
             |
     dm_type |
       T1DM  |   2.100542   2.235476     0.70   0.486     .2608859    16.91267
       T2DM  |    .883297   .5735766    -0.19   0.848      .247384    3.153856
 UNKNOWN_DM  |   2.61e-15   9.08e-08    -0.00   1.000            0           .
             |
    1.cancer |   1.206033   .6973321     0.32   0.746      .388322    3.745645
1.~r_disease |   .8970803   .5776451    -0.17   0.866     .2539384    3.169088
    1.stroke |   .8204951   .5287966    -0.31   0.759     .2320009    2.901766
  1.dementia |      1.324   .7682028     0.48   0.629     .4246285    4.128257
1.other_ne~o |   2.019458   1.037037     1.37   0.171     .7381141    5.525175
             |
      egfr60 |
   eGFR <60  |   1.72e-15   1.04e-07    -0.00   1.000            0           .
      1.esrf |   .5171611   .3926002    -0.87   0.385     .1167994    2.289872
1.immunosu~d |   1.256896   .6281786     0.46   0.647     .4719338    3.347477
1.ra_sle_p~s |   .5035143    .381905    -0.90   0.366     .1138658    2.226539
             |
hh_total_cat |
       6-10  |   2.32e+14   5.49e+21     0.00   1.000            0           .
        11+  |   .8679577   8.76e+07    -0.00   1.000            0           .
------------------------------------------------------------------------------
(note: file ./output/model/modelb_onsdeath_eth16.ster not found)
file ./output/model/modelb_onsdeath_eth16.ster saved
(note: file ./output/model/modelb_onsdeath_eth16.dta not found)
file ./output/model/modelb_onsdeath_eth16.dta saved
(output written to ./output/estout_sens_nostp_eth16.txt)

. 
. file close tablecontent

. 
. ************************************************create forestplot dataset
. dsconcat `hr'

. duplicates drop

Duplicates in terms of all variables

(0 observations are duplicates)

. split idstr, p(_)
variables created as string: 
idstr1  idstr2  idstr3  idstr4

. ren idstr1 model

. ren idstr2 outcome

. drop idstr idstr3

. tab model

      model |      Freq.     Percent        Cum.
------------+-----------------------------------
     modela |        546       50.00       50.00
     modelb |        546       50.00      100.00
------------+-----------------------------------
      Total |      1,092      100.00

. 
. *save dataset for later
. outsheet using ./output/FP_sens_nostp_eth16.txt, replace
(note: file ./output/FP_sens_nostp_eth16.txt not found)

. 
. 
end of do-file
