-------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /workspace/logs/11b_eth_an_testedpop_eth5.log
  log type:  text
 opened on:  15 Jan 2021, 16:38:26

. 
. cap file close tablecontent

. file open tablecontent using ./output/table3_testedpop_eth5_nocarehomes.txt, 
> write text replace
(note: file ./output/table3_testedpop_eth5_nocarehomes.txt not found)

. file write tablecontent ("Table 3: Odds of testing positive amongst those rec
> eiving a test - No care homes") _n

. file write tablecontent _tab ("Denominator") _tab ("Event") _tab ("%") _tab (
> "Crude") _tab _tab ("Age/Sex Adjusted") _tab _tab ("Age/Sex/IMD Adjusted") _t
> ab _tab       ("plus co-morbidities") _tab _tab       ("plus hh size")  _n

. 
. file write tablecontent _tab _tab _tab _tab   ("OR") _tab ("95% CI") _tab ("O
> R") _tab ("95% CI") _tab ("OR") _tab ("95% CI") _tab ("OR") _tab ("95% CI") _
> tab ("95% CI") _tab ("95% CI") _n

. 
. 
. foreach i of global outcomes {
  2. * Open Stata dataset
. use ./output/analysis_dataset.dta, clear
  3. 
. safecount
  4. 
. *define population as anyone who has received a test
. keep if tested==1
  5. safecount
  6. 
. keep if carehome==0
  7. safecount
  8. 
. 
. 
. /* Sense check outcomes======================================================
> =*/ 
. safetab tested `i'
  9. 
. safetab eth5 `i', missing row
 10. 
. 
. /* Main Model================================================================
> =*/
. 
. /* Univariable model */ 
. 
. logistic `i' i.eth5 i.stp, nolog 
 11. estimates save ./output/crude_`i'_eth5, replace 
 12. parmest, label eform format(estimate p lb ub) saving(./output/crude_`i'_et
> h5, replace) idstr("crude_`i'_eth5") 
 13. eststo model1
 14. local hr "`hr' ./output/crude_`i'_eth5 "
 15. 
. 
. /* Multivariable models */ 
. *Age Gender
. logistic `i' i.eth5 i.male age1 age2 age3 i.stp, nolog 
 16. estimates save ./output/model0_`i'_eth5, replace 
 17. parmest, label eform format(estimate p lb ub) saving(./output/model0_`i'_e
> th5, replace) idstr("model0_`i'_eth5") 
 18. eststo model2
 19. local hr "`hr' ./output/model0_`i'_eth5 "
 20. 
. * Age, Gender, IMD
. logistic `i' i.eth5 i.male age1 age2 age3 i.imd i.stp , nolog 
 21. estimates save ./output/model1_`i'_eth5, replace 
 22. parmest, label eform format(estimate p lb ub) saving(./output/model1_`i'_e
> th5, replace) idstr("model1_`i'_eth5") 
 23. eststo model3
 24. local hr "`hr' ./output/model1_`i'_eth5 "
 25. 
. * Age, Gender, IMD and Comorbidities  
. cap logistic `i' i.eth5 i.male age1 age2 age3   i.imd                        
>                    ///
>                                                                              
>    i.bmicat_sa     i.hba1ccat                      ///
>                                                                              
>    gp_consult_count                        ///
>                                                                              
>    i.smoke_nomiss                          ///
>                                                                              
>    i.hypertension i.bp_cat         ///     
>                                                                              
>    i.asthma                                        ///
>                                                                              
>    i.chronic_respiratory_disease ///
>                                                                              
>    i.chronic_cardiac_disease       ///
>                                                                              
>    i.dm_type                                       ///     
>                                                                              
>    i.cancer                    ///
>                                                                              
>    i.chronic_liver_disease         ///
>                                                                              
>    i.stroke                                        ///
>                                                                              
>    i.dementia                                      ///
>                                                                              
>    i.other_neuro                           ///
>                                                                              
>    i.egfr60                                        ///
>                                                                              
>    i.esrf                                          ///
>                                                                              
>    i.immunosuppressed                      ///
>                                                                              
>    i.ra_sle_psoriasis      i. stp, nolog           
 26.                                                                           
>       
. cap estimates save ./output/model2_`i'_eth5, replace 
 27. parmest, label eform format(estimate p lb ub) saving(./output/model2_`i'_e
> th5, replace) idstr("model2_`i'_eth5") 
 28. eststo model4
 29. local hr "`hr' ./output/model2_`i'_eth5 "
 30. 
. * Age, Gender, IMD and Comorbidities  and household size 
. cap logistic `i' i.eth5 i.male age1 age2 age3   i.imd                        
>                    ///
>                                                                              
>    i.bmicat_sa     i.hba1ccat                      ///
>                                                                              
>    gp_consult_count                        ///
>                                                                              
>    i.smoke_nomiss                          ///
>                                                                              
>    i.hypertension i.bp_cat         ///     
>                                                                              
>    i.asthma                                        ///
>                                                                              
>    i.chronic_respiratory_disease ///
>                                                                              
>    i.chronic_cardiac_disease       ///
>                                                                              
>    i.dm_type                                       ///     
>                                                                              
>    i.cancer                    ///
>                                                                              
>    i.chronic_liver_disease         ///
>                                                                              
>    i.stroke                                        ///
>                                                                              
>    i.dementia                                      ///
>                                                                              
>    i.other_neuro                           ///
>                                                                              
>    i.egfr60                                        ///
>                                                                              
>    i.esrf                                          ///
>                                                                              
>    i.immunosuppressed                      ///
>                                                                              
>    i.ra_sle_psoriasis                      ///
>                                                                              
>    i.hh_total_cat i.stp, nolog             
 31.                                                                           
>       
. cap estimates save ./output/model3_`i'_eth5, replace 
 32. parmest, label eform format(estimate p lb ub) saving(./output/model3_`i'_e
> th5, replace) idstr("model3_`i'_eth5") 
 33. eststo model5
 34. local hr "`hr' ./output/model3_`i'_eth5 "
 35. 
. /* Estout================================================================*/ 
. esttab model1 model2 model3 model4 model5   using ./output/estout_table3_test
> edpop_eth5_nocarehomes.txt, b(a2) ci(2) label wide compress eform ///
>         title ("`i'") ///
>         varlabels(`e(labels)') ///
>         stats(N_sub) ///
>         append 
 36. eststo clear
 37. 
. 
. 
. /* Print table===============================================================
> =*/ 
. *  Print the results for the main model 
. 
. 
. * Column headings 
. file write tablecontent ("`i'") _n
 38. 
. * eth5 labelled columns
. 
. local lab1: label eth5 1
 39. local lab2: label eth5 2
 40. local lab3: label eth5 3
 41. local lab4: label eth5 4
 42. local lab5: label eth5 5
 43. local lab6: label eth5 6
 44. 
. /* Counts */
.  
. * First row, eth5 = 1 (White) reference cat
.         qui safecount if eth5==1
 45.         local denominator = r(N)
 46.         qui safecount if eth5 == 1 & `i' == 1
 47.         local event = r(N)
 48.         local pct =(`event'/`denominator')
 49.         file write tablecontent  ("`lab1'") _tab (`denominator') _tab (`ev
> ent') _tab %3.2f (`pct') _tab
 50.         file write tablecontent ("1.00") _tab _tab ("1.00") _tab _tab ("1.
> 00")  _tab _tab ("1.00") _tab _tab ("1.00") _n
 51.         
. * Subsequent ethnic groups
. forvalues eth=2/6 {
 52.         qui safecount if eth5==`eth'
 53.         local denominator = r(N)
 54.         qui safecount if eth5 == `eth' & `i' == 1
 55.         local event = r(N)
 56.         local pct =(`event'/`denominator')
 57.         file write tablecontent  ("`lab`eth''") _tab (`denominator') _tab 
> (`event') _tab %3.2f (`pct') _tab
 58.         cap estimates use ./output/crude_`i'_eth5" 
 59.         cap lincom `eth'.eth5, eform
 60.         file write tablecontent  %4.2f (r(estimate)) _tab ("(") %4.2f (r(l
> b)) (" - ") %4.2f (r(ub)) (")") _tab 
 61.         cap estimates clear
 62.         cap estimates use ./output/model0_`i'_eth5" 
 63.         cap lincom `eth'.eth5, eform
 64.         file write tablecontent  %4.2f (r(estimate)) _tab ("(") %4.2f (r(l
> b)) (" - ") %4.2f (r(ub)) (")") _tab 
 65.         cap estimates clear
 66.         cap estimates use ./output/model1_`i'_eth5" 
 67.         cap lincom `eth'.eth5, eform
 68.         file write tablecontent  %4.2f (r(estimate)) _tab ("(") %4.2f (r(l
> b)) (" - ") %4.2f (r(ub)) (")") _tab 
 69.         cap estimates clear
 70.         cap estimates use ./output/model2_`i'_eth5" 
 71.         cap lincom `eth'.eth5, eform
 72.         file write tablecontent  %4.2f (r(estimate)) _tab ("(") %4.2f (r(l
> b)) (" - ") %4.2f (r(ub)) (")") _tab 
 73.         cap estimates clear
 74.         cap estimates use ./output/model3_`i'_eth5" 
 75.         cap lincom `eth'.eth5, eform
 76.         file write tablecontent  %4.2f (r(estimate)) _tab ("(") %4.2f (r(l
> b)) (" - ") %4.2f (r(ub)) (")") _n
 77. }  //end ethnic group
 78. 
. } //end outcomes
  78,684
(69,007 observations deleted)
  9,677
(1,450 observations deleted)
  8,227

   outcome | outcome positivetest
    tested |         0          1 |     Total
-----------+----------------------+----------
         1 |     7,177      1,050 |     8,227 
-----------+----------------------+----------
     Total |     7,177      1,050 |     8,227 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

      Eth 5 | outcome positivetest
 categories |         0          1 |     Total
------------+----------------------+----------
      White |     1,079        168 |     1,247 
            |     86.53      13.47 |    100.00 
------------+----------------------+----------
South Asian |     1,080        163 |     1,243 
            |     86.89      13.11 |    100.00 
------------+----------------------+----------
      Black |     1,102        162 |     1,264 
            |     87.18      12.82 |    100.00 
------------+----------------------+----------
      Mixed |     1,052        134 |     1,186 
            |     88.70      11.30 |    100.00 
------------+----------------------+----------
      Other |     1,091        167 |     1,258 
            |     86.72      13.28 |    100.00 
------------+----------------------+----------
    Unknown |     1,773        256 |     2,029 
            |     87.38      12.62 |    100.00 
------------+----------------------+----------
      Total |     7,177      1,050 |     8,227 
            |     87.24      12.76 |    100.00 

Logistic regression                             Number of obs     =      8,227
                                                LR chi2(14)       =      21.26
                                                Prob > chi2       =     0.0952
Log likelihood =  -3130.881                     Pseudo R2         =     0.0034

------------------------------------------------------------------------------
positivetest | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .9682866   .1144883    -0.27   0.785      .767997    1.220811
      Black  |   .9401384   .1112479    -0.52   0.602     .7455347    1.185539
      Mixed  |     .81927   .1014688    -1.61   0.108     .6426928    1.044361
      Other  |   .9733167   .1144526    -0.23   0.818     .7729674    1.225596
    Unknown  |   .9213954   .0983089    -0.77   0.443     .7475263    1.135705
             |
         stp |
          2  |   1.094045   .1549332     0.63   0.526     .8288814    1.444036
          3  |   1.041851   .1504712     0.28   0.777     .7849997    1.382745
          4  |   .8858667   .1317441    -0.81   0.415     .6618804    1.185652
          5  |   .7726253   .1186089    -1.68   0.093     .5718702    1.043856
          6  |   1.027737    .148377     0.19   0.850     .7744472    1.363867
          7  |   .7722766   .1167361    -1.71   0.087     .5742574    1.038578
          8  |   .9657751   .1404041    -0.24   0.811      .726321    1.284173
          9  |     .83048   .1239759    -1.24   0.213     .6198119    1.112752
         10  |   1.196125   .1695917     1.26   0.207     .9059193    1.579296
             |
       _cons |   .1636417   .0208027   -14.24   0.000     .1275517    .2099432
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
file ./output/crude_positivetest_eth5.ster saved
file ./output/crude_positivetest_eth5.dta saved

Logistic regression                             Number of obs     =      8,227
                                                LR chi2(18)       =      23.84
                                                Prob > chi2       =     0.1602
Log likelihood = -3129.5878                     Pseudo R2         =     0.0038

------------------------------------------------------------------------------
positivetest | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .9666862    .114361    -0.29   0.775     .7666314    1.218946
      Black  |   .9358044   .1107978    -0.56   0.575     .7420004    1.180228
      Mixed  |   .8169879    .101242    -1.63   0.103     .6408167    1.041591
      Other  |   .9702033   .1141416    -0.26   0.797      .770409    1.221811
    Unknown  |   .9171933   .0979392    -0.81   0.418     .7439921    1.130716
             |
        male |
       Male  |   .9556386   .0633658    -0.68   0.494     .8391755    1.088265
        age1 |   1.002123   .0090085     0.24   0.814     .9846211    1.019936
        age2 |   .9763924   .0326937    -0.71   0.476     .9143713     1.04262
        age3 |   1.077857   .0982875     0.82   0.411     .9014508    1.288785
             |
         stp |
          2  |   1.098023   .1555905     0.66   0.509     .8317556     1.44953
          3  |   1.046621   .1512333     0.32   0.752     .7884854    1.389266
          4  |   .8864509    .131894    -0.81   0.418     .6622247    1.186599
          5  |   .7760243   .1191907    -1.65   0.099      .574299    1.048607
          6  |   1.032961   .1492226     0.22   0.822     .7782485    1.371037
          7  |   .7734393   .1169711    -1.70   0.089     .5750357    1.040298
          8  |   .9674489    .140701    -0.23   0.820     .7275008    1.286538
          9  |   .8340674   .1246214    -1.21   0.225     .6223284    1.117848
         10  |   1.199953   .1702148     1.29   0.199     .9086996    1.584558
             |
       _cons |   .1670204   .0487199    -6.14   0.000     .0942917    .2958459
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
file ./output/model0_positivetest_eth5.ster saved
file ./output/model0_positivetest_eth5.dta saved

Logistic regression                             Number of obs     =      8,227
                                                LR chi2(20)       =      24.96
                                                Prob > chi2       =     0.2028
Log likelihood = -3129.0283                     Pseudo R2         =     0.0040

------------------------------------------------------------------------------
positivetest | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .9655515    .114241    -0.30   0.767     .7657094     1.21755
      Black  |   .9355358    .110776    -0.56   0.574     .7417718    1.179914
      Mixed  |   .8163966    .101178    -1.64   0.102     .6403387    1.040861
      Other  |   .9707443   .1142365    -0.25   0.801     .7707899     1.22257
    Unknown  |    .916362   .0978699    -0.82   0.413     .7432869    1.129738
             |
        male |
       Male  |   .9546021   .0633101    -0.70   0.484      .838243    1.087113
        age1 |   1.001968   .0090075     0.22   0.827     .9844686    1.019779
        age2 |   .9768108   .0327126    -0.70   0.484     .9147541    1.043077
        age3 |   1.076907    .098219     0.81   0.417     .9006266    1.287692
             |
         imd |
          4  |   .9352378   .0803402    -0.78   0.436     .7903161    1.106734
5 most de..  |   1.065512   .1173558     0.58   0.565     .8586318    1.322239
             |
         stp |
          2  |   1.096807   .1554503     0.65   0.514     .8307871    1.448008
          3  |   1.045352   .1510718     0.31   0.759     .7874972    1.387638
          4  |   .8856688   .1317996    -0.82   0.415     .6616083     1.18561
          5  |   .7757306   .1191568    -1.65   0.098     .5740654    1.048239
          6  |   1.030515   .1489028     0.21   0.835     .7763562    1.367878
          7  |   .7731722   .1169404    -1.70   0.089      .574823    1.039964
          8  |   .9651772   .1404029    -0.24   0.808      .725745    1.283601
          9  |   .8333577   .1245283    -1.22   0.222       .62178     1.11693
         10  |   1.198914   .1700917     1.28   0.201     .9078764    1.583249
             |
       _cons |    .169195   .0495222    -6.07   0.000     .0953337    .3002813
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
file ./output/model1_positivetest_eth5.ster saved
file ./output/model1_positivetest_eth5.dta saved
file ./output/model2_positivetest_eth5.dta saved
file ./output/model3_positivetest_eth5.dta saved
(note: file ./output/estout_table3_testedpop_eth5_nocarehomes.txt not found)
(output written to ./output/estout_table3_testedpop_eth5_nocarehomes.txt)
  78,684
(69,007 observations deleted)
  9,677
(1,450 observations deleted)
  8,227

   outcome |      outcome icu
    tested |         0          1 |     Total
-----------+----------------------+----------
         1 |     7,205      1,022 |     8,227 
-----------+----------------------+----------
     Total |     7,205      1,022 |     8,227 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

      Eth 5 |      outcome icu
 categories |         0          1 |     Total
------------+----------------------+----------
      White |     1,069        178 |     1,247 
            |     85.73      14.27 |    100.00 
------------+----------------------+----------
South Asian |     1,081        162 |     1,243 
            |     86.97      13.03 |    100.00 
------------+----------------------+----------
      Black |     1,131        133 |     1,264 
            |     89.48      10.52 |    100.00 
------------+----------------------+----------
      Mixed |     1,041        145 |     1,186 
            |     87.77      12.23 |    100.00 
------------+----------------------+----------
      Other |     1,102        156 |     1,258 
            |     87.60      12.40 |    100.00 
------------+----------------------+----------
    Unknown |     1,781        248 |     2,029 
            |     87.78      12.22 |    100.00 
------------+----------------------+----------
      Total |     7,205      1,022 |     8,227 
            |     87.58      12.42 |    100.00 

Logistic regression                             Number of obs     =      8,227
                                                LR chi2(14)       =      11.64
                                                Prob > chi2       =     0.6355
Log likelihood = -3081.4421                     Pseudo R2         =     0.0019

------------------------------------------------------------------------------
         icu | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |    .897639   .1049357    -0.92   0.356     .7138296    1.128779
      Black  |   .7065463    .086457    -2.84   0.005     .5558823    .8980458
      Mixed  |   .8340017   .1001909    -1.51   0.131      .659037    1.055417
      Other  |   .8494609   .1001145    -1.38   0.166     .6742543    1.070195
    Unknown  |   .8343658   .0881461    -1.71   0.087     .6783155    1.026316
             |
         stp |
          2  |   .9175768    .135275    -0.58   0.560     .6873103    1.224988
          3  |   1.012319    .148263     0.08   0.933     .7597161    1.348911
          4  |   1.030033   .1499121     0.20   0.839     .7744015    1.370048
          5  |   .9148125   .1366465    -0.60   0.551     .6826329    1.225962
          6  |   .8630059   .1301046    -0.98   0.328     .6422273    1.159682
          7  |   .9782804   .1421794    -0.15   0.880     .7357887    1.300689
          8  |   .8937144    .133018    -0.75   0.450     .6675875    1.196435
          9  |   .8958969   .1327178    -0.74   0.458     .6701336    1.197718
         10  |   .9582038   .1425542    -0.29   0.774      .715851    1.282606
             |
       _cons |   .1763004   .0222816   -13.73   0.000     .1376178    .2258562
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
file ./output/crude_icu_eth5.ster saved
file ./output/crude_icu_eth5.dta saved

Logistic regression                             Number of obs     =      8,227
                                                LR chi2(18)       =      14.49
                                                Prob > chi2       =     0.6965
Log likelihood = -3080.0144                     Pseudo R2         =     0.0023

------------------------------------------------------------------------------
         icu | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |    .898617   .1051065    -0.91   0.361     .7145194    1.130148
      Black  |   .7044132     .08624    -2.86   0.004     .5541361    .8954441
      Mixed  |   .8352358   .1003951    -1.50   0.134     .6599256    1.057117
      Other  |   .8497252   .1001944    -1.38   0.167     .6743882    1.070649
    Unknown  |   .8322662   .0879995    -1.74   0.082     .6764887    1.023915
             |
        male |
       Male  |   .9131881   .0612568    -1.35   0.176     .8006847    1.041499
        age1 |   .9961093   .0090828    -0.43   0.669     .9784654    1.014071
        age2 |   1.009152   .0343321     0.27   0.789     .9440563    1.078735
        age3 |   .9750097   .0904886    -0.27   0.785     .8128505    1.169519
             |
         stp |
          2  |   .9179091   .1353997    -0.58   0.561     .6874482     1.22563
          3  |   1.013485   .1485074     0.09   0.927     .7604831    1.350657
          4  |    1.02733   .1496003     0.19   0.853     .7722497    1.366666
          5  |   .9170525   .1370586    -0.58   0.562     .6841911    1.229167
          6  |   .8645964   .1304183    -0.96   0.335      .643303    1.162014
          7  |   .9772925   .1421181    -0.16   0.874     .7349244     1.29959
          8  |   .8914698   .1327388    -0.77   0.440     .6658305    1.193574
          9  |   .9003394   .1335097    -0.71   0.479     .6732604    1.204008
         10  |   .9596507   .1428339    -0.28   0.782     .7168376    1.284711
             |
       _cons |   .2123328   .0624424    -5.27   0.000     .1193156    .3778652
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/model0_icu_eth5.ster not found)
file ./output/model0_icu_eth5.ster saved
(note: file ./output/model0_icu_eth5.dta not found)
file ./output/model0_icu_eth5.dta saved

Logistic regression                             Number of obs     =      8,227
                                                LR chi2(20)       =      14.74
                                                Prob > chi2       =     0.7912
Log likelihood = -3079.8915                     Pseudo R2         =     0.0024

------------------------------------------------------------------------------
         icu | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .8985909   .1051107    -0.91   0.361     .7144874    1.130133
      Black  |   .7043851   .0862377    -2.86   0.004     .5541122    .8954113
      Mixed  |   .8348712   .1003596    -1.50   0.133     .6596245    1.056677
      Other  |   .8506001   .1003183    -1.37   0.170     .6750503    1.071802
    Unknown  |   .8317273   .0879547    -1.74   0.081     .6760315    1.023281
             |
        male |
       Male  |   .9130298   .0612567    -1.36   0.175     .8005277    1.041342
        age1 |   .9961703   .0090855    -0.42   0.674     .9785213    1.014138
        age2 |   1.008864   .0343293     0.26   0.795     .9437744    1.078443
        age3 |   .9757285   .0905693    -0.26   0.791     .8134269    1.170414
             |
         imd |
          4  |   1.032825   .0876789     0.38   0.704     .8745127    1.219796
5 most de..  |   1.043738   .1179775     0.38   0.705     .8363288    1.302584
             |
         stp |
          2  |   .9171958   .1353105    -0.59   0.558     .6868905     1.22472
          3  |    1.01325    .148483     0.09   0.928     .7602915     1.35037
          4  |   1.028426   .1497799     0.19   0.847     .7730438    1.368176
          5  |   .9167545   .1370188    -0.58   0.561     .6839618     1.22878
          6  |   .8643725   .1304025    -0.97   0.334     .6431103     1.16176
          7  |   .9772955   .1421212    -0.16   0.875     .7349227    1.299601
          8  |   .8911891   .1327157    -0.77   0.439     .6655935    1.193248
          9  |   .9006439   .1335608    -0.71   0.480     .6734794    1.204431
         10  |   .9592121   .1427769    -0.28   0.780     .7164978    1.284146
             |
       _cons |   .2098497   .0619486    -5.29   0.000     .1176602    .3742715
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
(note: file ./output/model1_icu_eth5.ster not found)
file ./output/model1_icu_eth5.ster saved
(note: file ./output/model1_icu_eth5.dta not found)
file ./output/model1_icu_eth5.dta saved
(note: file ./output/model2_icu_eth5.dta not found)
file ./output/model2_icu_eth5.dta saved
(note: file ./output/model3_icu_eth5.dta not found)
file ./output/model3_icu_eth5.dta saved
(output written to ./output/estout_table3_testedpop_eth5_nocarehomes.txt)
  78,684
(69,007 observations deleted)
  9,677
(1,450 observations deleted)
  8,227

   outcome |      outcome hes
    tested |         0          1 |     Total
-----------+----------------------+----------
         1 |     7,182      1,045 |     8,227 
-----------+----------------------+----------
     Total |     7,182      1,045 |     8,227 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

      Eth 5 |      outcome hes
 categories |         0          1 |     Total
------------+----------------------+----------
      White |     1,080        167 |     1,247 
            |     86.61      13.39 |    100.00 
------------+----------------------+----------
South Asian |     1,097        146 |     1,243 
            |     88.25      11.75 |    100.00 
------------+----------------------+----------
      Black |     1,097        167 |     1,264 
            |     86.79      13.21 |    100.00 
------------+----------------------+----------
      Mixed |     1,037        149 |     1,186 
            |     87.44      12.56 |    100.00 
------------+----------------------+----------
      Other |     1,091        167 |     1,258 
            |     86.72      13.28 |    100.00 
------------+----------------------+----------
    Unknown |     1,780        249 |     2,029 
            |     87.73      12.27 |    100.00 
------------+----------------------+----------
      Total |     7,182      1,045 |     8,227 
            |     87.30      12.70 |    100.00 

Logistic regression                             Number of obs     =      8,227
                                                LR chi2(14)       =      12.92
                                                Prob > chi2       =     0.5332
Log likelihood = -3125.4285                     Pseudo R2         =     0.0021

------------------------------------------------------------------------------
         hes | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .8603071   .1043133    -1.24   0.215      .678335    1.091096
      Black  |   .9846543   .1158512    -0.13   0.895     .7818694    1.240033
      Mixed  |   .9276084   .1121744    -0.62   0.534     .7318634    1.175708
      Other  |    .984254   .1158343    -0.13   0.893     .7815045    1.239604
    Unknown  |   .9034893   .0969557    -0.95   0.344     .7321137    1.114981
             |
         stp |
          2  |   1.015217    .140431     0.11   0.913     .7741333    1.331381
          3  |   .8628846   .1244953    -1.02   0.307     .6503438    1.144887
          4  |   .9132254   .1300496    -0.64   0.524     .6908138    1.207244
          5  |   .7257846   .1087347    -2.14   0.032     .5411074    .9734913
          6  |   .8617513   .1240145    -1.03   0.301     .6499586    1.142558
          7  |   .7586177   .1108021    -1.89   0.059     .5697682    1.010061
          8  |   .8236111   .1189473    -1.34   0.179     .6205692    1.093086
          9  |    .848692   .1214747    -1.15   0.252     .6410859    1.123528
         10  |   .7712301   .1146556    -1.75   0.081     .5762877    1.032116
             |
       _cons |   .1805601   .0224534   -13.76   0.000     .1415048    .2303946
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
file ./output/crude_hes_eth5.ster saved
file ./output/crude_hes_eth5.dta saved

Logistic regression                             Number of obs     =      8,227
                                                LR chi2(18)       =      16.31
                                                Prob > chi2       =     0.5709
Log likelihood =  -3123.731                     Pseudo R2         =     0.0026

------------------------------------------------------------------------------
         hes | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .8563517   .1038859    -1.28   0.201     .6751356    1.086209
      Black  |   .9851963   .1159783    -0.13   0.899     .7822012    1.240872
      Mixed  |   .9253082   .1119663    -0.64   0.521     .7299403    1.172966
      Other  |    .981912   .1156222    -0.16   0.877     .7795461    1.236811
    Unknown  |   .9046966   .0971661    -0.93   0.351     .7329635    1.116667
             |
        male |
       Male  |   .9971804   .0661985    -0.04   0.966     .8755202    1.135746
        age1 |   1.010899   .0093394     1.17   0.241     .9927588    1.029371
        age2 |   .9576687   .0324387    -1.28   0.202     .8961544    1.023405
        age3 |   1.134132   .1039027     1.37   0.169     .9477232    1.357206
             |
         stp |
          2  |   1.022034   .1414729     0.16   0.875     .7791827    1.340575
          3  |    .867136   .1251796    -0.99   0.323     .6534434    1.150712
          4  |   .9193459   .1309989    -0.59   0.555     .6953285    1.215536
          5  |   .7289722   .1092792    -2.11   0.035     .5433861    .9779427
          6  |   .8669622   .1248486    -0.99   0.322     .6537642    1.149686
          7  |   .7636462   .1116048    -1.85   0.065     .5734445    1.016935
          8  |   .8273996   .1195496    -1.31   0.190     .6233423    1.098257
          9  |   .8502512   .1218248    -1.13   0.258     .6420758    1.125922
         10  |   .7744682    .115191    -1.72   0.086     .5786281    1.036591
             |
       _cons |   .1310958   .0391916    -6.80   0.000     .0729657     .235537
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
file ./output/model0_hes_eth5.ster saved
file ./output/model0_hes_eth5.dta saved

Logistic regression                             Number of obs     =      8,227
                                                LR chi2(20)       =      17.99
                                                Prob > chi2       =     0.5880
Log likelihood = -3122.8903                     Pseudo R2         =     0.0029

------------------------------------------------------------------------------
         hes | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .8552815   .1037724    -1.29   0.198     .6742667    1.084892
      Black  |   .9849779    .115969    -0.13   0.898     .7820022    1.240638
      Mixed  |    .924866   .1119267    -0.65   0.519       .72957     1.17244
      Other  |   .9820776   .1156785    -0.15   0.878     .7796203     1.23711
    Unknown  |   .9043429   .0971483    -0.94   0.349     .7326449    1.116279
             |
        male |
       Male  |   .9960003   .0661348    -0.06   0.952     .8744588    1.134435
        age1 |   1.010673   .0093373     1.15   0.250     .9925373    1.029141
        age2 |   .9583216   .0324657    -1.26   0.209     .8967565    1.024113
        age3 |   1.132431   .1037681     1.36   0.175     .9462669    1.355221
             |
         imd |
          4  |   .9056121   .0784319    -1.14   0.252     .7642275    1.073153
5 most de..  |   1.045148   .1158269     0.40   0.690     .8410948    1.298707
             |
         stp |
          2  |   1.021301   .1414118     0.15   0.879      .778564    1.339717
          3  |   .8661944   .1250656    -0.99   0.320     .6527013    1.149519
          4  |   .9177981   .1308089    -0.60   0.547     .6941126    1.213569
          5  |   .7288558   .1092777    -2.11   0.035     .5432761    .9778284
          6  |   .8647624   .1245663    -1.01   0.313     .6520545    1.146858
          7  |   .7634726   .1115931    -1.85   0.065     .5732941    1.016739
          8  |   .8254013   .1192938    -1.33   0.184     .6217882     1.09569
          9  |   .8491786   .1216916    -1.14   0.254     .6412356    1.124555
         10  |    .774032   .1151452    -1.72   0.085     .5782744    1.036058
             |
       _cons |    .134106   .0402187    -6.70   0.000     .0745026    .2413934
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
file ./output/model1_hes_eth5.ster saved
file ./output/model1_hes_eth5.dta saved
file ./output/model2_hes_eth5.dta saved
file ./output/model3_hes_eth5.dta saved
(output written to ./output/estout_table3_testedpop_eth5_nocarehomes.txt)
  78,684
(69,007 observations deleted)
  9,677
(1,450 observations deleted)
  8,227

   outcome | outcome onscoviddeath
    tested |         0          1 |     Total
-----------+----------------------+----------
         1 |     8,078        149 |     8,227 
-----------+----------------------+----------
     Total |     8,078        149 |     8,227 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

      Eth 5 | outcome onscoviddeath
 categories |         0          1 |     Total
------------+----------------------+----------
      White |     1,219         28 |     1,247 
            |     97.75       2.25 |    100.00 
------------+----------------------+----------
South Asian |     1,231         12 |     1,243 
            |     99.03       0.97 |    100.00 
------------+----------------------+----------
      Black |     1,237         27 |     1,264 
            |     97.86       2.14 |    100.00 
------------+----------------------+----------
      Mixed |     1,170         16 |     1,186 
            |     98.65       1.35 |    100.00 
------------+----------------------+----------
      Other |     1,236         22 |     1,258 
            |     98.25       1.75 |    100.00 
------------+----------------------+----------
    Unknown |     1,985         44 |     2,029 
            |     97.83       2.17 |    100.00 
------------+----------------------+----------
      Total |     8,078        149 |     8,227 
            |     98.19       1.81 |    100.00 

Logistic regression                             Number of obs     =      8,227
                                                LR chi2(14)       =      18.48
                                                Prob > chi2       =     0.1860
Log likelihood = -736.07781                     Pseudo R2         =     0.0124

------------------------------------------------------------------------------
onscovidde~h | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |    .424952   .1477056    -2.46   0.014     .2150194    .8398506
      Black  |   .9494082   .2591862    -0.19   0.849     .5560028    1.621172
      Mixed  |   .5938716   .1878605    -1.65   0.099     .3194702    1.103964
      Other  |    .772537   .2225155    -0.90   0.370     .4392845    1.358603
    Unknown  |   .9632518   .2357116    -0.15   0.878     .5962761    1.556081
             |
         stp |
          2  |   1.123801   .3904106     0.34   0.737     .5688271    2.220232
          3  |   .7121321   .2813915    -0.86   0.390     .3282594    1.544913
          4  |   1.109717   .3908271     0.30   0.768     .5564562    2.213063
          5  |   1.230931   .4225573     0.61   0.545     .6281035    2.412329
          6  |   1.158574   .4026471     0.42   0.672     .5862734    2.289537
          7  |   .8752217   .3235409    -0.36   0.718     .4240886    1.806257
          8  |   .9453695   .3432392    -0.15   0.877     .4640367    1.925976
          9  |   .8069422    .304221    -0.57   0.569      .385421    1.689466
         10  |   .5242449   .2286222    -1.48   0.139     .2230113    1.232371
             |
       _cons |   .0242329    .007405   -12.17   0.000     .0133137    .0441076
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
file ./output/crude_onscoviddeath_eth5.ster saved
file ./output/crude_onscoviddeath_eth5.dta saved

Logistic regression                             Number of obs     =      8,227
                                                LR chi2(18)       =      24.17
                                                Prob > chi2       =     0.1494
Log likelihood = -733.22891                     Pseudo R2         =     0.0162

------------------------------------------------------------------------------
onscovidde~h | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .4246726    .147677    -2.46   0.014     .2148101    .8395639
      Black  |   .9497572    .259452    -0.19   0.850     .5560115    1.622338
      Mixed  |   .5936476   .1879348    -1.65   0.100     .3191967    1.104076
      Other  |    .771329   .2223407    -0.90   0.368     .4384047    1.357076
    Unknown  |   .9675814     .23706    -0.13   0.893     .5986058    1.563991
             |
        male |
       Male  |   .9247282   .1534857    -0.47   0.637     .6679321    1.280253
        age1 |    1.05192   .0250817     2.12   0.034     1.003892    1.102246
        age2 |   .8279576   .0711664    -2.20   0.028     .6995904    .9798788
        age3 |   1.624972   .3785051     2.08   0.037     1.029379    2.565172
             |
         stp |
          2  |   1.138627    .395854     0.37   0.709     .5760413    2.250658
          3  |   .7233203   .2859785    -0.82   0.413     .3332667    1.569891
          4  |   1.119467   .3945284     0.32   0.749     .5610817    2.233552
          5  |   1.239419    .425859     0.62   0.532     .6320468    2.430454
          6  |   1.177419   .4095663     0.47   0.639      .595442     2.32821
          7  |   .8823048   .3264064    -0.34   0.735     .4272861    1.821875
          8  |   .9503027   .3452448    -0.14   0.888     .4662519    1.936883
          9  |   .7977747     .30106    -0.60   0.549     .3807661    1.671484
         10  |   .5338532   .2329143    -1.44   0.150     .2270136    1.255428
             |
       _cons |   .0062303   .0048702    -6.50   0.000     .0013463    .0288331
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
file ./output/model0_onscoviddeath_eth5.ster saved
file ./output/model0_onscoviddeath_eth5.dta saved

Logistic regression                             Number of obs     =      8,227
                                                LR chi2(20)       =      26.51
                                                Prob > chi2       =     0.1498
Log likelihood = -732.06324                     Pseudo R2         =     0.0178

------------------------------------------------------------------------------
onscovidde~h | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .4251482   .1478516    -2.46   0.014     .2150415      .84054
      Black  |   .9504017   .2596656    -0.19   0.852     .5563456    1.623565
      Mixed  |   .5959122   .1886627    -1.64   0.102     .3204028    1.108328
      Other  |   .7645039    .220438    -0.93   0.352     .4344534    1.345291
    Unknown  |   .9725353   .2383291    -0.11   0.910     .6016033    1.572174
             |
        male |
       Male  |   .9270797   .1539073    -0.46   0.648     .6695863    1.283594
        age1 |   1.051841   .0250932     2.12   0.034     1.003791    1.102191
        age2 |   .8286458   .0712713    -2.19   0.029      .700096    .9807996
        age3 |   1.621137   .3778278     2.07   0.038     1.026681    2.559786
             |
         imd |
          4  |     .86735   .1879787    -0.66   0.511      .567173    1.326396
5 most de..  |   .6333777   .2108876    -1.37   0.170     .3297989      1.2164
             |
         stp |
          2  |   1.150457   .4001021     0.40   0.687     .5818921    2.274566
          3  |   .7249535   .2866531    -0.81   0.416      .333993    1.573558
          4  |   1.114487   .3928572     0.31   0.758     .5585035    2.223944
          5  |   1.245972   .4281793     0.64   0.522     .6353192    2.443568
          6  |   1.186112   .4127441     0.49   0.624     .5996864    2.345997
          7  |    .882337   .3264629    -0.34   0.735     .4272595    1.822121
          8  |   .9548582   .3469815    -0.13   0.899     .4684084    1.946494
          9  |   .7969849    .300809    -0.60   0.548     .3803452    1.670022
         10  |   .5367368   .2342033    -1.43   0.154      .228214    1.262352
             |
       _cons |   .0066082   .0051812    -6.40   0.000     .0014213    .0307236
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
file ./output/model1_onscoviddeath_eth5.ster saved
file ./output/model1_onscoviddeath_eth5.dta saved
file ./output/model2_onscoviddeath_eth5.dta saved
file ./output/model3_onscoviddeath_eth5.dta saved
(output written to ./output/estout_table3_testedpop_eth5_nocarehomes.txt)
  78,684
(69,007 observations deleted)
  9,677
(1,450 observations deleted)
  8,227

           |        outcome
   outcome |   ons_noncoviddeath
    tested |         0          1 |     Total
-----------+----------------------+----------
         1 |     7,792        435 |     8,227 
-----------+----------------------+----------
     Total |     7,792        435 |     8,227 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

            |        outcome
      Eth 5 |   ons_noncoviddeath
 categories |         0          1 |     Total
------------+----------------------+----------
      White |     1,172         75 |     1,247 
            |     93.99       6.01 |    100.00 
------------+----------------------+----------
South Asian |     1,179         64 |     1,243 
            |     94.85       5.15 |    100.00 
------------+----------------------+----------
      Black |     1,199         65 |     1,264 
            |     94.86       5.14 |    100.00 
------------+----------------------+----------
      Mixed |     1,132         54 |     1,186 
            |     95.45       4.55 |    100.00 
------------+----------------------+----------
      Other |     1,183         75 |     1,258 
            |     94.04       5.96 |    100.00 
------------+----------------------+----------
    Unknown |     1,927        102 |     2,029 
            |     94.97       5.03 |    100.00 
------------+----------------------+----------
      Total |     7,792        435 |     8,227 
            |     94.71       5.29 |    100.00 

Logistic regression                             Number of obs     =      8,227
                                                LR chi2(14)       =      10.54
                                                Prob > chi2       =     0.7218
Log likelihood = -1696.8484                     Pseudo R2         =     0.0031

------------------------------------------------------------------------------
ons_noncov~h | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .8516699   .1492382    -0.92   0.360     .6041088     1.20068
      Black  |   .8484211   .1480674    -0.94   0.346     .6026412    1.194439
      Mixed  |   .7483909   .1372799    -1.58   0.114     .5223838    1.072179
      Other  |   .9932911   .1674616    -0.04   0.968     .7137896    1.382238
    Unknown  |   .8329887   .1305219    -1.17   0.244     .6127219    1.132439
             |
         stp |
          2  |   1.016016   .2169076     0.07   0.941     .6686189     1.54391
          3  |   .8997903   .1999147    -0.48   0.635     .5821327    1.390787
          4  |   .9874554   .2142699    -0.06   0.954     .6453771     1.51085
          5  |   .9026404   .2005472    -0.46   0.645     .5839775     1.39519
          6  |   1.122074    .236345     0.55   0.585     .7425588    1.695555
          7  |   .8512149   .1890349    -0.73   0.468     .5508169     1.31544
          8  |   .8928666   .1970476    -0.51   0.608     .5793407    1.376066
          9  |   1.178411   .2439674     0.79   0.428     .7853652     1.76816
         10  |   .7518791   .1757938    -1.22   0.223     .4754797    1.188951
             |
       _cons |   .0663814   .0123745   -14.55   0.000     .0460649    .0956583
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
file ./output/crude_ons_noncoviddeath_eth5.ster saved
file ./output/crude_ons_noncoviddeath_eth5.dta saved

Logistic regression                             Number of obs     =      8,227
                                                LR chi2(18)       =      14.80
                                                Prob > chi2       =     0.6759
Log likelihood =   -1694.72                     Pseudo R2         =     0.0043

------------------------------------------------------------------------------
ons_noncov~h | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .8451387   .1481843    -0.96   0.337     .5993503    1.191723
      Black  |   .8475757   .1480088    -0.95   0.344     .6019168    1.193495
      Mixed  |   .7433933   .1364462    -1.62   0.106     .5187818    1.065253
      Other  |   .9873993   .1665812    -0.08   0.940     .7093967    1.374347
    Unknown  |   .8318422   .1304629    -1.17   0.240     .6117048    1.131202
             |
        male |
       Male  |   1.073268   .1060335     0.72   0.474     .8843283    1.302574
        age1 |    .996909   .0136269    -0.23   0.821     .9705554    1.023978
        age2 |     1.0012   .0503304     0.02   0.981     .9072586     1.10487
        age3 |   1.025904   .1390753     0.19   0.850     .7865293    1.338132
             |
         stp |
          2  |   1.022166   .2184062     0.10   0.918      .672427    1.553809
          3  |   .9027408   .2007069    -0.46   0.645     .5838684    1.395761
          4  |   .9960458   .2162792    -0.02   0.985     .6508056     1.52443
          5  |   .9075888    .201804    -0.44   0.663     .5869795    1.403316
          6  |   1.126078   .2373814     0.56   0.573     .7449583    1.702178
          7  |   .8586667   .1908296    -0.69   0.493     .5554617     1.32738
          8  |   .9000356   .1987357    -0.48   0.633     .5838577    1.387434
          9  |   1.185552   .2457433     0.82   0.412      .789736     1.77975
         10  |   .7520165   .1759176    -1.22   0.223     .4754531    1.189453
             |
       _cons |   .0680908   .0300261    -6.09   0.000     .0286902     .161601
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
file ./output/model0_ons_noncoviddeath_eth5.ster saved
file ./output/model0_ons_noncoviddeath_eth5.dta saved

Logistic regression                             Number of obs     =      8,227
                                                LR chi2(20)       =      24.37
                                                Prob > chi2       =     0.2266
Log likelihood = -1689.9332                     Pseudo R2         =     0.0072

------------------------------------------------------------------------------
ons_noncov~h | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |      .8415   .1476409    -0.98   0.325     .5966382    1.186854
      Black  |   .8454911   .1477496    -0.96   0.337     .6002906    1.190849
      Mixed  |   .7432116   .1364728    -1.62   0.106     .5185731     1.06516
      Other  |   .9818363   .1657864    -0.11   0.914     .7051976    1.366996
    Unknown  |   .8332269   .1307625    -1.16   0.245     .6126041    1.133304
             |
        male |
       Male  |   1.070187   .1057949     0.69   0.493     .8816836    1.298992
        age1 |   .9962179    .013616    -0.28   0.782     .9698852    1.023265
        age2 |   1.003606   .0504743     0.07   0.943     .9093974    1.107574
        age3 |   1.020258   .1384149     0.15   0.882     .7820425    1.331035
             |
         imd |
          4  |   .6573578   .0930359    -2.96   0.003     .4981168     .867506
5 most de..  |   .9096505   .1534139    -0.56   0.574     .6536092    1.265992
             |
         stp |
          2  |   1.025323   .2192456     0.12   0.907     .6742914    1.559099
          3  |   .9026903    .200829    -0.46   0.645     .5836667    1.396087
          4  |    .987835   .2146596    -0.06   0.955     .6452317    1.512353
          5  |   .9093572   .2023226    -0.43   0.669     .5879643     1.40643
          6  |   1.121671   .2366594     0.54   0.586     .7417751     1.69613
          7  |   .8587165   .1909579    -0.68   0.493     .5553452    1.327812
          8  |   .8966167   .1981195    -0.49   0.621     .5814634    1.382583
          9  |   1.181707   .2451397     0.80   0.421     .7869221    1.774547
         10  |    .753216   .1763022    -1.21   0.226     .4760826    1.191672
             |
       _cons |    .075467   .0333546    -5.85   0.000     .0317356    .1794598
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
file ./output/model1_ons_noncoviddeath_eth5.ster saved
file ./output/model1_ons_noncoviddeath_eth5.dta saved
file ./output/model2_ons_noncoviddeath_eth5.dta saved
file ./output/model3_ons_noncoviddeath_eth5.dta saved
(output written to ./output/estout_table3_testedpop_eth5_nocarehomes.txt)
  78,684
(69,007 observations deleted)
  9,677
(1,450 observations deleted)
  8,227

   outcome |   outcome onsdeath
    tested |         0          1 |     Total
-----------+----------------------+----------
         1 |     7,643        584 |     8,227 
-----------+----------------------+----------
     Total |     7,643        584 |     8,227 

+----------------+
| Key            |
|----------------|
|   frequency    |
| row percentage |
+----------------+

      Eth 5 |   outcome onsdeath
 categories |         0          1 |     Total
------------+----------------------+----------
      White |     1,144        103 |     1,247 
            |     91.74       8.26 |    100.00 
------------+----------------------+----------
South Asian |     1,167         76 |     1,243 
            |     93.89       6.11 |    100.00 
------------+----------------------+----------
      Black |     1,172         92 |     1,264 
            |     92.72       7.28 |    100.00 
------------+----------------------+----------
      Mixed |     1,116         70 |     1,186 
            |     94.10       5.90 |    100.00 
------------+----------------------+----------
      Other |     1,161         97 |     1,258 
            |     92.29       7.71 |    100.00 
------------+----------------------+----------
    Unknown |     1,883        146 |     2,029 
            |     92.80       7.20 |    100.00 
------------+----------------------+----------
      Total |     7,643        584 |     8,227 
            |     92.90       7.10 |    100.00 

Logistic regression                             Number of obs     =      8,227
                                                LR chi2(14)       =      17.73
                                                Prob > chi2       =     0.2193
Log likelihood = -2098.7388                     Pseudo R2         =     0.0042

------------------------------------------------------------------------------
    onsdeath | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .7257178    .113919    -2.04   0.041     .5335205     .987153
      Black  |   .8726114    .130466    -0.91   0.362     .6509625    1.169731
      Mixed  |   .6982154     .11219    -2.24   0.025      .509586    .9566683
      Other  |   .9290306   .1371896    -0.50   0.618     .6955582    1.240871
    Unknown  |   .8653122    .116101    -1.08   0.281     .6652197    1.125591
             |
         stp |
          2  |   1.045948   .1932514     0.24   0.808     .7281831     1.50238
          3  |   .8463741   .1658763    -0.85   0.395     .5764213    1.242753
          4  |    1.02018   .1914046     0.11   0.915     .7062778    1.473594
          5  |   .9894403   .1871241    -0.06   0.955     .6829822    1.433408
          6  |   1.136441   .2080778     0.70   0.485     .7937709    1.627041
          7  |   .8537097   .1648141    -0.82   0.413     .5847636     1.24635
          8  |   .9040813   .1730031    -0.53   0.598     .6213314    1.315502
          9  |   1.081587   .1985736     0.43   0.669     .7547187     1.55002
         10  |   .6855097   .1424669    -1.82   0.069     .4561541    1.030186
             |
       _cons |   .0939284   .0151919   -14.62   0.000     .0684108    .1289643
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
file ./output/crude_onsdeath_eth5.ster saved
file ./output/crude_onsdeath_eth5.dta saved

Logistic regression                             Number of obs     =      8,227
                                                LR chi2(18)       =      21.01
                                                Prob > chi2       =     0.2791
Log likelihood =  -2097.101                     Pseudo R2         =     0.0050

------------------------------------------------------------------------------
    onsdeath | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .7215027   .1133153    -2.08   0.038     .5303381     .981574
      Black  |   .8724571   .1305105    -0.91   0.362     .6507486    1.169701
      Mixed  |   .6949147   .1117253    -2.26   0.024     .5070831     .952322
      Other  |   .9251239   .1366951    -0.53   0.598     .6925123    1.235869
    Unknown  |   .8656317   .1162481    -1.07   0.283     .6653082    1.126272
             |
        male |
       Male  |   1.033242   .0889615     0.38   0.704     .8727989    1.223179
        age1 |     1.0115   .0121247     0.95   0.340     .9880129    1.035545
        age2 |   .9502432    .041693    -1.16   0.245     .8719415    1.035577
        age3 |   1.166212   .1381902     1.30   0.194      .924516    1.471095
             |
         stp |
          2  |   1.054449   .1949582     0.29   0.774     .7339152    1.514973
          3  |   .8515368   .1669802    -0.82   0.412     .5798143    1.250598
          4  |   1.028119   .1930066     0.15   0.883     .7116219     1.48538
          5  |   .9951054   .1883254    -0.03   0.979     .6867169    1.441984
          6  |   1.144365   .2096792     0.74   0.462     .7990994    1.638808
          7  |   .8606174   .1662525    -0.78   0.437     .5893544    1.256735
          8  |   .9101613   .1742462    -0.49   0.623     .6254026    1.324576
          9  |   1.083127   .1990647     0.43   0.664     .7555085    1.552813
         10  |   .6886063   .1431692    -1.79   0.073     .4581381    1.035013
             |
       _cons |   .0666118   .0258855    -6.97   0.000     .0311008    .1426692
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
file ./output/model0_onsdeath_eth5.ster saved
file ./output/model0_onsdeath_eth5.dta saved

Logistic regression                             Number of obs     =      8,227
                                                LR chi2(20)       =      30.76
                                                Prob > chi2       =     0.0585
Log likelihood = -2092.2266                     Pseudo R2         =     0.0073

------------------------------------------------------------------------------
    onsdeath | Odds Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .7194054   .1130543    -2.10   0.036     .5286981    .9789031
      Black  |   .8712121   .1304163    -0.92   0.357     .6496854    1.168274
      Mixed  |   .6953952   .1118551    -2.26   0.024     .5073586    .9531218
      Other  |   .9194087    .135965    -0.57   0.570     .6880663    1.228533
    Unknown  |   .8677622   .1166124    -1.06   0.291      .666828    1.129244
             |
        male |
       Male  |   1.031709    .088887     0.36   0.717     .8714087    1.221497
        age1 |   1.010905   .0121198     0.90   0.366     .9874274     1.03494
        age2 |   .9523594   .0418102    -1.11   0.266     .8738394    1.037935
        age3 |   1.160019   .1375641     1.25   0.211     .9194389    1.463548
             |
         imd |
          4  |   .7038138   .0844097    -2.93   0.003     .5563802    .8903155
5 most de..  |   .8338613   .1267603    -1.20   0.232     .6190099    1.123285
             |
         stp |
          2  |    1.05954    .196054     0.31   0.755     .7372482    1.522724
          3  |   .8520443   .1671846    -0.82   0.414       .58002    1.251646
          4  |   1.020347   .1916928     0.11   0.915     .7060449    1.474563
          5  |   .9980896   .1890129    -0.01   0.992     .6886103    1.446657
          6  |   1.142772   .2095706     0.73   0.467     .7977369    1.637042
          7  |    .860553   .1663449    -0.78   0.437     .5891697    1.256941
          8  |   .9082775   .1740142    -0.50   0.616      .623935    1.322202
          9  |   1.080516   .1987284     0.42   0.674     .7534914    1.549473
         10  |   .6902801   .1435998    -1.78   0.075      .459144    1.037772
             |
       _cons |   .0732784   .0285504    -6.71   0.000     .0341456    .1572597
------------------------------------------------------------------------------
Note: _cons estimates baseline odds.
file ./output/model1_onsdeath_eth5.ster saved
file ./output/model1_onsdeath_eth5.dta saved
file ./output/model2_onsdeath_eth5.dta saved
file ./output/model3_onsdeath_eth5.dta saved
(output written to ./output/estout_table3_testedpop_eth5_nocarehomes.txt)

. file close tablecontent

. 
. ************************************************create forestplot dataset
. dsconcat `hr'

. duplicates drop

Duplicates in terms of all variables

(0 observations are duplicates)

. split idstr, p(_)
variables created as string: 
idstr1  idstr2  idstr3  idstr4

. ren idstr1 model

. ren idstr2 outcome

. drop idstr idstr3

. tab model

      model |      Freq.     Percent        Cum.
------------+-----------------------------------
      crude |        102        7.83        7.83
     model0 |        132       10.14       17.97
     model1 |        150       11.52       29.49
     model2 |        450       34.56       64.06
     model3 |        468       35.94      100.00
------------+-----------------------------------
      Total |      1,302      100.00

. 
. *save dataset for later
. outsheet using ./output/FP_testedpop_eth5.txt, replace
(note: file ./output/FP_testedpop_eth5.txt not found)

. 
. * Close log file 
. log close
      name:  <unnamed>
       log:  /workspace/logs/11b_eth_an_testedpop_eth5.log
  log type:  text
 closed on:  15 Jan 2021, 16:38:54
-------------------------------------------------------------------------------
