---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/lsh152058/Documents/GitHub/ethnicity-covid-research/logs/20_eth_an_model_checks.log
  log type:  text
 opened on:  20 Jan 2021, 13:39:23

. 
. cap file close tablecontent

. file open tablecontent using ./output/Table_phtest_eth5.txt, write text replace

. 
. * Column headings 
. file write tablecontent ("Testing the PH assumption for $tableoutcome- $population Population") _n

. file write tablecontent _tab ("Univariable") _tab ("Age/Sex Adjusted") _tab ///
>                                                 ("Fully Adjusted") _tab _n

.                                                 
. file write tablecontent _tab ("p-value") _tab ("p-value") _tab ("p-value") _tab _n

. 
. 
. * Open Stata dataset
. foreach i of global outcomes {
  2.         di "`i'"
  3.         
.         use ./output/analysis_dataset_STSET_`i'.dta, clear
  4.         drop if carehome==1
  5. 
. /* Quietly run models, perform test and store results in local macro==========*/
. 
. stcox i.eth5 
  6. estat phtest, detail
  7. local univar_p = round(r(p),0.001)
  8. di `univar_p'
  9. 
. stphplot, by(eth5)
 10. graph export ./output/stphplot_crude_`i'.svg, as(svg) replace
 11. 
. sts graph, by(eth5)                                             ///
>                         failure yscale(range(0, 0.012))                                 ///
>                         ylabel(0 (0.0025) 0.01, angle(0) format(%5.4f)) ///
>                         noorigin                                                                                ///
>                         xscale(range(30, 84))                                                   ///
>                         xlabel(30 (10) 80)                                                      
 12. 
. graph export ./output/kmplot_crude_`i'.svg, replace as(svg)
 13. 
. stcox i.eth5 i.male age1 age2 age3                                                                              
 14. estat phtest, detail
 15. local multivar2_p = round(r(phtest)[2,4],0.001)
 16. di `multivar2_p'
 17. 
. stphplot, by(eth5)
 18. graph export ./output/stphplot_agesex_`i'.svg, as(svg) replace
 19. 
. sts graph, by(eth5) adjustfor(i.male age1 age2 age3     )                                               ///
>                         failure yscale(range(0, 0.012))                                 ///
>                         ylabel(0 (0.0025) 0.01, angle(0) format(%5.4f)) ///
>                         noorigin                                                                                ///
>                         xscale(range(30, 84))                                                   ///
>                         xlabel(30 (10) 80)                                                      
 20. graph export ./output/kmplot_agesex_`i'.svg, replace as(svg)
 21.                                           
. stcox i.eth5 i.male age1 age2 age3      i.imd                                           ///
>                                                                                 i.bmicat_sa     i.hba1ccat                      ///
>                                                                                 gp_consult_count                        ///
>                                                                                 i.smoke_nomiss                          ///
>                                                                                 i.hypertension i.bp_cat         ///     
>                                                                                 i.asthma                                        ///
>                                                                                 i.chronic_respiratory_disease ///
>                                                                                 i.chronic_cardiac_disease       ///
>                                                                                 i.dm_type                                       ///     
>                                                                                 i.cancer                    ///
>                                                                                 i.chronic_liver_disease         ///
>                                                                                 i.stroke                                        ///
>                                                                                 i.dementia                                      ///
>                                                                                 i.other_neuro                           ///
>                                                                                 i.egfr60                                        ///
>                                                                                 i.esrf                                          ///
>                                                                                 i.immunosuppressed                      ///
>                                                                                 i.ra_sle_psoriasis, strata(stp) nolog
 22. estat phtest, detail
 23. local multivar3_p = round(r(phtest)[2,4],0.001)
 24. di `multivar3_p'
 25. 
. stphplot, by(eth5)
 26. graph export ./output/stphplot_full_`i'.svg, as(svg) replace
 27. 
. 
. 
. * Print table of results======================================================*/        
. 
. 
. file write tablecontent ("`i'") _tab  ("`univar_p'") _tab ("`multivar2_p'") _tab ("`multivar3_p'") _n
 28. } //end outcomes
tested
(1,189 observations deleted)

         failure _d:  tested
   analysis time _t:  (stime_tested-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Iteration 0:   log likelihood = -123.24312
Iteration 1:   log likelihood = -121.23085
Iteration 2:   log likelihood = -121.19399
Iteration 3:   log likelihood = -121.19391
Refining estimates:
Iteration 0:   log likelihood = -121.19391

Cox regression -- Breslow method for ties

No. of subjects =        6,668                  Number of obs    =       6,668
No. of failures =           14
Time at risk    =      1225947
                                                LR chi2(5)       =        4.10
Log likelihood  =   -121.19391                  Prob > chi2      =      0.5353

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |    .972746   1.375671    -0.02   0.984     .0608441    15.55178
      Black  |   1.023346   1.447229     0.02   0.987     .0640091    16.36075
      Mixed  |   1.955392   2.394856     0.55   0.584     .1773083    21.56446
      Other  |   3.114115    3.59587     0.98   0.325     .3239304    29.93763
    Unknown  |   3.635193   3.926458     1.19   0.232     .4376478    30.19467
------------------------------------------------------------------------------

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      1b.eth5     |            .            .        1             .
      2.eth5      |     -0.10225         0.15        1         0.7020
      3.eth5      |     -0.15730         0.35        1         0.5562
      4.eth5      |      0.09995         0.14        1         0.7084
      5.eth5      |      0.04509         0.03        1         0.8660
      6.eth5      |     -0.02573         0.01        1         0.9233
      ------------+---------------------------------------------------
      global test |                      1.57        5         0.9053
      ----------------------------------------------------------------
.905

         failure _d:  tested
   analysis time _t:  (stime_tested-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id
(note: file ./output/stphplot_crude_tested.svg not found)
(file ./output/stphplot_crude_tested.svg written in SVG format)

         failure _d:  tested
   analysis time _t:  (stime_tested-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id
(note: file ./output/kmplot_crude_tested.svg not found)
(file ./output/kmplot_crude_tested.svg written in SVG format)

         failure _d:  tested
   analysis time _t:  (stime_tested-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Iteration 0:   log likelihood = -123.24312
Iteration 1:   log likelihood = -118.87479
Iteration 2:   log likelihood =  -117.6076
Iteration 3:   log likelihood = -116.80598
Iteration 4:   log likelihood = -116.41561
Iteration 5:   log likelihood = -116.32458
Iteration 6:   log likelihood = -116.31948
Iteration 7:   log likelihood = -116.31946
Refining estimates:
Iteration 0:   log likelihood = -116.31946

Cox regression -- Breslow method for ties

No. of subjects =        6,668                  Number of obs    =       6,668
No. of failures =           14
Time at risk    =      1225947
                                                LR chi2(9)       =       13.85
Log likelihood  =   -116.31946                  Prob > chi2      =      0.1279

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |    1.01505   1.435867     0.01   0.992      .063445    16.23969
      Black  |   1.022987   1.447171     0.02   0.987     .0639316    16.36909
      Mixed  |   1.956152   2.396563     0.55   0.584     .1772395    21.58962
      Other  |    3.24678   3.749269     1.02   0.308     .3376874    31.21698
    Unknown  |   3.587339   3.875032     1.18   0.237     .4318246    29.80146
             |
        male |
       Male  |   .8187193   .4429209    -0.37   0.712     .2835578    2.363897
        age1 |   .9401466   .0713127    -0.81   0.416     .8102697    1.090841
        age2 |    1.62464    .638837     1.23   0.217     .7517091    3.511273
        age3 |   .1028475   .1565441    -1.49   0.135     .0052069    2.031451
------------------------------------------------------------------------------

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      1b.eth5     |            .            .        1             .
      2.eth5      |     -0.10427         0.15        1         0.6993
      3.eth5      |     -0.14674         0.30        1         0.5841
      4.eth5      |      0.10779         0.16        1         0.6853
      5.eth5      |      0.05242         0.04        1         0.8439
      6.eth5      |     -0.03388         0.02        1         0.8996
      0b.male     |            .            .        1             .
      1.male      |     -0.36942         1.94        1         0.1633
      age1        |     -0.21247         0.35        1         0.5523
      age2        |     -0.06242         0.03        1         0.8553
      age3        |      0.09420         0.07        1         0.7955
      ------------+---------------------------------------------------
      global test |                      9.62        9         0.3821
      ----------------------------------------------------------------
.699

         failure _d:  tested
   analysis time _t:  (stime_tested-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id
(note: file ./output/stphplot_agesex_tested.svg not found)
(file ./output/stphplot_agesex_tested.svg written in SVG format)

         failure _d:  tested
   analysis time _t:  (stime_tested-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id
(note: file ./output/kmplot_agesex_tested.svg not found)
(file ./output/kmplot_agesex_tested.svg written in SVG format)

         failure _d:  tested
   analysis time _t:  (stime_tested-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- no ties

No. of subjects =        6,668                  Number of obs    =       6,668
No. of failures =           14
Time at risk    =      1225947
                                                LR chi2(40)      =       38.92
Log likelihood  =   -71.504211                  Prob > chi2      =      0.5188

--------------------------------------------------------------------------------------------------
                              _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------------------+----------------------------------------------------------------
                            eth5 |
                    South Asian  |    1.08103   1.553453     0.05   0.957     .0646623    18.07276
                          Black  |   .8338168   1.216158    -0.12   0.901     .0478141     14.5407
                          Mixed  |    1.98684   2.495256     0.55   0.585     .1694906    23.29056
                          Other  |   3.355897   4.008688     1.01   0.311     .3228726    34.88078
                        Unknown  |   3.847976   4.256573     1.22   0.223     .4401957    33.63712
                                 |
                            male |
                           Male  |   .7090814   .3935698    -0.62   0.536     .2389151    2.104498
                            age1 |   .9637986   .0780569    -0.46   0.649     .8223344    1.129599
                            age2 |   1.502696    .615366     0.99   0.320     .6734374    3.353088
                            age3 |   .1287768   .2022049    -1.31   0.192     .0059331    2.795065
                                 |
                             imd |
                              4  |   .8635439   .6907275    -0.18   0.854      .180065    4.141327
                5 most deprived  |   2.593045   1.807571     1.37   0.172     .6613791    10.16645
                                 |
                       bmicat_sa |
      Normal (18.5-24.9 / 22.9)  |   3.21e-09   1.807827    -0.00   1.000            0           .
 Overweight (25-29.9 / 23-27.4)  |   3.02e+09   3.55e+09    18.56   0.000     3.02e+08    3.03e+10
  Obese I (30-34.9 / 27.4-32.4)  |   1.19e+09   1.49e+09    16.74   0.000     1.03e+08    1.38e+10
Obese II (35-39.9 / 32.5- 37.4)  |   6.82e+08          .        .       .            .           .
        Obese III (40+ / 37.5+)  |   1.96e+09   2.31e+09    18.14   0.000     1.94e+08    1.98e+10
                        Unknown  |   2.95e+09   3.37e+09    19.11   0.000     3.16e+08    2.76e+10
                                 |
                        hba1ccat |
                      >=6.5-7.4  |   .9518476   .7677732    -0.06   0.951     .1958739    4.625494
                      >=7.5-7.9  |   4.024389   2.861492     1.96   0.050     .9987655    16.21573
                        >=8-8.9  |   .9728224   1.053873    -0.03   0.980     .1163895    8.131174
                            >=9  |   1.43e-18   1.77e-09    -0.00   1.000            0           .
                        Unknown  |   9.74e-19          .        .       .            .           .
                                 |
                gp_consult_count |   .8861662    .113188    -0.95   0.344     .6899111    1.138249
                                 |
                    smoke_nomiss |
                         Former  |   1.77e-18   2.35e-09    -0.00   1.000            0           .
                        Current  |   .5472279   .5771998    -0.57   0.568     .0692382    4.325044
                                 |
                  1.hypertension |   .6805732   .5319636    -0.49   0.622     .1470758     3.14926
                                 |
                          bp_cat |
                 High, stage II  |   3.25e+07   2.60e+07    21.65   0.000      6794686    1.56e+08
                        Unknown  |   6.53e+07          .        .       .            .           .
                                 |
                        1.asthma |   2.93e-18   2.51e-09    -0.00   1.000            0           .
   1.chronic_respiratory_disease |   1.013367   .7040563     0.02   0.985     .2596441    3.955082
       1.chronic_cardiac_disease |   .6993338   .5485025    -0.46   0.648     .1503381     3.25312
                                 |
                         dm_type |
                           T1DM  |   4.643806   3.772637     1.89   0.059     .9448359      22.824
                           T2DM  |   1.209851   .8244148     0.28   0.780     .3182053    4.599984
                     UNKNOWN_DM  |   3.04e-18   2.95e-09    -0.00   1.000            0           .
                                 |
                        1.cancer |   .6216388   .4911707    -0.60   0.547     .1321249    2.924768
         1.chronic_liver_disease |   .6340231    .501234    -0.58   0.564     .1346413    2.985602
                        1.stroke |   .7456738    .581989    -0.38   0.707      .161509    3.442715
                      1.dementia |   2.232665   1.316655     1.36   0.173     .7028293    7.092464
                   1.other_neuro |   1.284335   .7892465     0.41   0.684     .3851236    4.283085
                                 |
                          egfr60 |
                       eGFR <60  |   3.25e-17   3.27e-08    -0.00   1.000            0           .
                          1.esrf |   1.725425   1.060209     0.89   0.375     .5174457    5.753441
              1.immunosuppressed |    .967903   .5640885    -0.06   0.955     .3088562    3.033244
              1.ra_sle_psoriasis |   1.624696    1.00374     0.79   0.432      .484059    5.453129
--------------------------------------------------------------------------------------------------
                                                             Stratified by stp

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      1b.eth5     |            .            .        1             .
      2.eth5      |     -0.15327         0.29        1         0.5895
      3.eth5      |     -0.09011         0.12        1         0.7290
      4.eth5      |      0.02948         0.01        1         0.9114
      5.eth5      |     -0.04133         0.02        1         0.8847
      6.eth5      |     -0.05225         0.03        1         0.8593
      0b.male     |            .            .        1             .
      1.male      |     -0.35569         1.81        1         0.1784
      age1        |     -0.03932         0.01        1         0.9306
      age2        |     -0.23423         0.34        1         0.5612
      age3        |      0.26889         0.41        1         0.5223
      1b.imd      |            .            .        1             .
      4.imd       |      0.00511         0.00        1         0.9843
      5.imd       |      0.25997         1.22        1         0.2691
      1b.bmicat_sa|            .            .        1             .
      2.bmicat_sa |      0.53026         0.00        1         1.0000
      3.bmicat_sa |      0.29574         1.26        1         0.2609
      4.bmicat_sa |      0.55967         4.59        1         0.0322
      5.bmicat_sa |            .            .        1             .
      6.bmicat_sa |      0.45563         2.90        1         0.0883
      7.bmicat_sa |      0.59071         4.67        1         0.0308
      0b.hba1ccat |            .            .        1             .
      1.hba1ccat  |     -0.11781         0.22        1         0.6397
      2.hba1ccat  |     -0.14362         0.26        1         0.6100
      3.hba1ccat  |      0.16675         0.35        1         0.5561
      4.hba1ccat  |      0.22023         0.00        1         1.0000
      5.hba1ccat  |            .            .        1             .
      gp_consult~t|      0.21841         0.84        1         0.3586
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|     -0.16110         0.00        1         1.0000
      3.smoke_no~s|     -0.00929         0.00        1         0.9718
      0b.hyperte~n|            .            .        1             .
      1.hyperten~n|      0.40997         2.25        1         0.1334
      3b.bp_cat   |            .            .        1             .
      4.bp_cat    |      0.23998         0.82        1         0.3651
      5.bp_cat    |            .            .        1             .
      0b.asthma   |            .            .        1             .
      1.asthma    |      0.20700         0.00        1         1.0000
      0b.chronic..|            .            .        1             .
      1.~y_disease|      0.33260         1.58        1         0.2093
      0b.chronic..|            .            .        1             .
      1.~c_disease|      0.16195         0.35        1         0.5563
      0b.dm_type  |            .            .        1             .
      1.dm_type   |     -0.21603         0.53        1         0.4678
      2.dm_type   |      0.17597         0.45        1         0.5029
      3.dm_type   |      0.24330         0.00        1         1.0000
      0b.cancer   |            .            .        1             .
      1.cancer    |      0.19763         0.56        1         0.4562
      0b.chronic..|            .            .        1             .
      1.~r_disease|     -0.12864         0.22        1         0.6371
      0b.stroke   |            .            .        1             .
      1.stroke    |      0.09637         0.13        1         0.7186
      0b.dementia |            .            .        1             .
      1.dementia  |      0.16813         0.37        1         0.5418
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|      0.41919         2.80        1         0.0941
      0b.egfr60   |            .            .        1             .
      1.egfr60    |      0.19473         0.00        1         1.0000
      0b.esrf     |            .            .        1             .
      1.esrf      |     -0.21513         0.55        1         0.4578
      0b.immunos~d|            .            .        1             .
      1.immunosu~d|      0.27486         1.08        1         0.2984
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|     -0.11777         0.18        1         0.6681
      ------------+---------------------------------------------------
      global test |                     32.20       40         0.8052
      ----------------------------------------------------------------
.59

         failure _d:  tested
   analysis time _t:  (stime_tested-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id
(note: file ./output/stphplot_full_tested.svg not found)
(file ./output/stphplot_full_tested.svg written in SVG format)
positivetest
(1,189 observations deleted)

         failure _d:  positivetest
   analysis time _t:  (stime_positivetest-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Iteration 0:   log likelihood = -132.04113
Iteration 1:   log likelihood = -130.65796
Iteration 2:   log likelihood = -130.60934
Iteration 3:   log likelihood = -130.60909
Iteration 4:   log likelihood = -130.60909
Refining estimates:
Iteration 0:   log likelihood = -130.60909

Cox regression -- Breslow method for ties

No. of subjects =        6,668                  Number of obs    =       6,668
No. of failures =           15
Time at risk    =      1225918
                                                LR chi2(5)       =        2.86
Log likelihood  =   -130.60909                  Prob > chi2      =      0.7209

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .4862097   .5954829    -0.59   0.556     .0440878    5.362019
      Black  |   1.534637   1.400926     0.47   0.639     .2564298    9.184233
      Mixed  |   .4884551   .5982329    -0.59   0.559     .0442915    5.386782
      Other  |   1.557553   1.421845     0.49   0.627     .2602589    9.321375
    Unknown  |   1.514113   1.266798     0.50   0.620     .2937595    7.804131
------------------------------------------------------------------------------

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      1b.eth5     |            .            .        1             .
      2.eth5      |     -0.29051         1.27        1         0.2605
      3.eth5      |      0.01538         0.00        1         0.9525
      4.eth5      |      0.02274         0.01        1         0.9298
      5.eth5      |     -0.48902         3.59        1         0.0582
      6.eth5      |     -0.17675         0.47        1         0.4936
      ------------+---------------------------------------------------
      global test |                      6.94        5         0.2254
      ----------------------------------------------------------------
.225

         failure _d:  positivetest
   analysis time _t:  (stime_positivetest-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id
(note: file ./output/stphplot_crude_positivetest.svg not found)
(file ./output/stphplot_crude_positivetest.svg written in SVG format)

         failure _d:  positivetest
   analysis time _t:  (stime_positivetest-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id
(note: file ./output/kmplot_crude_positivetest.svg not found)
(file ./output/kmplot_crude_positivetest.svg written in SVG format)

         failure _d:  positivetest
   analysis time _t:  (stime_positivetest-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Iteration 0:   log likelihood = -132.04113
Iteration 1:   log likelihood = -127.76959
Iteration 2:   log likelihood = -127.41852
Iteration 3:   log likelihood = -127.40112
Iteration 4:   log likelihood = -127.40104
Refining estimates:
Iteration 0:   log likelihood = -127.40104

Cox regression -- Breslow method for ties

No. of subjects =        6,668                  Number of obs    =       6,668
No. of failures =           15
Time at risk    =      1225918
                                                LR chi2(9)       =        9.28
Log likelihood  =   -127.40104                  Prob > chi2      =      0.4118

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .4828901   .5916553    -0.59   0.552     .0437445    5.330559
      Black  |   1.519548   1.387917     0.46   0.647     .2536579    9.102915
      Mixed  |   .4800373   .5882061    -0.60   0.549     .0434779    5.300066
      Other  |   1.521456   1.389123     0.46   0.646     .2541521    9.108046
    Unknown  |    1.53681   1.285989     0.51   0.608     .2980866    7.923155
             |
        male |
       Male  |   .5185613   .2842985    -1.20   0.231     .1770653    1.518682
        age1 |   1.238202   .1490547     1.77   0.076     .9779661    1.567686
        age2 |   .5100197   .1870793    -1.84   0.066     .2485189    1.046681
        age3 |   4.802698   4.116357     1.83   0.067     .8952138    25.76581
------------------------------------------------------------------------------

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      1b.eth5     |            .            .        1             .
      2.eth5      |     -0.29323         1.32        1         0.2501
      3.eth5      |      0.00334         0.00        1         0.9897
      4.eth5      |      0.01685         0.00        1         0.9480
      5.eth5      |     -0.48762         3.58        1         0.0586
      6.eth5      |     -0.17689         0.47        1         0.4933
      0b.male     |            .            .        1             .
      1.male      |      0.35218         1.82        1         0.1775
      age1        |      0.53713         3.97        1         0.0462
      age2        |     -0.51657         3.39        1         0.0655
      age3        |      0.49773         2.95        1         0.0858
      ------------+---------------------------------------------------
      global test |                     13.05        9         0.1603
      ----------------------------------------------------------------
.25

         failure _d:  positivetest
   analysis time _t:  (stime_positivetest-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id
(note: file ./output/stphplot_agesex_positivetest.svg not found)
(file ./output/stphplot_agesex_positivetest.svg written in SVG format)

         failure _d:  positivetest
   analysis time _t:  (stime_positivetest-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id
(note: file ./output/kmplot_agesex_positivetest.svg not found)
(file ./output/kmplot_agesex_positivetest.svg written in SVG format)

         failure _d:  positivetest
   analysis time _t:  (stime_positivetest-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Stratified Cox regr. -- Breslow method for ties

No. of subjects =        6,668                  Number of obs    =       6,668
No. of failures =           15
Time at risk    =      1225918
                                                LR chi2(42)      =       49.58
Log likelihood  =   -72.816828                  Prob > chi2      =      0.1967

--------------------------------------------------------------------------------------------------
                              _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
---------------------------------+----------------------------------------------------------------
                            eth5 |
                    South Asian  |    .564308   .7077509    -0.46   0.648     .0482998    6.593057
                          Black  |   1.266612   1.184634     0.25   0.800     .2025508    7.920511
                          Mixed  |   .4433393   .5557821    -0.65   0.516      .037988     5.17399
                          Other  |   1.320777   1.257275     0.29   0.770     .2044337    8.533089
                        Unknown  |   1.197327   1.042874     0.21   0.836     .2171774    6.601014
                                 |
                            male |
                           Male  |   .5167331    .296258    -1.15   0.249     .1679762    1.589589
                            age1 |   1.287852   .1545122     2.11   0.035     1.017985    1.629259
                            age2 |   .4519422   .1692869    -2.12   0.034     .2168917    .9417223
                            age3 |   6.351352    5.62766     2.09   0.037     1.118544    36.06445
                                 |
                             imd |
                              4  |   .6714884   .5413929    -0.49   0.621     .1382772    3.260818
                5 most deprived  |   3.394629   2.190501     1.89   0.058     .9583528    12.02429
                                 |
                       bmicat_sa |
      Normal (18.5-24.9 / 22.9)  |   .1890204   .2768208    -1.14   0.255     .0107133    3.334997
 Overweight (25-29.9 / 23-27.4)  |   .1505541   .2191632    -1.30   0.193     .0086814    2.610931
  Obese I (30-34.9 / 27.4-32.4)  |   .2354258   .2865365    -1.19   0.235     .0216699    2.557706
Obese II (35-39.9 / 32.5- 37.4)  |    .298885   .3608663    -1.00   0.317     .0280404    3.185838
        Obese III (40+ / 37.5+)  |    .068727   .1006514    -1.83   0.067     .0038952     1.21261
                        Unknown  |   .5853855   .6833137    -0.46   0.646     .0594079    5.768191
                                 |
                        hba1ccat |
                      >=6.5-7.4  |   1.480462    1.01785     0.57   0.568     .3847494    5.696613
                      >=7.5-7.9  |   2.097484   1.774168     0.88   0.381     .3996732    11.00759
                        >=8-8.9  |   5.11e-17   6.58e-09    -0.00   1.000            0           .
                            >=9  |   6.81e-17   1.23e-08    -0.00   1.000            0           .
                        Unknown  |   8.87e-17   5.20e-08    -0.00   1.000            0           .
                                 |
                gp_consult_count |   1.054705   .1192715     0.47   0.638     .8450316    1.316405
                                 |
                    smoke_nomiss |
                         Former  |   2.40e-17   7.28e-09    -0.00   1.000            0           .
                        Current  |   3.134506   1.988301     1.80   0.072     .9041268    10.86698
                                 |
                  1.hypertension |   .5564236   .4376798    -0.75   0.456     .1190845    2.599897
                                 |
                          bp_cat |
                 High, stage II  |    5224103    4176073    19.35   0.000      1090369    2.50e+07
                        Unknown  |    9329628          .        .       .            .           .
                                 |
                        1.asthma |   3.739535   3.056767     1.61   0.107     .7534065    18.56119
   1.chronic_respiratory_disease |   .9792562    .665171    -0.03   0.975     .2586473    3.707531
       1.chronic_cardiac_disease |   1.671861   1.028995     0.84   0.404     .5003843    5.585947
                                 |
                         dm_type |
                           T1DM  |   6.907752    5.91803     2.26   0.024     1.288525    37.03229
                           T2DM  |   .6384408   .5109678    -0.56   0.575     .1330064    3.064564
                     UNKNOWN_DM  |   2.294908   2.800244     0.68   0.496     .2099569     25.0842
                                 |
                        1.cancer |   1.210253   .7621784     0.30   0.762     .3522224    4.158488
         1.chronic_liver_disease |   .6045191   .4748389    -0.64   0.522     .1296601    2.818471
                        1.stroke |   .5776521   .4625453    -0.69   0.493     .1202489    2.774928
                      1.dementia |   .2948447   .3237814    -1.11   0.266     .0342652    2.537077
                   1.other_neuro |   1.655163    1.01066     0.83   0.409     .5001362     5.47764
                                 |
                          egfr60 |
                       eGFR <60  |   4.30e-17   1.42e-08    -0.00   1.000            0           .
                          1.esrf |   2.39e-17   2.40e-09    -0.00   1.000            0           .
              1.immunosuppressed |   3.093085   1.743503     2.00   0.045     1.024681    9.336735
              1.ra_sle_psoriasis |   .4728863    .391479    -0.90   0.366     .0933447    2.395654
--------------------------------------------------------------------------------------------------
                                                             Stratified by stp

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      1b.eth5     |            .            .        1             .
      2.eth5      |     -0.26004         1.11        1         0.2926
      3.eth5      |      0.00997         0.00        1         0.9685
      4.eth5      |     -0.00881         0.00        1         0.9717
      5.eth5      |     -0.50815         3.90        1         0.0483
      6.eth5      |     -0.18721         0.65        1         0.4192
      0b.male     |            .            .        1             .
      1.male      |      0.24736         1.31        1         0.2533
      age1        |      0.55810         3.07        1         0.0796
      age2        |     -0.49773         2.49        1         0.1144
      age3        |      0.46250         2.11        1         0.1464
      1b.imd      |            .            .        1             .
      4.imd       |      0.37271         1.52        1         0.2176
      5.imd       |      0.17435         0.31        1         0.5751
      1b.bmicat_sa|            .            .        1             .
      2.bmicat_sa |      0.02818         0.01        1         0.9145
      3.bmicat_sa |      0.00415         0.00        1         0.9860
      4.bmicat_sa |     -0.22613         0.88        1         0.3491
      5.bmicat_sa |      0.00466         0.00        1         0.9855
      6.bmicat_sa |      0.02511         0.01        1         0.9143
      7.bmicat_sa |     -0.23773         0.90        1         0.3437
      0b.hba1ccat |            .            .        1             .
      1.hba1ccat  |     -0.20901         0.90        1         0.3435
      2.hba1ccat  |      0.14827         0.45        1         0.5021
      3.hba1ccat  |     -0.38405         0.00        1         1.0000
      4.hba1ccat  |      0.23528         0.00        1         1.0000
      5.hba1ccat  |      0.38575         0.00        1         1.0000
      gp_consult~t|     -0.05032         0.04        1         0.8511
      1b.smoke_n~s|            .            .        1             .
      2.smoke_no~s|      0.24675         0.00        1         1.0000
      3.smoke_no~s|     -0.20201         0.67        1         0.4114
      0b.hyperte~n|            .            .        1             .
      1.hyperten~n|      0.14549         0.33        1         0.5654
      3b.bp_cat   |            .            .        1             .
      4.bp_cat    |     -0.06414         0.07        1         0.7873
      5.bp_cat    |            .            .        1             .
      0b.asthma   |            .            .        1             .
      1.asthma    |      0.28813         1.50        1         0.2213
      0b.chronic..|            .            .        1             .
      1.~y_disease|     -0.17967         0.48        1         0.4863
      0b.chronic..|            .            .        1             .
      1.~c_disease|      0.00030         0.00        1         0.9992
      0b.dm_type  |            .            .        1             .
      1.dm_type   |      0.20258         0.75        1         0.3860
      2.dm_type   |     -0.04997         0.03        1         0.8551
      3.dm_type   |     -0.22940         0.92        1         0.3376
      0b.cancer   |            .            .        1             .
      1.cancer    |      0.31897         1.88        1         0.1705
      0b.chronic..|            .            .        1             .
      1.~r_disease|     -0.05180         0.04        1         0.8434
      0b.stroke   |            .            .        1             .
      1.stroke    |     -0.67914         7.41        1         0.0065
      0b.dementia |            .            .        1             .
      1.dementia  |      0.25691         1.23        1         0.2667
      0b.other_n~o|            .            .        1             .
      1.other_ne~o|      0.14932         0.36        1         0.5505
      0b.egfr60   |            .            .        1             .
      1.egfr60    |      0.06581         0.00        1         1.0000
      0b.esrf     |            .            .        1             .
      1.esrf      |      0.14897         0.00        1         1.0000
      0b.immunos~d|            .            .        1             .
      1.immunosu~d|      0.25490         0.79        1         0.3750
      0b.ra_sle_~s|            .            .        1             .
      1.ra_sle_p~s|      0.13772         0.34        1         0.5599
      ------------+---------------------------------------------------
      global test |                     37.59       42         0.6646
      ----------------------------------------------------------------
.293

         failure _d:  positivetest
   analysis time _t:  (stime_positivetest-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id
(note: file ./output/stphplot_full_positivetest.svg not found)
(file ./output/stphplot_full_positivetest.svg written in SVG format)
icu
(1,189 observations deleted)

         failure _d:  icu
   analysis time _t:  (stime_icu-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Iteration 0:   log likelihood = -140.84471
Iteration 1:   log likelihood = -137.64602
Iteration 2:   log likelihood = -137.51473
Iteration 3:   log likelihood = -137.51411
Iteration 4:   log likelihood = -137.51411
Refining estimates:
Iteration 0:   log likelihood = -137.51411

Cox regression -- Breslow method for ties

No. of subjects =        6,668                  Number of obs    =       6,668
No. of failures =           16
Time at risk    =      1199351
                                                LR chi2(5)       =        6.66
Log likelihood  =   -137.51411                  Prob > chi2      =      0.2471

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .4859836   .5952059    -0.59   0.556     .0440673    5.359525
      Black  |   .5110703   .6259308    -0.55   0.584     .0463421    5.636187
      Mixed  |   .4884138   .5981823    -0.59   0.558     .0442877    5.386327
      Other  |   1.556956     1.4213     0.48   0.628     .2601593    9.317805
    Unknown  |   2.423358   1.915833     1.12   0.263     .5146165    11.41173
------------------------------------------------------------------------------

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      1b.eth5     |            .            .        1             .
      2.eth5      |      0.05139         0.04        1         0.8372
      3.eth5      |      0.14210         0.32        1         0.5698
      4.eth5      |      0.04535         0.03        1         0.8561
      5.eth5      |     -0.09321         0.14        1         0.7093
      6.eth5      |     -0.04326         0.03        1         0.8626
      ------------+---------------------------------------------------
      global test |                      1.04        5         0.9594
      ----------------------------------------------------------------
.959

         failure _d:  icu
   analysis time _t:  (stime_icu-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id
(note: file ./output/stphplot_crude_icu.svg not found)
(file ./output/stphplot_crude_icu.svg written in SVG format)

         failure _d:  icu
   analysis time _t:  (stime_icu-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id
(note: file ./output/kmplot_crude_icu.svg not found)
(file ./output/kmplot_crude_icu.svg written in SVG format)

         failure _d:  icu
   analysis time _t:  (stime_icu-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id

Iteration 0:   log likelihood = -140.84471
Iteration 1:   log likelihood = -137.18743
Iteration 2:   log likelihood = -137.04123
Iteration 3:   log likelihood = -137.04061
Iteration 4:   log likelihood = -137.04061
Refining estimates:
Iteration 0:   log likelihood = -137.04061

Cox regression -- Breslow method for ties

No. of subjects =        6,668                  Number of obs    =       6,668
No. of failures =           16
Time at risk    =      1199351
                                                LR chi2(9)       =        7.61
Log likelihood  =   -137.04061                  Prob > chi2      =      0.5741

------------------------------------------------------------------------------
          _t | Haz. Ratio   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        eth5 |
South Asian  |   .4837033    .592512    -0.59   0.553      .043843    5.336514
      Black  |   .5173683   .6337603    -0.54   0.591     .0468926    5.708154
      Mixed  |   .4916527   .6022465    -0.58   0.562     .0445641     5.42415
      Other  |   1.545019   1.410587     0.48   0.634     .2581043    9.248526
    Unknown  |   2.457747   1.943666     1.14   0.256     .5216502    11.57963
             |
        male |
       Male  |   1.050702   .5257246     0.10   0.921     .3940724    2.801451
        age1 |   .9779752   .0683124    -0.32   0.750     .8528462    1.121463
        age2 |   1.074604   .2816472     0.27   0.784     .6429154    1.796153
        age3 |   .8839057   .5735636    -0.19   0.849     .2477787    3.153174
------------------------------------------------------------------------------

      Test of proportional-hazards assumption

      Time:  Time
      ----------------------------------------------------------------
                  |       rho            chi2       df       Prob>chi2
      ------------+---------------------------------------------------
      1b.eth5     |            .            .        1             .
      2.eth5      |      0.05441         0.05        1         0.8281
      3.eth5      |      0.14312         0.32        1         0.5691
      4.eth5      |      0.04878         0.04        1         0.8453
      5.eth5      |     -0.09571         0.15        1         0.7012
      6.eth5      |     -0.04525         0.03        1         0.8565
      0b.male     |            .            .        1             .
      1.male      |      0.06977         0.08        1         0.7826
      age1        |     -0.10019         0.12        1         0.7260
      age2        |      0.22386         0.62        1         0.4308
      age3        |     -0.26030         0.85        1         0.3552
      ------------+---------------------------------------------------
      global test |                      3.08        9         0.9611
      ----------------------------------------------------------------
.828

         failure _d:  icu
   analysis time _t:  (stime_icu-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id
(note: file ./output/stphplot_agesex_icu.svg not found)
(file ./output/stphplot_agesex_icu.svg written in SVG format)

         failure _d:  icu
   analysis time _t:  (stime_icu-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id
(note: file ./output/kmplot_agesex_icu.svg not found)
(file ./output/kmplot_agesex_icu.svg written in SVG format)

         failure _d:  icu
   analysis time _t:  (stime_icu-origin)
             origin:  time indexdate
  enter on or after:  time indexdate
                 id:  patient_id
