---------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/lsh152058/Documents/GitHub/ethnicity-covid-research/output/log/01_eth_cr_create_analy
> sis_dataset.log
  log type:  text
 opened on:  13 Jul 2020, 21:11:56

. 
. 
. di "STARTING COUNT FROM IMPORT:"
STARTING COUNT FROM IMPORT:

. cou
  100,000

. 
. 
. **************************   INPUT REQUIRED   *********************************
. 
. * Censoring dates for each outcome (largely, last date outcome data available)
. global tppcensor                        = "31/07/2020"  //primary care suspected and confirmed covid

. global sgsscensor                       = "31/07/2020"  //testing data

. global ecdscensor                       = "31/07/2020"  //A&E admission

. global inarccensor                      = "31/07/2020"  //ICU admission and ventilation

. global cpnscensor                       = "31/07/2020"  //in-hospital death

. global onscensor                        = "31/07/2020"  //all death

. 
. *Start dates
. global indexdate                        = "01/02/2020"

. 
. 
. *******************************************************************************
. 
. 
. 
. /* CREATE VARIABLES===========================================================*/
. 
. /* DEMOGRAPHICS */ 
. 
. * Ethnicity (5 category)
. replace ethnicity = . if ethnicity==.
(0 real changes made)

. label define ethnicity  1 "White"                                       ///
>                                                 2 "Mixed"                                       ///
>                                                 3 "Asian or Asian British"      ///
>                                                 4 "Black"                                       ///
>                                                 5 "Other"                                       

.                                                 
. label values ethnicity ethnicity

. tab ethnicity

             ethnicity |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |     60,086       80.11       80.11
                 Mixed |      3,842        5.12       85.24
Asian or Asian British |      3,633        4.84       90.08
                 Black |      3,774        5.03       95.11
                 Other |      3,665        4.89      100.00
-----------------------+-----------------------------------
                 Total |     75,000      100.00

. 
. * Ethnicity (16 category)
. replace ethnicity_16 = . if ethnicity==.
(18,871 real changes made, 18,871 to missing)

. label define ethnicity_16                                                                       ///
>                                                 1 "British or Mixed British"            ///
>                                                 2 "Irish"                                              
>          ///
>                                                 3 "Other White"                                        
>  ///
>                                                 4 "White + Black Caribbean"             ///
>                                                 5 "White + Black African"                       ///
>                                                 6 "White + Asian"                                      
>  ///
>                                                 7 "Other mixed"                                        
>  ///
>                                                 8 "Indian or British Indian"            ///
>                                                 9 "Pakistani or British Pakistani"      ///
>                                                 10 "Bangladeshi or British Bangladeshi" ///
>                                                 11 "Other Asian"                                       
>  ///
>                                                 12 "Caribbean"                                         
>  ///
>                                                 13 "African"                                           
>  ///
>                                                 14 "Other Black"                                       
>  ///
>                                                 15 "Chinese"                                           
>  ///
>                                                 16 "Other"                                             
>          

.                                                 
. label values ethnicity_16 ethnicity_16

. tab ethnicity_16,m

                      ethnicity_16 |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
          British or Mixed British |     28,227       28.23       28.23
                             Irish |      5,637        5.64       33.86
                       Other White |      2,690        2.69       36.55
           White + Black Caribbean |      2,810        2.81       39.36
             White + Black African |      2,739        2.74       42.10
                     White + Asian |      2,853        2.85       44.96
                       Other mixed |      2,773        2.77       47.73
          Indian or British Indian |      2,773        2.77       50.50
    Pakistani or British Pakistani |      1,194        1.19       51.70
Bangladeshi or British Bangladeshi |      1,149        1.15       52.85
                       Other Asian |        522        0.52       53.37
                         Caribbean |        526        0.53       53.89
                           African |        565        0.56       54.46
                       Other Black |        548        0.55       55.01
                           Chinese |        574        0.57       55.58
                             Other |        549        0.55       56.13
                                 . |     43,871       43.87      100.00
-----------------------------------+-----------------------------------
                             Total |    100,000      100.00

. 
. 
. * Ethnicity (16 category grouped further)
. * Generate a version of the full breakdown with mixed in one group
. gen eth16 = ethnicity_16
(43,871 missing values generated)

. recode eth16 4/7 = 99
(eth16: 11175 changes made)

. recode eth16 11 = 16
(eth16: 522 changes made)

. recode eth16 14 = 16
(eth16: 548 changes made)

. recode eth16 8 = 4
(eth16: 2773 changes made)

. recode eth16 9 = 5
(eth16: 1194 changes made)

. recode eth16 10 = 6
(eth16: 1149 changes made)

. recode eth16 12 = 7
(eth16: 526 changes made)

. recode eth16 13 = 8
(eth16: 565 changes made)

. recode eth16 15 = 9
(eth16: 574 changes made)

. recode eth16 16 = 11
(eth16: 1619 changes made)

. recode eth16 99 = 10
(eth16: 11175 changes made)

. 
. 
. label define eth16      ///
>                                                 1 "British or Mixed British" ///
>                                                 2 "Irish" ///
>                                                 3 "Other White" ///
>                                                 4 "Indian" ///
>                                                 5 "Pakistani" ///
>                                                 6 "Bangladeshi" ///                                    
>  
>                                                 7 "Caribbean" ///
>                                                 8 "African" ///
>                                                 9 "Chinese" ///
>                                                 10 "All mixed" ///
>                                                 11 "All Other" ///
>                                                 .u "Unknown"  

. label values eth16 eth16

. 
. * STP 
. rename stp stp_old

. bysort stp_old: gen stp = 1 if _n==1
(99,990 missing values generated)

. replace stp = sum(stp)
(99,999 real changes made)

. drop stp_old

. 
. /*  IMD  */
. * Group into 5 groups
. rename imd imd_o

. egen imd = cut(imd_o), group(5) icodes

. 
. * add one to create groups 1 - 5 
. replace imd = imd + 1
(100,000 real changes made)

. 
. * - 1 is missing, should be excluded from population 
. replace imd = .u if imd_o == -1
(0 real changes made)

. drop imd_o

. 
. * Reverse the order (so high is more deprived)
. recode imd 5 = 1 4 = 2 3 = 3 2 = 4 1 = 5 .u = .u
(imd: 100000 changes made)

. 
. label define imd 1 "1 least deprived" 2 "2" 3 "3" 4 "4" 5 "5 most deprived" .u "Unknown"

. label values imd imd 

. 
. /*  Age variables  */ 
. 
. * Create categorised age 
. recode age      0/17.9999=0 ///
>                         18/29.9999 = 1 /// 
>                     30/39.9999 = 2 /// 
>                         40/49.9999 = 3 ///
>                         50/59.9999 = 4 ///
>                         60/69.9999 = 5 ///
>                         70/79.9999 = 6 ///
>                         80/max = 7, gen(agegroup) 
(98829 differences between age and agegroup)

. 
. label define agegroup   0 "0-<18" ///
>                                                 1 "18-<30" ///
>                                                 2 "30-<40" ///
>                                                 3 "40-<50" ///
>                                                 4 "50-<60" ///
>                                                 5 "60-<70" ///
>                                                 6 "70-<80" ///
>                                                 7 "80+"

.                                                 
. label values agegroup agegroup

. 
. 
. 
. 
. 
. 
. **************************** HOUSEHOLD VARS*******************************************
. 
. 
. *Total number people in household (to check hh size)
. bysort hh_id: gen hh_total=_N

. 
. 
. ****************************
. *  Create required cohort  *
. ****************************
. 
. /* DROP ALL KIDS, AS HH COMPOSITION VARS ARE NOW MADE */
. noi di "DROPPING AGE<18:" 
DROPPING AGE<18:

. drop if age<18
(21,357 observations deleted)

. 
. 
. * Age: Exclude those with implausible ages
. cap assert age<.

. noi di "DROPPING AGE<105:" 
DROPPING AGE<105:

. drop if age>105
(14 observations deleted)

. 
. * Sex: Exclude categories other than M and F
. cap assert inlist(sex, "M", "F", "I", "U")

. noi di "DROPPING GENDER NOT M/F:" 
DROPPING GENDER NOT M/F:

. drop if inlist(sex, "I", "U")
(0 observations deleted)

. 
. 
. gen male = 1 if sex == "M"
(40,348 missing values generated)

. replace male = 0 if sex == "F"
(40,348 real changes made)

. label define male 0"Female" 1"Male"

. label values male male

. tab male

       male |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |     40,348       51.31       51.31
       Male |     38,281       48.69      100.00
------------+-----------------------------------
      Total |     78,629      100.00

. 
. 
. * Create binary age (for age stratification)
. recode age min/65.999999999 = 0 ///
>            66/max = 1, gen(age66)
(78629 differences between age and age66)

. 
. * Check there are no missing ages
. cap assert age < .

. cap assert agegroup < .

. cap assert age66 < .

. 
. * Create restricted cubic splines for age
. mkspline age = age, cubic nknots(4)

. 
. 
. /* CONVERT STRINGS TO DATE====================================================*/
. /* Comorb dates dates are given with month only, so adding day 
> 15 to enable  them to be processed as dates                       */
. 
. *cr date for diabetes based on adjudicated type
. gen diabetes=type1_diabetes if diabetes_type=="T1DM"
(78,188 missing values generated)

. replace diabetes=type2_diabetes if diabetes_type=="T2DM"
(3,272 real changes made)

. replace diabetes=unknown_diabetes if diabetes_type=="UNKNOWN_DM"
(288 real changes made)

. 
. 
. 
. foreach var of varlist  chronic_respiratory_disease ///
>                                                 chronic_cardiac_disease  ///
>                                                 cancer  ///
>                                                 permanent_immunodeficiency  ///
>                                                 temporary_immunodeficiency  ///
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke                  ///
>                                                 dementia ///
>                                                 esrf  ///
>                                                 hypertension  ///
>                                                 asthma ///
>                                                 ra_sle_psoriasis  ///
>                                                 diabetes ///
>                                                 type1_diabetes ///
>                                                 type2_diabetes ///
>                                                 unknown_diabetes ///
>                                                 bmi_date_measured   ///
>                                                 bp_sys_date_measured   ///
>                                                 bp_dias_date_measured   ///
>                                                 creatinine_date  ///
>                                                 hba1c_mmol_per_mol_date  ///
>                                                 hba1c_percentage_date ///
>                                                 smoking_status_date ///
>                                                 insulin ///
>                                                 statin ///
>                                                 ace_inhibitors ///
>                                                 arbs ///
>                                                 alpha_blockers ///
>                                                 betablockers ///
>                                                 calcium_channel_blockers ///
>                                                 combination_bp_meds ///
>                                                 spironolactone  ///
>                                                 thiazide_diuretics ///                                 
>          
>                                                 {
  2.                                                         
.                 capture confirm string variable `var'
  3.                 if _rc!=0 {
  4.                         cap assert `var'==.
  5.                         rename `var' `var'_date
  6.                 }
  7.         
.                 else {
  8.                                 replace `var' = `var' + "-15"
  9.                                 rename `var' `var'_dstr
 10.                                 replace `var'_dstr = " " if `var'_dstr == "-15"
 11.                                 gen `var'_date = date(`var'_dstr, "YMD") 
 12.                                 order `var'_date, after(`var'_dstr)
 13.                                 drop `var'_dstr
 14.                 }
 15.         
.         format `var'_date %td
 16. }
variable chronic_respiratory_disease was str7 now str10
(78,629 real changes made)
(62,948 real changes made)
(62,948 missing values generated)
variable chronic_cardiac_disease was str7 now str10
(78,629 real changes made)
(62,935 real changes made)
(62,935 missing values generated)
variable cancer was str7 now str10
(78,629 real changes made)
(62,922 real changes made)
(62,922 missing values generated)
variable permanent_immunodeficiency was str7 now str10
(78,629 real changes made)
(63,016 real changes made)
(63,016 missing values generated)
variable temporary_immunodeficiency was str7 now str10
(78,629 real changes made)
(62,790 real changes made)
(62,790 missing values generated)
variable chronic_liver_disease was str7 now str10
(78,629 real changes made)
(62,871 real changes made)
(62,871 missing values generated)
variable other_neuro was str7 now str10
(78,629 real changes made)
(62,865 real changes made)
(62,865 missing values generated)
variable stroke was str7 now str10
(78,629 real changes made)
(62,924 real changes made)
(62,924 missing values generated)
variable dementia was str7 now str10
(78,629 real changes made)
(62,895 real changes made)
(62,895 missing values generated)
variable esrf was str7 now str10
(78,629 real changes made)
(62,971 real changes made)
(62,971 missing values generated)
variable hypertension was str7 now str10
(78,629 real changes made)
(62,948 real changes made)
(62,948 missing values generated)
variable asthma was str7 now str10
(78,629 real changes made)
(62,886 real changes made)
(62,886 missing values generated)
variable ra_sle_psoriasis was str7 now str10
(78,629 real changes made)
(62,901 real changes made)
(62,901 missing values generated)
variable diabetes was str7 now str10
(78,629 real changes made)
(74,628 real changes made)
(74,628 missing values generated)
variable type1_diabetes was str7 now str10
(78,629 real changes made)
(63,091 real changes made)
(63,091 missing values generated)
variable type2_diabetes was str7 now str10
(78,629 real changes made)
(63,011 real changes made)
(63,011 missing values generated)
variable unknown_diabetes was str7 now str10
(78,629 real changes made)
(63,022 real changes made)
(63,022 missing values generated)
variable bmi_date_measured was str7 now str10
(78,629 real changes made)
(3,918 real changes made)
(3,918 missing values generated)
variable bp_sys_date_measured was str7 now str10
(78,629 real changes made)
(3,997 real changes made)
(3,997 missing values generated)
variable bp_dias_date_measured was str7 now str10
(78,629 real changes made)
(3,925 real changes made)
(3,925 missing values generated)
variable creatinine_date was str7 now str10
(78,629 real changes made)
(3,966 real changes made)
(3,966 missing values generated)
variable hba1c_mmol_per_mol_date was str7 now str10
(78,629 real changes made)
(3,879 real changes made)
(3,879 missing values generated)
variable hba1c_percentage_date was str7 now str10
(78,629 real changes made)
(3,930 real changes made)
(3,930 missing values generated)
variable smoking_status_date was str7 now str10
(78,629 real changes made)
(63,026 real changes made)
(63,026 missing values generated)
variable insulin was str7 now str10
(78,629 real changes made)
(62,945 real changes made)
(62,945 missing values generated)
variable statin was str7 now str10
(78,629 real changes made)
(62,949 real changes made)
(62,949 missing values generated)

. 
. * Note - outcome dates are handled separtely below 
. 
. * Some names too long for loops below, shorten
. rename permanent_immunodeficiency_date  perm_immunodef_date

. rename temporary_immunodeficiency_date  temp_immunodef_date

. rename bmi_date_measured_date                   bmi_measured_date

. 
. /* CREATE BINARY VARIABLES====================================================*/
. *  Make indicator variables for all conditions where relevant 
. 
. foreach var of varlist  chronic_respiratory_disease ///
>                                                 chronic_cardiac_disease  ///
>                                                 cancer  ///
>                                                 perm_immunodef  ///
>                                                 temp_immunodef  ///
>                                                 chronic_liver_disease  ///
>                                                 other_neuro  ///
>                                                 stroke                  ///
>                                                 dementia ///
>                                                 esrf  ///
>                                                 hypertension  ///
>                                                 asthma ///
>                                                 ra_sle_psoriasis  ///
>                                                 type1_diabetes ///
>                                                 type2_diabetes ///
>                                                 unknown_diabetes ///
>                                                 bmi_measured_date   ///
>                                                 bp_sys_date_measured   ///
>                                                 bp_dias_date_measured   ///
>                                                 creatinine_date  ///
>                                                 hba1c_mmol_per_mol_date  ///
>                                                 hba1c_percentage_date ///
>                                                 smoking_status_date ///
>                                                 insulin ///
>                                                 statin ///
>                                                 ace_inhibitors ///
>                                                 arbs ///
>                                                 alpha_blockers ///
>                                                 betablockers ///
>                                                 calcium_channel_blockers ///
>                                                 combination_bp_meds ///
>                                                 spironolactone  ///
>                                                 thiazide_diuretics ///                                 
>          
>                                                 {
  2.                                                 
.         /* date ranges are applied in python, so presence of date indicates presence of 
>           disease in the correct time frame */ 
.         local newvar =  substr("`var'", 1, length("`var'") - 5)
  3.         gen `newvar' = (`var'!=. )
  4.         order `newvar', after(`var')
  5.         tab `newvar'
  6.         
. }

chronic_res |
piratory_di |
      sease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     62,948       80.06       80.06
          1 |     15,681       19.94      100.00
------------+-----------------------------------
      Total |     78,629      100.00

chronic_car |
diac_diseas |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     62,935       80.04       80.04
          1 |     15,694       19.96      100.00
------------+-----------------------------------
      Total |     78,629      100.00

     cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     62,922       80.02       80.02
          1 |     15,707       19.98      100.00
------------+-----------------------------------
      Total |     78,629      100.00

perm_immuno |
        def |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,016       80.14       80.14
          1 |     15,613       19.86      100.00
------------+-----------------------------------
      Total |     78,629      100.00

temp_immuno |
        def |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     62,790       79.86       79.86
          1 |     15,839       20.14      100.00
------------+-----------------------------------
      Total |     78,629      100.00

chronic_liv |
 er_disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     62,871       79.96       79.96
          1 |     15,758       20.04      100.00
------------+-----------------------------------
      Total |     78,629      100.00

other_neuro |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     62,865       79.95       79.95
          1 |     15,764       20.05      100.00
------------+-----------------------------------
      Total |     78,629      100.00

     stroke |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     62,924       80.03       80.03
          1 |     15,705       19.97      100.00
------------+-----------------------------------
      Total |     78,629      100.00

   dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     62,895       79.99       79.99
          1 |     15,734       20.01      100.00
------------+-----------------------------------
      Total |     78,629      100.00

       esrf |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     62,971       80.09       80.09
          1 |     15,658       19.91      100.00
------------+-----------------------------------
      Total |     78,629      100.00

hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     62,948       80.06       80.06
          1 |     15,681       19.94      100.00
------------+-----------------------------------
      Total |     78,629      100.00

     asthma |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     62,886       79.98       79.98
          1 |     15,743       20.02      100.00
------------+-----------------------------------
      Total |     78,629      100.00

ra_sle_psor |
      iasis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     62,901       80.00       80.00
          1 |     15,728       20.00      100.00
------------+-----------------------------------
      Total |     78,629      100.00

type1_diabe |
        tes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,091       80.24       80.24
          1 |     15,538       19.76      100.00
------------+-----------------------------------
      Total |     78,629      100.00

type2_diabe |
        tes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,011       80.14       80.14
          1 |     15,618       19.86      100.00
------------+-----------------------------------
      Total |     78,629      100.00

unknown_dia |
      betes |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,022       80.15       80.15
          1 |     15,607       19.85      100.00
------------+-----------------------------------
      Total |     78,629      100.00

bmi_measure |
          d |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,918        4.98        4.98
          1 |     74,711       95.02      100.00
------------+-----------------------------------
      Total |     78,629      100.00

bp_sys_date |
  _measured |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,997        5.08        5.08
          1 |     74,632       94.92      100.00
------------+-----------------------------------
      Total |     78,629      100.00

bp_dias_dat |
 e_measured |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,925        4.99        4.99
          1 |     74,704       95.01      100.00
------------+-----------------------------------
      Total |     78,629      100.00

creatinine_ |
       date |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,966        5.04        5.04
          1 |     74,663       94.96      100.00
------------+-----------------------------------
      Total |     78,629      100.00

hba1c_mmol_ |
per_mol_dat |
          e |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,879        4.93        4.93
          1 |     74,750       95.07      100.00
------------+-----------------------------------
      Total |     78,629      100.00

hba1c_perce |
 ntage_date |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      3,930        5.00        5.00
          1 |     74,699       95.00      100.00
------------+-----------------------------------
      Total |     78,629      100.00

smoking_sta |
   tus_date |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     63,026       80.16       80.16
          1 |     15,603       19.84      100.00
------------+-----------------------------------
      Total |     78,629      100.00

    insulin |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     62,945       80.05       80.05
          1 |     15,684       19.95      100.00
------------+-----------------------------------
      Total |     78,629      100.00

     statin |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     62,949       80.06       80.06
          1 |     15,680       19.94      100.00
------------+-----------------------------------
      Total |     78,629      100.00

ace_inhibit |
        ors |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     55,027       69.98       69.98
          1 |     23,602       30.02      100.00
------------+-----------------------------------
      Total |     78,629      100.00

       arbs |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     54,997       69.94       69.94
          1 |     23,632       30.06      100.00
------------+-----------------------------------
      Total |     78,629      100.00

alpha_block |
        ers |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     55,031       69.99       69.99
          1 |     23,598       30.01      100.00
------------+-----------------------------------
      Total |     78,629      100.00

betablocker |
          s |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     55,184       70.18       70.18
          1 |     23,445       29.82      100.00
------------+-----------------------------------
      Total |     78,629      100.00

calcium_cha |
nnel_blocke |
         rs |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     54,993       69.94       69.94
          1 |     23,636       30.06      100.00
------------+-----------------------------------
      Total |     78,629      100.00

combination |
   _bp_meds |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     55,039       70.00       70.00
          1 |     23,590       30.00      100.00
------------+-----------------------------------
      Total |     78,629      100.00

spironolact |
        one |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     55,021       69.98       69.98
          1 |     23,608       30.02      100.00
------------+-----------------------------------
      Total |     78,629      100.00

thiazide_di |
    uretics |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     55,096       70.07       70.07
          1 |     23,533       29.93      100.00
------------+-----------------------------------
      Total |     78,629      100.00

. 
. 
. /*  Body Mass Index  */
. * NB: watch for missingness
. 
. * Recode strange values 
. replace bmi = . if bmi == 0 
(0 real changes made)

. replace bmi = . if !inrange(bmi, 15, 50)
(6,622 real changes made, 6,622 to missing)

. 
. * Restrict to within 10 years of index and aged > 16 
. gen bmi_time = (date("$indexdate", "DMY") - bmi_measured_date)/365.25
(3,918 missing values generated)

. gen bmi_age = age - bmi_time
(3,918 missing values generated)

. 
. replace bmi = . if bmi_age < 16 
(26,157 real changes made, 26,157 to missing)

. replace bmi = . if bmi_time > 10 & bmi_time != . 
(28,611 real changes made, 28,611 to missing)

. 
. * Set to missing if no date, and vice versa 
. replace bmi = . if bmi_measured_date == . 
(0 real changes made)

. replace bmi_measured_date = . if bmi == . 
(61,390 real changes made, 61,390 to missing)

. replace bmi_measured = . if bmi == . 
(65,308 real changes made, 65,308 to missing)

. 
. * BMI (NB: watch for missingness)
. gen     bmicat = .
(78,629 missing values generated)

. recode  bmicat . = 1 if bmi<18.5
(bmicat: 379 changes made)

. recode  bmicat . = 2 if bmi<25
(bmicat: 1616 changes made)

. recode  bmicat . = 3 if bmi<30
(bmicat: 2265 changes made)

. recode  bmicat . = 4 if bmi<35
(bmicat: 2765 changes made)

. recode  bmicat . = 5 if bmi<40
(bmicat: 2781 changes made)

. recode  bmicat . = 6 if bmi<.
(bmicat: 3515 changes made)

. replace bmicat = .u if bmi>=.
(65,308 real changes made, 65,308 to missing)

. 
. label define bmicat 1 "Underweight (<18.5)"     ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                     ///
>                                         .u "Unknown (.u)"

. label values bmicat bmicat

. 
. * Create more granular categorisation
. recode bmicat 1/3 .u = 1 4=2 5=3 6=4, gen(obese4cat)
(78250 differences between bmicat and obese4cat)

. 
. label define obese4cat  1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9)"           ///
>                                                 3 "Obese II (35-39.9)"          ///
>                                                 4 "Obese III (40+)"             

. label values obese4cat obese4cat

. order obese4cat, after(bmicat)

. 
. 
. 
. **generate BMI categories for south asians
. *https://www.nice.org.uk/guidance/ph46/chapter/1-Recommendations#recommendation-2-bmi-assessment-multi-
> component-interventions-and-best-practice-standards
. 
. gen bmicat_sa=bmicat
(65,308 missing values generated)

. replace bmicat_sa = 2 if bmi>=18.5 & bmi <23 & ethnicity  ==3
(0 real changes made)

. replace bmicat_sa = 3 if bmi>=23 & bmi < 27.5 & ethnicity ==3
(30 real changes made)

. replace bmicat_sa = 4 if bmi>=27.5 & bmi < 35 & ethnicity ==3
(36 real changes made)

. tab bmicat_sa

  bmicat_sa |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        379        2.85        2.85
          2 |      1,586       11.91       14.75
          3 |      2,259       16.96       31.71
          4 |      2,801       21.03       52.74
          5 |      2,781       20.88       73.61
          6 |      3,515       26.39      100.00
------------+-----------------------------------
      Total |     13,321      100.00

. 
. label define bmicat_sa 1 "Underweight (<18.5)"  ///
>                                         2 "Normal (18.5-24.9 / 22.9)"           ///
>                                         3 "Overweight (25-29.9 / 23-27.4)"      ///
>                                         4 "Obese I (30-34.9 / 27.4-34.9)"               ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                     ///
>                                         .u "Unknown (.u)"

. label values bmicat bmicat

. 
. * Create more granular categorisation
. recode bmicat_sa 1/3 .u = 1 4=2 5=3 6=4, gen(obese4cat_sa)
(78250 differences between bmicat_sa and obese4cat_sa)

. 
. label define obese4cat_sa       1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9 / 27.5-34.9)"               ///
>                                                 3 "Obese II (35-39.9)"          ///
>                                                 4 "Obese III (40+)"             

. label values obese4cat_sa obese4cat_sa

. order obese4cat_sa, after(bmicat_sa)

. 
. 
. /*  Smoking  */
. 
. * Smoking 
. label define smoke 1 "Never" 2 "Former" 3 "Current" .u "Unknown (.u)"

. 
. gen     smoke = 1  if smoking_status == "N"
(75,440 missing values generated)

. replace smoke = 2  if smoking_status == "E"
(1,588 real changes made)

. replace smoke = 3  if smoking_status == "S"
(9,429 real changes made)

. replace smoke = .u if smoking_status == "M"
(1,547 real changes made, 1,547 to missing)

. replace smoke = .u if smoking_status == "" 
(62,876 real changes made, 62,876 to missing)

. 
. label values smoke smoke

. drop smoking_status

. 
. * Create non-missing 3-category variable for current smoking
. * Assumes missing smoking is never smoking 
. recode smoke .u = 1, gen(smoke_nomiss)
(64423 differences between smoke and smoke_nomiss)

. order smoke_nomiss, after(smoke)

. label values smoke_nomiss smoke

. 
. /* CLINICAL COMORBIDITIES */ 
. 
. /*  Cancer */
. label define cancer 1 "Never" 2 "Last year" 3 "2-5 years ago" 4 "5+ years"

. 
. * malignancies
. gen     cancer_cat = 4 if inrange(cancer_date, d(1/1/1900), d(1/2/2015))
(64,511 missing values generated)

. replace cancer_cat = 3 if inrange(cancer_date, d(1/2/2015), d(1/2/2019))
(1,278 real changes made)

. replace cancer_cat = 2 if inrange(cancer_date, d(1/2/2019), d(1/2/2020))
(311 real changes made)

. recode  cancer_cat . = 1
(cancer_cat: 62922 changes made)

. label values cancer_cat cancer

. 
. 
. 
. 
. /*  Immunosuppression  */
. 
. * Immunosuppressed:
. * Permanent immunodeficiency ever, OR 
. * Temporary immunodeficiency  last year
. gen temp1  = 1 if perm_immunodef_date!=.
(63,016 missing values generated)

. gen temp2  = inrange(temp_immunodef_date, (date("$indexdate", "DMY") - 365), date("$indexdate", "DMY"))

. 
. egen other_immuno = rowmax(temp1 temp2)

. drop temp1 temp2 

. order other_immuno, after(temp_immunodef)

. 
. /*  Blood pressure   */
. 
. * Categorise
. gen     bpcat = 1 if bp_sys < 120 &  bp_dias < 80
(78,628 missing values generated)

. replace bpcat = 2 if inrange(bp_sys, 120, 130) & bp_dias<80
(0 real changes made)

. replace bpcat = 3 if inrange(bp_sys, 130, 140) | inrange(bp_dias, 80, 90)
(101 real changes made)

. replace bpcat = 4 if (bp_sys>=140 & bp_sys<.) | (bp_dias>=90 & bp_dias<.) 
(74,602 real changes made)

. replace bpcat = .u if bp_sys>=. | bp_dias>=. | bp_sys==0 | bp_dias==0
(7,740 real changes made, 7,740 to missing)

. 
. label define bpcat 1 "Normal" 2 "Elevated" 3 "High, stage I"    ///
>                                         4 "High, stage II" .u "Unknown"

. label values bpcat bpcat

. 
. recode bpcat .u=1, gen(bpcat_nomiss)
(7740 differences between bpcat and bpcat_nomiss)

. label values bpcat_nomiss bpcat

. 
. * Create non-missing indicator of known high blood pressure
. gen bphigh = (bpcat==4)

. 
. /*  Hypertension  */
. 
. gen htdiag_or_highbp = bphigh

. recode htdiag_or_highbp 0 = 1 if hypertension==1 
(htdiag_or_highbp: 1595 changes made)

. 
. 
. ************
. *   eGFR   *
. ************
. 
. * Set implausible creatinine values to missing (Note: zero changed to missing)
. replace creatinine = . if !inrange(creatinine, 20, 3000) 
(309 real changes made, 309 to missing)

.         
. * Divide by 88.4 (to convert umol/l to mg/dl)
. gen SCr_adj = creatinine/88.4
(4,275 missing values generated)

. 
. gen min=.
(78,629 missing values generated)

. replace min = SCr_adj/0.7 if male==0
(38,102 real changes made)

. replace min = SCr_adj/0.9 if male==1
(36,252 real changes made)

. replace min = min^-0.329  if male==0
(38,102 real changes made)

. replace min = min^-0.411  if male==1
(36,252 real changes made)

. replace min = 1 if min<1
(20,744 real changes made)

. 
. gen max=.
(78,629 missing values generated)

. replace max=SCr_adj/0.7 if male==0
(38,102 real changes made)

. replace max=SCr_adj/0.9 if male==1
(36,252 real changes made)

. replace max=max^-1.209
(74,354 real changes made)

. replace max=1 if max>1
(57,885 real changes made)

. 
. gen egfr=min*max*141
(4,275 missing values generated)

. replace egfr=egfr*(0.993^age)
(74,354 real changes made)

. replace egfr=egfr*1.018 if male==0
(38,102 real changes made)

. label var egfr "egfr calculated using CKD-EPI formula with no eth"

. 
. * Categorise into ckd stages
. egen egfr_cat = cut(egfr), at(0, 15, 30, 45, 60, 5000)
(4,275 missing values generated)

. recode egfr_cat 0=5 15=4 30=3 45=2 60=0, generate(ckd)
(74354 differences between egfr_cat and ckd)

. * 0 = "No CKD"  2 "stage 3a" 3 "stage 3b" 4 "stage 4" 5 "stage 5"
. label define ckd 0 "No CKD" 1 "CKD"

. label values ckd ckd

. *label var ckd "CKD stage calc without eth"
. 
. * Convert into CKD group
. *recode ckd 2/5=1, gen(chronic_kidney_disease)
. *replace chronic_kidney_disease = 0 if creatinine==. 
.         
. recode ckd 0=1 2/3=2 4/5=3, gen(reduced_kidney_function_cat)
(73435 differences between ckd and reduced_kidney_function_cat)

. replace reduced_kidney_function_cat = 1 if creatinine==. 
(4,275 real changes made)

. label define reduced_kidney_function_catlab ///
>         1 "None" 2 "Stage 3a/3b egfr 30-60      " 3 "Stage 4/5 egfr<30"

. label values reduced_kidney_function_cat reduced_kidney_function_catlab 

. lab var  reduced "Reduced kidney function"

. 
. /* Hb1AC */
. 
. /*  Diabetes severity  */
. 
. * Set zero or negative to missing
. replace hba1c_percentage   = . if hba1c_percentage <= 0
(474 real changes made, 474 to missing)

. replace hba1c_mmol_per_mol = . if hba1c_mmol_per_mol <= 0
(1,662 real changes made, 1,662 to missing)

. 
. /* Express  HbA1c as percentage  */ 
. 
. * Express all values as perecentage 
. noi summ hba1c_percentage hba1c_mmol_per_mol 

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
hba1c_per~ge |     74,225    5.040219    1.952857   .0007661   12.96693
hba1c_mmol~l |     73,088    41.12243    18.89999   .0105857   124.3212

. gen     hba1c_pct = hba1c_percentage 
(4,404 missing values generated)

. replace hba1c_pct = (hba1c_mmol_per_mol/10.929)+2.15 if hba1c_mmol_per_mol<. 
(73,088 real changes made)

. 
. * Valid % range between 0-20  
. replace hba1c_pct = . if !inrange(hba1c_pct, 0, 20) 
(0 real changes made)

. replace hba1c_pct = round(hba1c_pct, 0.1)
(78,314 real changes made)

. 
. /* Categorise hba1c and diabetes  */
. 
. * Group hba1c
. gen     hba1ccat = 0 if hba1c_pct <  6.5
(28,845 missing values generated)

. replace hba1ccat = 1 if hba1c_pct >= 6.5  & hba1c_pct < 7.5
(13,958 real changes made)

. replace hba1ccat = 2 if hba1c_pct >= 7.5  & hba1c_pct < 8
(5,071 real changes made)

. replace hba1ccat = 3 if hba1c_pct >= 8    & hba1c_pct < 9
(6,119 real changes made)

. replace hba1ccat = 4 if hba1c_pct >= 9    & hba1c_pct !=.
(3,382 real changes made)

. label define hba1ccat 0 "<6.5%" 1">=6.5-7.4" 2">=7.5-7.9" 3">=8-8.9" 4">=9"

. label values hba1ccat hba1ccat

. tab hba1ccat

   hba1ccat |      Freq.     Percent        Cum.
------------+-----------------------------------
      <6.5% |     49,784       63.57       63.57
  >=6.5-7.4 |     13,958       17.82       81.39
  >=7.5-7.9 |      5,071        6.48       87.87
    >=8-8.9 |      6,119        7.81       95.68
        >=9 |      3,382        4.32      100.00
------------+-----------------------------------
      Total |     78,314      100.00

. 
. gen hba1c75=0 if hba1c_pct<7.5
(14,887 missing values generated)

. replace hba1c75=1 if hba1c_pct>7.5 & hba1c_pct!=.
(13,433 real changes made)

. label define hba1c75 0"<7.5" 1">=7.5"

. 
. /*  Asthma  */
. * Asthma  (coded: 0 No, 1 Yes no OCS, 2 Yes with OCS)
. rename asthma asthmacat

. recode asthmacat 0=1 1=2 2=3
(asthmacat: 78629 changes made)

. label define asthmacat 1 "No" 2 "Yes, no OCS" 3 "Yes with OCS"

. label values asthmacat asthmacat

. 
. gen asthma = (asthmacat==2|asthmacat==3)

. 
. 
. /* OUTCOME AND SURVIVAL TIME==================================================*/
. 
. /*  Cohort entry and censor dates  */
. * Date of cohort entry, 1 Mar 2020
. gen enter_date = date("$indexdate", "DMY")

. 
. * Date of study end (typically: last date of outcome data available)
. gen tppcensor_date              = date("$tppcensor",    "DMY")

. gen sgsscensor_date             = date("$sgsscensor",   "DMY")

. gen  ecdscensor_date                    = date("$ecdscensor",   "DMY")

. gen inarccensor_date                    = date("$inarccensor",  "DMY")

. gen cpnscensor_date                             = date("$cpnscensor",   "DMY")

. gen onscensor_date                      = date("$onscensor",    "DMY")

. 
. 
.         
. /****   Outcome definitions   ****/
. ren primary_care_suspect_case   suspected_date

. ren primary_care_case                   confirmed_date

. ren first_tested_for_covid              tested_date

. ren first_positive_test_date    positivetest_date

. ren a_e_consult_date                    ae_date

. ren icu_date_admitted                   icu_date

. *ren icu_date_ventilated        ventilation_date
. ren died_date_cpns                              cpnsdeath_date

. ren died_date_ons                               onsdeath_date

. 
. * Date of Covid death in ONS
. gen onscoviddeath_date = onsdeath_date if died_ons_covid_flag_any == 1
(75,464 missing values generated)

. 
. * Date of non-COVID death in ONS 
. * If missing date of death resulting died_date will also be missing
. gen ons_noncoviddeath_date = onsdeath_date if died_ons_covid_flag_any != 1 
(65,963 missing values generated)

. 
. /* CONVERT STRINGS TO DATE====================================================*/
. * Recode to dates from the strings 
. foreach var of varlist  suspected_date ///
>                                                 confirmed_date ///
>                                                 tested_date ///
>                                                 positivetest_date ///   
>                                                 ae_date /// 
>                                                 icu_date ///    ventilation_date ///
>                                                 cpnsdeath_date  ///
>                                                 onsdeath_date ///
>                                                 onscoviddeath_date ///
>                                                 ons_noncoviddeath_date ///                             
>                  
>                                 {
  2.                                                 
.         confirm string variable `var'
  3.         rename `var' `var'_dstr
  4.         gen `var' = date(`var'_dstr, "YMD")
  5.         drop `var'_dstr
  6.         format `var' %td 
  7. 
. }
(62,840 missing values generated)
(62,849 missing values generated)
(62,957 missing values generated)
(62,911 missing values generated)
(62,917 missing values generated)
(78,479 missing values generated)
(62,968 missing values generated)
(62,798 missing values generated)
(75,464 missing values generated)
(65,963 missing values generated)

. 
. 
. 
. format *date* %td

. 
. * Binary indicators for outcomes
. local p"suspected confirmed tested positivetest ae icu  cpnsdeath onsdeath onscoviddeath ons_noncovidde
> ath" //ventilation

. foreach i of local p {
  2.                 gen `i'=0
  3.                 replace  `i'=1 if `i'_date < .
  4.                 tab `i'
  5. }
(15,789 real changes made)

  suspected |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     62,840       79.92       79.92
          1 |     15,789       20.08      100.00
------------+-----------------------------------
      Total |     78,629      100.00
(15,780 real changes made)

  confirmed |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     62,849       79.93       79.93
          1 |     15,780       20.07      100.00
------------+-----------------------------------
      Total |     78,629      100.00
(15,672 real changes made)

     tested |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     62,957       80.07       80.07
          1 |     15,672       19.93      100.00
------------+-----------------------------------
      Total |     78,629      100.00
(15,718 real changes made)

positivetes |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     62,911       80.01       80.01
          1 |     15,718       19.99      100.00
------------+-----------------------------------
      Total |     78,629      100.00
(15,712 real changes made)

         ae |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     62,917       80.02       80.02
          1 |     15,712       19.98      100.00
------------+-----------------------------------
      Total |     78,629      100.00
(150 real changes made)

        icu |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     78,479       99.81       99.81
          1 |        150        0.19      100.00
------------+-----------------------------------
      Total |     78,629      100.00
(15,661 real changes made)

  cpnsdeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     62,968       80.08       80.08
          1 |     15,661       19.92      100.00
------------+-----------------------------------
      Total |     78,629      100.00
(15,831 real changes made)

   onsdeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     62,798       79.87       79.87
          1 |     15,831       20.13      100.00
------------+-----------------------------------
      Total |     78,629      100.00
(3,165 real changes made)

onscoviddea |
         th |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     75,464       95.97       95.97
          1 |      3,165        4.03      100.00
------------+-----------------------------------
      Total |     78,629      100.00
(12,666 real changes made)

ons_noncovi |
     ddeath |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     65,963       83.89       83.89
          1 |     12,666       16.11      100.00
------------+-----------------------------------
      Total |     78,629      100.00

. 
. 
. /**** Create survival times  ****/
. * For looping later, name must be stime_binary_outcome_name
. 
. * Survival time = last followup date (first: end study, death, or that outcome)
. gen stime_suspected = min(tppcensor_date, onsdeath_date, suspected_date)

. gen stime_confirmed = min(tppcensor_date, onsdeath_date, confirmed_date)

. gen stime_tested = min(sgsscensor_date, onsdeath_date, tested_date)

. gen stime_positivetest = min(sgsscensor_date, onsdeath_date, positivetest_date)

. gen stime_ae = min(ecdscensor_date, onsdeath_date, ae_date)

. gen stime_icu = min(inarccensor_date, onsdeath_date, icu_date)

. gen stime_ventilation = min(inarccensor_date, onsdeath_date) //*ventilation_date)

. gen stime_cpnsdeath = min(cpnscensor_date, cpnsdeath_date)

. gen stime_onsdeath = min(onscensor_date, onsdeath_date )

. gen stime_onscoviddeath = min(onscensor_date, onscoviddeath_date )

. gen stime_ons_noncoviddeath = min(onscensor_date, ons_noncoviddeath_date )

. 
. /* If outcome was after censoring occurred, set to zero
> replace covid_death_itu         = 0 if (date_covid_death_itu    > onscoviddeathcensor_date) 
> replace covid_tpp_prob_or_susp = 0 if (date_covid_tpp_prob_or_susp > onscoviddeathcensor_date)
> replace covid_tpp_prob = 0 if (date_covid_tpp_prob > onscoviddeathcensor_date)
> */
. 
. * Format date variables
. format  stime* %td 

. 
. 
. /* LABEL VARIABLES============================================================*/
. *  Label variables you are intending to keep, drop the rest 
. 
. *HH variable
. label var  hh_size "Number people in household"

. label var  hh_id "Household ID"

. 
. 
. * Demographics
. label var patient_id                            "Patient ID"

. label var age                                           "Age (years)"

. label var agegroup                                      "Grouped age"

. label var age66                                         "66 years and older"

. label var sex                                           "Sex"

. label var male                                          "Male"

. label var bmi                                           "Body Mass Index (BMI, kg/m2)"

. label var bmicat                                        "BMI"

. label var bmicat_sa                                     "BMI with SA categories"

. label var bmi_measured_date             "Body Mass Index (BMI, kg/m2), date measured"

. label var obese4cat                                     "Obesity (4 categories)"

. label var obese4cat_sa                          "Obesity with SA categories"

. label var smoke                                         "Smoking status"

. label var smoke_nomiss                          "Smoking status (missing set to non)"

. label var imd                                           "Index of Multiple Deprivation (IMD)"

. label var ethnicity                                     "Eth 5 categories"

. label var ethnicity_16                          "Eth 16 categories"

. label var eth16                         "Eth 16 collapsed"

. label var stp                                           "Sustainability and Transformation Partnership"

. label var age1                                          "Age spline 1"

. label var age2                                          "Age spline 2"

. label var age3                                          "Age spline 3"

. lab var hh_total                                        "calculated No of ppl in household"

. lab var region                                          "Region of England"

. lab var rural_urban                                     "Rural-Urban Indicator"

. lab var care_home_type                          "Care home type"

. 
. * Comorbidities of interest 
. label var asthma                                                "Asthma category"

. lab var asthmacat                                               "Asthma detailed categories"

. label var egfr_cat                                              "Calculated eGFR"

. label var hypertension                              "Diagnosed hypertension"

. label var chronic_respiratory_disease   "Chronic Respiratory Diseases"

. label var chronic_cardiac_disease               "Chronic Cardiac Diseases"

. label var diabetes_type                                         "Diabetes by type"

. label var diabetes_exeter_os                    "Diabetes exeter type"

. label var cancer                                                "Cancer"

. label var other_immuno                                  "Immunosuppressed (combination algorithm)"

. label var chronic_liver_disease                 "Chronic liver disease"

. label var other_neuro                                   "Neurological disease"                  

. label var stroke                                            "Stroke"

. lab var dementia                                                "Dementia"                             
>                          

. label var ra_sle_psoriasis                              "Autoimmune disease"

. lab var egfr                                                    "eGFR"

. lab var perm_immunodef                                  "Permanent immunosuppression"

. lab var temp_immunodef                                  "Temporary immunosuppression"

. lab var  bphigh                                                         "non-missing indicator of known
>  high blood pressure"

. lab var bpcat                                                           "Blood pressure four levels, no
> n-missing"

. lab var htdiag_or_highbp                                        "High blood pressure or hypertension di
> agnosis"

. lab var esrf                                                    "end stage renal failure"

. 
. lab var asthma_date                                     "Diagnosed Asthma Date"

. label var hypertension_date                                     "Diagnosed hypertension Date"

. label var chronic_respiratory_disease_date      "Other Respiratory Diseases Date"

. label var chronic_cardiac_disease_date          "Other Heart Diseases Date"

. label var diabetes_date                                         "Diabetes Date"

. label var cancer_date                                           "Cancer Date"

. label var chronic_liver_disease_date            "Chronic liver disease Date"

. label var other_neuro_date                                      "Neurological disease  Date"

. label var stroke_date                                   "Stroke date"           

. label var dementia_date                                         "DDementia date"                       
>                  

. label var ra_sle_psoriasis_date                         "Autoimmune disease  Date"

. lab var perm_immunodef_date                             "Permanent immunosuppression date"

. lab var temp_immunodef_date                             "Temporary immunosuppression date"

. lab var esrf_date                                                       "end stage renal failure"

. 
. *medications
. lab var statin                                                          "Statin in last 6 months"

. lab var insulin                                                         "Insulin in last 6 months"

. lab var ace_inhibitors                                          "ACE in last 6 months"

. lab var alpha_blockers                                          "Alpha blocker in last 6 months"

. lab var arbs                                                            "ARB in last 6 months"

. lab var betablockers                                            "Beta blocker in last 6 months"

. lab var calcium_channel_blockers                        "CCB in last 6 months"

. lab var combination_bp_meds                             "BP med in last 6 months"

. lab var spironolactone                                          "Spironolactone in last 6 months"

. lab var thiazide_diuretics                                      "TZD in last 6 months"

. 
. lab var statin_date                                                             "Statin in last 6 month
> s"

. lab var insulin_date                                                            "Insulin in last 6 mont
> hs"

. lab var ace_inhibitors_date                                             "ACE in last 6 months"

. lab var alpha_blockers_date                                             "Alpha blocker in last 6 months
> "

. lab var arbs_date                                                               "ARB in last 6 months"

. lab var betablockers_date                                               "Beta blocker in last 6 months"

. lab var calcium_channel_blockers_date                   "CCB in last 6 months"

. lab var combination_bp_meds_date                                "BP med in last 6 months"

. lab var spironolactone_date                                             "Spironolactone in last 6 month
> s"

. lab var thiazide_diuretics_date                                 "TZD in last 6 months"

. 
. * Outcomes and follow-up
. label var enter_date                                    "Date of study entry"

. 
. label var tppcensor                                             "Date of admin censoring for covid TPP 
> cases"

. label var sgsscensor                                    "Date of admin censoring for SGSS testing data"

. label var ecdscensor                                    "Date of admin censoring for A&E attendance"

. label var inarccensor                                   "Date of admin censoring for ITU admissions and
>  ventilation events"

. label var onscensor                                             "Date of admin censoring for ONS deaths
> "

. label var cpnscensor                                    "Date of admin censoring for CPNS deaths"

. 
. label var suspected_date                                "Failure/censoring indicator for outcome: suspe
> cted case"

. label var confirmed_date                                "Failure/censoring indicator for outcome: covid
>  confirmed case"

. label var tested_date                                   "Failure/censoring indicator for outcome: SGSS 
> test performed"

. label var positivetest_date                             "Failure/censoring indicator for outcome: SGSS 
> test positive"

. label var ae_date                                               "Failure/censoring indicator for outcom
> e: A&E Attendance"

. label var icu_date                                              "Failure/censoring indicator for outcom
> e: ICU Admission"

. *label var ventilation_date                             "Failure/censoring indicator for outcome: ICU V
> entilation"
. label var cpnsdeath_date                                "Failure/censoring indicator for outcome: CPNS 
> death"

. label var onsdeath_date                                 "Failure/censoring indicator for outcome: ONS d
> eath any cause"

. label var onscoviddeath_date                    "Failure/censoring indicator for outcome: ONS COVID dea
> th"

. label var ons_noncoviddeath_date                "Failure/censoring indicator for outcome: ONS non-COVID
>  death"

. 
. * Survival times
. label var stime_suspected                               "Survival time (date); outcome suspected case"

. label var stime_confirmed                               "Survival time (date); outcome confirmed case"

. label var stime_tested                                  "Survival time (date); outcome SGSS test perfor
> med"

. label var stime_positivetest                    "Survival time (date); outcome SGSS test positive"

. label var stime_ae                                              "Survival time (date); outcome A&E Atte
> ndance"

. label var stime_icu                                     "Survival time (date); outcome ICU Admission"

. label var stime_ventilation                             "Survival time (date); outcome ICU Ventilation"

. label var stime_cpnsdeath                               "Survival time (date); outcome CPNS death"

. label var stime_onsdeath                                "Survival time (date); outcome ONS death any ca
> use"

. label var stime_onscoviddeath                   "Survival time (date); outcome ONS COVID death"

. label var stime_ons_noncoviddeath               "Survival time (date); outcome ONS non-COVID death"

. 
. * binary indicators
. label var suspected                             "outcome suspected case"

. label var confirmed                             "outcome confirmed case"

. label var tested                                        "outcome SGSS test performed"

. label var positivetest                          "outcome SGSS test positive"

. label var ae                                            "outcome A&E Attendance"

. label var icu                                           "outcome ICU Admission"

. *label var ventilation                          "outcome ICU Ventilation"
. label var cpnsdeath                             "outcome CPNS death"

. label var onsdeath                                      "outcome ONS death any cause"

. label var onscoviddeath                         "outcome ONS COVID death"

. label var ons_noncoviddeath                     "outcome ONS non-COVID death"

. 
. /* TIDY DATA==================================================================*/
. *  Drop variables that are not needed (those not labelled)
. ds, not(varlabel)
primary_c~se  bp_sys_dat~d  hba1~ge_date  type1_diab~s  died_ons_c~g  hba1c_per~ge  min
primary_c~re  bp_dias_da~e  crea~te_date  type2_diab~e  gp_consult~t  creatinine    max
ethni~6_date  bp_dias_da~d  crea~ne_date  type2_diab~s  has_consul~y  bmi_time      hba1c_pct
ethni~y_date  ~l_date_date  smoki~e_date  unknown_di~e  bp_sys        bmi_age       hba1ccat
bmi_measured  hba1c~l_date  smoki~s_date  unknown_di~s  bp_dias       cancer_cat    hba1c75
bp_sys_dat~e  hba1c_perc..  type1_diab~e  died_ons_c~y  hba1c_mmol~l  SCr_adj

. drop `r(varlist)'

.         
. 
. /* APPLY INCLUSION/EXCLUIONS==================================================*/ 
. 
. 
. 
. noi di "DROP AGE >110:"
DROP AGE >110:

. drop if age > 110 & age != .
(0 observations deleted)

. 
. noi di "DROP IF DIED BEFORE INDEX"
DROP IF DIED BEFORE INDEX

. drop if onsdeath_date <= date("$indexdate", "DMY")
(15,671 observations deleted)

. 
. noi di "DROP IF OUTCOMES OCCUR BEFORE INDEX"
DROP IF OUTCOMES OCCUR BEFORE INDEX

. 
. local p"suspected confirmed tested positivetest ae icu ventilation cpnsdeath onsdeath onscoviddeath ons
> _noncoviddeath" 

. foreach i of local p {
  2.         cap drop if `i'_date <= date("$indexdate", "DMY") 
  3. }

.         
. ***************
. *  Save data  *
. ***************
. sort patient_id

. save "$Tempdir/analysis_dataset.dta", replace
file /Users/lsh152058/Documents/GitHub/ethnicity-covid-research/output/tempdata/analysis_dataset.dta save
> d

. 
. **save a version set on each outcome
. local p"suspected confirmed tested positivetest ae icu cpnsdeath onsdeath onscoviddeath ons_noncoviddea
> th" //ventilation

. foreach i of local p {
  2.         use "$Tempdir/analysis_dataset.dta", clear
  3. 
.         stset stime_`i', fail(`i')                              ///
>         id(patient_id) enter(enter_date) origin(enter_date)
  4.         save "$Tempdir/analysis_dataset_STSET_`i'.dta", replace
  5. }       

                id:  patient_id
     failure event:  suspected != 0 & suspected < .
obs. time interval:  (stime_suspected[_n-1], stime_suspected]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     50,485  total observations
          0  exclusions
------------------------------------------------------------------------------
     50,485  observations remaining, representing
     50,485  subjects
     10,142  failures in single-failure-per-subject data
  9,063,448  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       181
file /Users/lsh152058/Documents/GitHub/ethnicity-covid-research/output/tempdata/analysis_dataset_STSET_su
> spected.dta saved

                id:  patient_id
     failure event:  confirmed != 0 & confirmed < .
obs. time interval:  (stime_confirmed[_n-1], stime_confirmed]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     50,485  total observations
          0  exclusions
------------------------------------------------------------------------------
     50,485  observations remaining, representing
     50,485  subjects
     10,124  failures in single-failure-per-subject data
  9,061,035  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       181
file /Users/lsh152058/Documents/GitHub/ethnicity-covid-research/output/tempdata/analysis_dataset_STSET_co
> nfirmed.dta saved

                id:  patient_id
     failure event:  tested != 0 & tested < .
obs. time interval:  (stime_tested[_n-1], stime_tested]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     50,485  total observations
          0  exclusions
------------------------------------------------------------------------------
     50,485  observations remaining, representing
     50,485  subjects
     10,042  failures in single-failure-per-subject data
  8,125,540  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       181
file /Users/lsh152058/Documents/GitHub/ethnicity-covid-research/output/tempdata/analysis_dataset_STSET_te
> sted.dta saved

                id:  patient_id
     failure event:  positivetest != 0 & positivetest < .
obs. time interval:  (stime_positivetest[_n-1], stime_positivetest]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     50,485  total observations
          0  exclusions
------------------------------------------------------------------------------
     50,485  observations remaining, representing
     50,485  subjects
     10,028  failures in single-failure-per-subject data
  8,134,634  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       181
file /Users/lsh152058/Documents/GitHub/ethnicity-covid-research/output/tempdata/analysis_dataset_STSET_po
> sitivetest.dta saved

                id:  patient_id
     failure event:  ae != 0 & ae < .
obs. time interval:  (stime_ae[_n-1], stime_ae]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     50,485  total observations
          0  exclusions
------------------------------------------------------------------------------
     50,485  observations remaining, representing
     50,485  subjects
     10,121  failures in single-failure-per-subject data
  9,063,116  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       181
file /Users/lsh152058/Documents/GitHub/ethnicity-covid-research/output/tempdata/analysis_dataset_STSET_ae
> .dta saved

                id:  patient_id
     failure event:  icu != 0 & icu < .
obs. time interval:  (stime_icu[_n-1], stime_icu]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     50,485  total observations
          0  exclusions
------------------------------------------------------------------------------
     50,485  observations remaining, representing
     50,485  subjects
         87  failures in single-failure-per-subject data
  9,116,974  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       181
file /Users/lsh152058/Documents/GitHub/ethnicity-covid-research/output/tempdata/analysis_dataset_STSET_ic
> u.dta saved

                id:  patient_id
     failure event:  cpnsdeath != 0 & cpnsdeath < .
obs. time interval:  (stime_cpnsdeath[_n-1], stime_cpnsdeath]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     50,485  total observations
          0  exclusions
------------------------------------------------------------------------------
     50,485  observations remaining, representing
     50,485  subjects
         86  failures in single-failure-per-subject data
  9,127,091  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       181
file /Users/lsh152058/Documents/GitHub/ethnicity-covid-research/output/tempdata/analysis_dataset_STSET_cp
> nsdeath.dta saved

                id:  patient_id
     failure event:  onsdeath != 0 & onsdeath < .
obs. time interval:  (stime_onsdeath[_n-1], stime_onsdeath]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     50,485  total observations
          0  exclusions
------------------------------------------------------------------------------
     50,485  observations remaining, representing
     50,485  subjects
        129  failures in single-failure-per-subject data
  9,124,966  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       181
file /Users/lsh152058/Documents/GitHub/ethnicity-covid-research/output/tempdata/analysis_dataset_STSET_on
> sdeath.dta saved

                id:  patient_id
     failure event:  onscoviddeath != 0 & onscoviddeath < .
obs. time interval:  (stime_onscoviddeath[_n-1], stime_onscoviddeath]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     50,485  total observations
          0  exclusions
------------------------------------------------------------------------------
     50,485  observations remaining, representing
     50,485  subjects
         32  failures in single-failure-per-subject data
  9,134,708  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       181
file /Users/lsh152058/Documents/GitHub/ethnicity-covid-research/output/tempdata/analysis_dataset_STSET_on
> scoviddeath.dta saved

                id:  patient_id
     failure event:  ons_noncoviddeath != 0 & ons_noncoviddeath < .
obs. time interval:  (stime_ons_noncoviddeath[_n-1], stime_ons_noncoviddeath]
 enter on or after:  time enter_date
 exit on or before:  failure
    t for analysis:  (time-origin)
            origin:  time enter_date

------------------------------------------------------------------------------
     50,485  total observations
          0  exclusions
------------------------------------------------------------------------------
     50,485  observations remaining, representing
     50,485  subjects
         97  failures in single-failure-per-subject data
  9,128,043  total analysis time at risk and under observation
                                                at risk from t =         0
                                     earliest observed entry t =         0
                                          last observed exit t =       181
file /Users/lsh152058/Documents/GitHub/ethnicity-covid-research/output/tempdata/analysis_dataset_STSET_on
> s_noncoviddeath.dta saved

.         
. * Close log file 
. log close
      name:  <unnamed>
       log:  /Users/lsh152058/Documents/GitHub/ethnicity-covid-research/output/log/01_eth_cr_create_analy
> sis_dataset.log
  log type:  text
 closed on:  13 Jul 2020, 21:12:20
---------------------------------------------------------------------------------------------------------
