---------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/lsh152058/Documents/GitHub/ethnicity-covid-research/output/log/03_eth_an_descriptive_
> tables.log
  log type:  text
 opened on:  13 Jul 2020, 21:12:23

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset, clear

. 
. 
. **********************************
. *  Distribution in whole cohort  *
. **********************************
. 
. 
. * Demographics
. tab ethnicity

      Eth 5 categories |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |     30,432       80.36       80.36
                 Mixed |      1,957        5.17       85.52
Asian or Asian British |      1,841        4.86       90.39
                 Black |      1,832        4.84       95.22
                 Other |      1,809        4.78      100.00
-----------------------+-----------------------------------
                 Total |     37,871      100.00

. tab ethnicity, m

      Eth 5 categories |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |     30,432       60.28       60.28
                 Mixed |      1,957        3.88       64.16
Asian or Asian British |      1,841        3.65       67.80
                 Black |      1,832        3.63       71.43
                 Other |      1,809        3.58       75.01
                     . |     12,614       24.99      100.00
-----------------------+-----------------------------------
                 Total |     50,485      100.00

. tab ethnicity_16

                 Eth 16 categories |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
          British or Mixed British |     14,301       50.53       50.53
                             Irish |      2,836       10.02       60.55
                       Other White |      1,325        4.68       65.23
           White + Black Caribbean |      1,401        4.95       70.18
             White + Black African |      1,422        5.02       75.20
                     White + Asian |      1,465        5.18       80.38
                       Other mixed |      1,373        4.85       85.23
          Indian or British Indian |      1,360        4.80       90.03
    Pakistani or British Pakistani |        610        2.16       92.19
Bangladeshi or British Bangladeshi |        575        2.03       94.22
                       Other Asian |        268        0.95       95.17
                         Caribbean |        265        0.94       96.10
                           African |        278        0.98       97.09
                       Other Black |        271        0.96       98.04
                           Chinese |        287        1.01       99.06
                             Other |        267        0.94      100.00
-----------------------------------+-----------------------------------
                             Total |     28,304      100.00

. tab ethnicity_16, m

                 Eth 16 categories |      Freq.     Percent        Cum.
-----------------------------------+-----------------------------------
          British or Mixed British |     14,301       28.33       28.33
                             Irish |      2,836        5.62       33.94
                       Other White |      1,325        2.62       36.57
           White + Black Caribbean |      1,401        2.78       39.34
             White + Black African |      1,422        2.82       42.16
                     White + Asian |      1,465        2.90       45.06
                       Other mixed |      1,373        2.72       47.78
          Indian or British Indian |      1,360        2.69       50.48
    Pakistani or British Pakistani |        610        1.21       51.68
Bangladeshi or British Bangladeshi |        575        1.14       52.82
                       Other Asian |        268        0.53       53.35
                         Caribbean |        265        0.52       53.88
                           African |        278        0.55       54.43
                       Other Black |        271        0.54       54.97
                           Chinese |        287        0.57       55.54
                             Other |        267        0.53       56.06
                                 . |     22,181       43.94      100.00
-----------------------------------+-----------------------------------
                             Total |     50,485      100.00

. 
. tab ethnicity ethnicity_16, m

                      |                         Eth 16 categories
     Eth 5 categories | British o      Irish  Other Whi  White + B  White + B  White + A |     Total
----------------------+------------------------------------------------------------------+----------
                White |    11,541      2,303      1,061      1,119      1,122      1,164 |    30,432 
                Mixed |       727        127         67         73         75         76 |     1,957 
Asian or Asian Britis |       674        132         64         75         71         67 |     1,841 
                Black |       694        144         60         78         77         82 |     1,832 
                Other |       665        130         73         56         77         76 |     1,809 
                    . |         0          0          0          0          0          0 |    12,614 
----------------------+------------------------------------------------------------------+----------
                Total |    14,301      2,836      1,325      1,401      1,422      1,465 |    50,485 


                      |                         Eth 16 categories
     Eth 5 categories | Other mix  Indian or  Pakistani  Banglades  Other Asi  Caribbean |     Total
----------------------+------------------------------------------------------------------+----------
                White |     1,094      1,083        486        459        205        204 |    30,432 
                Mixed |        88         78         28         38         12         11 |     1,957 
Asian or Asian Britis |        66         68         34         26         12         19 |     1,841 
                Black |        61         61         31         27         19         11 |     1,832 
                Other |        64         70         31         25         20         20 |     1,809 
                    . |         0          0          0          0          0          0 |    12,614 
----------------------+------------------------------------------------------------------+----------
                Total |     1,373      1,360        610        575        268        265 |    50,485 


                      |                   Eth 16 categories
     Eth 5 categories |   African  Other Bla    Chinese      Other          . |     Total
----------------------+-------------------------------------------------------+----------
                White |       218        219        243        215      7,696 |    30,432 
                Mixed |        18         15          5         14        505 |     1,957 
Asian or Asian Britis |        13         11         15         17        477 |     1,841 
                Black |        15         11         15         11        435 |     1,832 
                Other |        14         15          9         10        454 |     1,809 
                    . |         0          0          0          0     12,614 |    12,614 
----------------------+-------------------------------------------------------+----------
                Total |       278        271        287        267     22,181 |    50,485 

. 
. summ age

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         age |     50,485    48.83773    18.96834         18        105

. tab agegroup

Grouped age |      Freq.     Percent        Cum.
------------+-----------------------------------
     18-<30 |      9,827       19.47       19.47
     30-<40 |      8,585       17.01       36.47
     40-<50 |      8,225       16.29       52.76
     50-<60 |      8,529       16.89       69.66
     60-<70 |      6,776       13.42       83.08
     70-<80 |      5,409       10.71       93.79
        80+ |      3,134        6.21      100.00
------------+-----------------------------------
      Total |     50,485      100.00

. tab male

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
     Female |     25,874       51.25       51.25
       Male |     24,611       48.75      100.00
------------+-----------------------------------
      Total |     50,485      100.00

. tab bmicat

                 BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |        244        2.86        2.86
  Normal (18.5-24.9) |      1,018       11.92       14.77
Overweight (25-29.9) |      1,452       17.00       31.77
   Obese I (30-34.9) |      1,769       20.71       52.48
  Obese II (35-39.9) |      1,803       21.11       73.59
     Obese III (40+) |      2,256       26.41      100.00
---------------------+-----------------------------------
               Total |      8,542      100.00

. tab bmicat, m

                 BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |        244        0.48        0.48
  Normal (18.5-24.9) |      1,018        2.02        2.50
Overweight (25-29.9) |      1,452        2.88        5.38
   Obese I (30-34.9) |      1,769        3.50        8.88
  Obese II (35-39.9) |      1,803        3.57       12.45
     Obese III (40+) |      2,256        4.47       16.92
        Unknown (.u) |     41,943       83.08      100.00
---------------------+-----------------------------------
               Total |     50,485      100.00

. tab bmicat_sa

BMI with SA |
 categories |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        244        2.86        2.86
          2 |      1,001       11.72       14.58
          3 |      1,449       16.96       31.54
          4 |      1,789       20.94       52.48
          5 |      1,803       21.11       73.59
          6 |      2,256       26.41      100.00
------------+-----------------------------------
      Total |      8,542      100.00

. tab bmicat_sa, m

BMI with SA |
 categories |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        244        0.48        0.48
          2 |      1,001        1.98        2.47
          3 |      1,449        2.87        5.34
          4 |      1,789        3.54        8.88
          5 |      1,803        3.57       12.45
          6 |      2,256        4.47       16.92
         .u |     41,943       83.08      100.00
------------+-----------------------------------
      Total |     50,485      100.00

. tab obese4cat

          Obesity (4 |
         categories) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
No record of obesity |     44,657       88.46       88.46
   Obese I (30-34.9) |      1,769        3.50       91.96
  Obese II (35-39.9) |      1,803        3.57       95.53
     Obese III (40+) |      2,256        4.47      100.00
---------------------+-----------------------------------
               Total |     50,485      100.00

. tab obese4cat, m

          Obesity (4 |
         categories) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
No record of obesity |     44,657       88.46       88.46
   Obese I (30-34.9) |      1,769        3.50       91.96
  Obese II (35-39.9) |      1,803        3.57       95.53
     Obese III (40+) |      2,256        4.47      100.00
---------------------+-----------------------------------
               Total |     50,485      100.00

. tab obese4cat_sa, m

   Obesity with SA categories |      Freq.     Percent        Cum.
------------------------------+-----------------------------------
         No record of obesity |     44,637       88.42       88.42
Obese I (30-34.9 / 27.5-34.9) |      1,789        3.54       91.96
           Obese II (35-39.9) |      1,803        3.57       95.53
              Obese III (40+) |      2,256        4.47      100.00
------------------------------+-----------------------------------
                        Total |     50,485      100.00

. tab smoke

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |      2,058       22.49       22.49
      Former |      1,042       11.39       33.87
     Current |      6,052       66.13      100.00
-------------+-----------------------------------
       Total |      9,152      100.00

. tab smoke, m

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |      2,058        4.08        4.08
      Former |      1,042        2.06        6.14
     Current |      6,052       11.99       18.13
Unknown (.u) |     41,333       81.87      100.00
-------------+-----------------------------------
       Total |     50,485      100.00

. tab bpcat

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |          1        0.00        0.00
 High, stage I |         60        0.13        0.13
High, stage II |     45,444       99.87      100.00
---------------+-----------------------------------
         Total |     45,505      100.00

. tab bpcat, m

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |          1        0.00        0.00
 High, stage I |         60        0.12        0.12
High, stage II |     45,444       90.01       90.14
       Unknown |      4,980        9.86      100.00
---------------+-----------------------------------
         Total |     50,485      100.00

. tab htdiag_or_highbp

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,040        8.00        8.00
          1 |     46,445       92.00      100.00
------------+-----------------------------------
      Total |     50,485      100.00

. 
. 
. * Comorbidities
. tab chronic_respiratory_disease

    Chronic |
Respiratory |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     40,487       80.20       80.20
          1 |      9,998       19.80      100.00
------------+-----------------------------------
      Total |     50,485      100.00

. tab asthma

     Asthma |
   category |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     40,420       80.06       80.06
          1 |     10,065       19.94      100.00
------------+-----------------------------------
      Total |     50,485      100.00

. tab chronic_cardiac_disease

    Chronic |
    Cardiac |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     40,402       80.03       80.03
          1 |     10,083       19.97      100.00
------------+-----------------------------------
      Total |     50,485      100.00

. tab cancer

     Cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     40,369       79.96       79.96
          1 |     10,116       20.04      100.00
------------+-----------------------------------
      Total |     50,485      100.00

. tab chronic_liver_disease

    Chronic |
      liver |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     40,399       80.02       80.02
          1 |     10,086       19.98      100.00
------------+-----------------------------------
      Total |     50,485      100.00

. tab diabetes_type

Diabetes by |
       type |      Freq.     Percent        Cum.
------------+-----------------------------------
      NO_DM |     37,690       74.66       74.66
       T1DM |      1,491        2.95       77.61
       T2DM |     10,274       20.35       97.96
 UNKNOWN_DM |      1,030        2.04      100.00
------------+-----------------------------------
      Total |     50,485      100.00

. tab perm_immunodef

  Permanent |
immunosuppr |
     ession |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     40,336       79.90       79.90
          1 |     10,149       20.10      100.00
------------+-----------------------------------
      Total |     50,485      100.00

. tab temp_immunodef

  Temporary |
immunosuppr |
     ession |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     40,314       79.85       79.85
          1 |     10,171       20.15      100.00
------------+-----------------------------------
      Total |     50,485      100.00

. tab other_neuro

Neurologica |
  l disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     40,410       80.04       80.04
          1 |     10,075       19.96      100.00
------------+-----------------------------------
      Total |     50,485      100.00

. tab dementia

   Dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     40,341       79.91       79.91
          1 |     10,144       20.09      100.00
------------+-----------------------------------
      Total |     50,485      100.00

. tab stroke

     Stroke |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     40,455       80.13       80.13
          1 |     10,030       19.87      100.00
------------+-----------------------------------
      Total |     50,485      100.00

. tab esrf

  end stage |
      renal |
    failure |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     40,281       79.79       79.79
          1 |     10,204       20.21      100.00
------------+-----------------------------------
      Total |     50,485      100.00

. tab hypertension

  Diagnosed |
hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     40,454       80.13       80.13
          1 |     10,031       19.87      100.00
------------+-----------------------------------
      Total |     50,485      100.00

. tab reduced_kidney_function_cat

     Reduced kidney function |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                        None |     49,894       98.83       98.83
Stage 3a/3b egfr 30-60       |        591        1.17      100.00
-----------------------------+-----------------------------------
                       Total |     50,485      100.00

. tab ra_sle_psoriasis

 Autoimmune |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     40,359       79.94       79.94
          1 |     10,126       20.06      100.00
------------+-----------------------------------
      Total |     50,485      100.00

. 
. tab imd 

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |     35,334       69.99       69.99
               4 |     10,013       19.83       89.82
 5 most deprived |      5,138       10.18      100.00
-----------------+-----------------------------------
           Total |     50,485      100.00

. tab imd, m

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |     35,334       69.99       69.99
               4 |     10,013       19.83       89.82
 5 most deprived |      5,138       10.18      100.00
-----------------+-----------------------------------
           Total |     50,485      100.00

. 
. 
. tab stp

Sustainabil |
    ity and |
Transformat |
        ion |
Partnership |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      5,024        9.95        9.95
          2 |      5,179       10.26       20.21
          3 |      5,074       10.05       30.26
          4 |      5,099       10.10       40.36
          5 |      4,938        9.78       50.14
          6 |      4,930        9.77       59.91
          7 |      5,106       10.11       70.02
          8 |      4,960        9.82       79.85
          9 |      5,081       10.06       89.91
         10 |      5,094       10.09      100.00
------------+-----------------------------------
      Total |     50,485      100.00

. tab region

       Region of England |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |      5,090       10.08       10.08
         East of England |      5,017        9.94       20.02
                  London |     10,230       20.26       40.28
              North East |      5,010        9.92       50.21
              North West |      5,030        9.96       60.17
              South East |     10,106       20.02       80.19
           West Midlands |      5,013        9.93       90.12
Yorkshire and the Humber |      4,989        9.88      100.00
-------------------------+-----------------------------------
                   Total |     50,485      100.00

. tab rural_urban

Rural-Urban |
  Indicator |      Freq.     Percent        Cum.
------------+-----------------------------------
      rural |      5,106       10.11       10.11
      urban |     45,379       89.89      100.00
------------+-----------------------------------
      Total |     50,485      100.00

. 
. 
. * Outcomes
. tab suspected

    outcome |
  suspected |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     40,343       79.91       79.91
          1 |     10,142       20.09      100.00
------------+-----------------------------------
      Total |     50,485      100.00

. tab confirmed

    outcome |
  confirmed |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     40,361       79.95       79.95
          1 |     10,124       20.05      100.00
------------+-----------------------------------
      Total |     50,485      100.00

. tab tested

    outcome |
  SGSS test |
  performed |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     40,443       80.11       80.11
          1 |     10,042       19.89      100.00
------------+-----------------------------------
      Total |     50,485      100.00

. tab positivetest

    outcome |
  SGSS test |
   positive |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     40,457       80.14       80.14
          1 |     10,028       19.86      100.00
------------+-----------------------------------
      Total |     50,485      100.00

. 
. tab ae

outcome A&E |
 Attendance |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     40,364       79.95       79.95
          1 |     10,121       20.05      100.00
------------+-----------------------------------
      Total |     50,485      100.00

. tab icu

outcome ICU |
  Admission |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     50,398       99.83       99.83
          1 |         87        0.17      100.00
------------+-----------------------------------
      Total |     50,485      100.00

. 
. tab onsdeath

outcome ONS |
  death any |
      cause |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     50,356       99.74       99.74
          1 |        129        0.26      100.00
------------+-----------------------------------
      Total |     50,485      100.00

. tab onscoviddeath

outcome ONS |
COVID death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     50,453       99.94       99.94
          1 |         32        0.06      100.00
------------+-----------------------------------
      Total |     50,485      100.00

. tab ons_noncoviddeath

outcome ONS |
  non-COVID |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     50,388       99.81       99.81
          1 |         97        0.19      100.00
------------+-----------------------------------
      Total |     50,485      100.00

. tab cpnsdeath

    outcome |
 CPNS death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     50,399       99.83       99.83
          1 |         86        0.17      100.00
------------+-----------------------------------
      Total |     50,485      100.00

. 
. 
. **********************************
. *  Number (%) with each outcome  *
. **********************************
. 
. foreach outvar of varlist       onsdeath ///
>                                                         onscoviddeath ///
>                                                         ons_noncoviddeath ///
>                                                         cpnsdeath ///
>                                                         ae  ///
>                                                         icu ///
>                                                         suspected ///
>                                                         confirmed ///
>                                                         tested ///
>                                                         positivetest ///
>                                                         {
  2.         * Demographics
.         tab agegroup                                                    `outvar', col
  3.         tab male                                                                `outvar', col
  4.         tab ethnicity                                                   `outvar', col m
  5.         tab ethnicity_16                                                `outvar', col m
  6.         tab bmicat                                                              `outvar', col m 
  7.         tab obese4cat                                                   `outvar', col m 
  8.         tab bmicat_sa                                                   `outvar', col m 
  9.         tab obese4cat_sa                                                `outvar', col m 
 10.         tab smoke                                                               `outvar', col m
 11. 
.         * Comorbidities
.         tab chronic_respiratory_disease                 `outvar', col
 12.         tab asthma                                                              `outvar', col
 13.         tab asthmacat                                                   `outvar', col
 14.         tab chronic_cardiac_disease                     `outvar', col
 15.         tab diabetes_type                                               `outvar', col
 16.         tab diabetes_exeter_os                                  `outvar', col
 17.         tab cancer                                                              `outvar', col
 18.         tab chronic_liver_disease                               `outvar', col
 19.         tab stroke                                                              `outvar', col
 20.         tab dementia                                                    `outvar', col
 21.         tab other_neuro                                                 `outvar', col
 22.         tab reduced_kidney_function_cat                 `outvar', col
 23.         tab ra_sle_psoriasis                                    `outvar', col
 24.         
.         tab imd                                                                 `outvar', col m
 25.         tab rural_urban                                                 `outvar', col
 26.         tab region                                                              `outvar', col
 27. }

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           | outcome ONS death any
   Grouped |         cause
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     9,795         32 |     9,827 
           |     19.45      24.81 |     19.47 
-----------+----------------------+----------
    30-<40 |     8,568         17 |     8,585 
           |     17.01      13.18 |     17.01 
-----------+----------------------+----------
    40-<50 |     8,204         21 |     8,225 
           |     16.29      16.28 |     16.29 
-----------+----------------------+----------
    50-<60 |     8,512         17 |     8,529 
           |     16.90      13.18 |     16.89 
-----------+----------------------+----------
    60-<70 |     6,757         19 |     6,776 
           |     13.42      14.73 |     13.42 
-----------+----------------------+----------
    70-<80 |     5,395         14 |     5,409 
           |     10.71      10.85 |     10.71 
-----------+----------------------+----------
       80+ |     3,125          9 |     3,134 
           |      6.21       6.98 |      6.21 
-----------+----------------------+----------
     Total |    50,356        129 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           | outcome ONS death any
           |         cause
      Male |         0          1 |     Total
-----------+----------------------+----------
    Female |    25,814         60 |    25,874 
           |     51.26      46.51 |     51.25 
-----------+----------------------+----------
      Male |    24,542         69 |    24,611 
           |     48.74      53.49 |     48.75 
-----------+----------------------+----------
     Total |    50,356        129 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      | outcome ONS death any
                      |         cause
     Eth 5 categories |         0          1 |     Total
----------------------+----------------------+----------
                White |    30,358         74 |    30,432 
                      |     60.29      57.36 |     60.28 
----------------------+----------------------+----------
                Mixed |     1,947         10 |     1,957 
                      |      3.87       7.75 |      3.88 
----------------------+----------------------+----------
Asian or Asian Britis |     1,836          5 |     1,841 
                      |      3.65       3.88 |      3.65 
----------------------+----------------------+----------
                Black |     1,832          0 |     1,832 
                      |      3.64       0.00 |      3.63 
----------------------+----------------------+----------
                Other |     1,799         10 |     1,809 
                      |      3.57       7.75 |      3.58 
----------------------+----------------------+----------
                    . |    12,584         30 |    12,614 
                      |     24.99      23.26 |     24.99 
----------------------+----------------------+----------
                Total |    50,356        129 |    50,485 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      | outcome ONS death any
                      |         cause
    Eth 16 categories |         0          1 |     Total
----------------------+----------------------+----------
British or Mixed Brit |    14,272         29 |    14,301 
                      |     28.34      22.48 |     28.33 
----------------------+----------------------+----------
                Irish |     2,828          8 |     2,836 
                      |      5.62       6.20 |      5.62 
----------------------+----------------------+----------
          Other White |     1,320          5 |     1,325 
                      |      2.62       3.88 |      2.62 
----------------------+----------------------+----------
White + Black Caribbe |     1,397          4 |     1,401 
                      |      2.77       3.10 |      2.78 
----------------------+----------------------+----------
White + Black African |     1,416          6 |     1,422 
                      |      2.81       4.65 |      2.82 
----------------------+----------------------+----------
        White + Asian |     1,462          3 |     1,465 
                      |      2.90       2.33 |      2.90 
----------------------+----------------------+----------
          Other mixed |     1,367          6 |     1,373 
                      |      2.71       4.65 |      2.72 
----------------------+----------------------+----------
Indian or British Ind |     1,354          6 |     1,360 
                      |      2.69       4.65 |      2.69 
----------------------+----------------------+----------
Pakistani or British  |       608          2 |       610 
                      |      1.21       1.55 |      1.21 
----------------------+----------------------+----------
Bangladeshi or Britis |       570          5 |       575 
                      |      1.13       3.88 |      1.14 
----------------------+----------------------+----------
          Other Asian |       266          2 |       268 
                      |      0.53       1.55 |      0.53 
----------------------+----------------------+----------
            Caribbean |       265          0 |       265 
                      |      0.53       0.00 |      0.52 
----------------------+----------------------+----------
              African |       278          0 |       278 
                      |      0.55       0.00 |      0.55 
----------------------+----------------------+----------
          Other Black |       271          0 |       271 
                      |      0.54       0.00 |      0.54 
----------------------+----------------------+----------
              Chinese |       286          1 |       287 
                      |      0.57       0.78 |      0.57 
----------------------+----------------------+----------
                Other |       267          0 |       267 
                      |      0.53       0.00 |      0.53 
----------------------+----------------------+----------
                    . |    22,129         52 |    22,181 
                      |     43.95      40.31 |     43.94 
----------------------+----------------------+----------
                Total |    50,356        129 |    50,485 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     | outcome ONS death any
                     |         cause
                 BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |       243          1 |       244 
                     |      0.48       0.78 |      0.48 
---------------------+----------------------+----------
  Normal (18.5-24.9) |     1,016          2 |     1,018 
                     |      2.02       1.55 |      2.02 
---------------------+----------------------+----------
Overweight (25-29.9) |     1,450          2 |     1,452 
                     |      2.88       1.55 |      2.88 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,759         10 |     1,769 
                     |      3.49       7.75 |      3.50 
---------------------+----------------------+----------
  Obese II (35-39.9) |     1,803          0 |     1,803 
                     |      3.58       0.00 |      3.57 
---------------------+----------------------+----------
     Obese III (40+) |     2,247          9 |     2,256 
                     |      4.46       6.98 |      4.47 
---------------------+----------------------+----------
        Unknown (.u) |    41,838        105 |    41,943 
                     |     83.08      81.40 |     83.08 
---------------------+----------------------+----------
               Total |    50,356        129 |    50,485 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     | outcome ONS death any
          Obesity (4 |         cause
         categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |    44,547        110 |    44,657 
                     |     88.46      85.27 |     88.46 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,759         10 |     1,769 
                     |      3.49       7.75 |      3.50 
---------------------+----------------------+----------
  Obese II (35-39.9) |     1,803          0 |     1,803 
                     |      3.58       0.00 |      3.57 
---------------------+----------------------+----------
     Obese III (40+) |     2,247          9 |     2,256 
                     |      4.46       6.98 |      4.47 
---------------------+----------------------+----------
               Total |    50,356        129 |    50,485 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  BMI with | outcome ONS death any
        SA |         cause
categories |         0          1 |     Total
-----------+----------------------+----------
         1 |       243          1 |       244 
           |      0.48       0.78 |      0.48 
-----------+----------------------+----------
         2 |       999          2 |     1,001 
           |      1.98       1.55 |      1.98 
-----------+----------------------+----------
         3 |     1,447          2 |     1,449 
           |      2.87       1.55 |      2.87 
-----------+----------------------+----------
         4 |     1,779         10 |     1,789 
           |      3.53       7.75 |      3.54 
-----------+----------------------+----------
         5 |     1,803          0 |     1,803 
           |      3.58       0.00 |      3.57 
-----------+----------------------+----------
         6 |     2,247          9 |     2,256 
           |      4.46       6.98 |      4.47 
-----------+----------------------+----------
        .u |    41,838        105 |    41,943 
           |     83.08      81.40 |     83.08 
-----------+----------------------+----------
     Total |    50,356        129 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      | outcome ONS death any
      Obesity with SA |         cause
           categories |         0          1 |     Total
----------------------+----------------------+----------
 No record of obesity |    44,527        110 |    44,637 
                      |     88.42      85.27 |     88.42 
----------------------+----------------------+----------
Obese I (30-34.9 / 27 |     1,779         10 |     1,789 
                      |      3.53       7.75 |      3.54 
----------------------+----------------------+----------
   Obese II (35-39.9) |     1,803          0 |     1,803 
                      |      3.58       0.00 |      3.57 
----------------------+----------------------+----------
      Obese III (40+) |     2,247          9 |     2,256 
                      |      4.46       6.98 |      4.47 
----------------------+----------------------+----------
                Total |    50,356        129 |    50,485 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             | outcome ONS death any
     Smoking |         cause
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |     2,047         11 |     2,058 
             |      4.07       8.53 |      4.08 
-------------+----------------------+----------
      Former |     1,039          3 |     1,042 
             |      2.06       2.33 |      2.06 
-------------+----------------------+----------
     Current |     6,036         16 |     6,052 
             |     11.99      12.40 |     11.99 
-------------+----------------------+----------
Unknown (.u) |    41,234         99 |    41,333 
             |     81.88      76.74 |     81.87 
-------------+----------------------+----------
       Total |    50,356        129 |    50,485 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic | outcome ONS death any
Respirator |         cause
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,376        111 |    40,487 
           |     80.18      86.05 |     80.20 
-----------+----------------------+----------
         1 |     9,980         18 |     9,998 
           |     19.82      13.95 |     19.80 
-----------+----------------------+----------
     Total |    50,356        129 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           | outcome ONS death any
    Asthma |         cause
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,322         98 |    40,420 
           |     80.07      75.97 |     80.06 
-----------+----------------------+----------
         1 |    10,034         31 |    10,065 
           |     19.93      24.03 |     19.94 
-----------+----------------------+----------
     Total |    50,356        129 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

      Asthma | outcome ONS death any
    detailed |         cause
  categories |         0          1 |     Total
-------------+----------------------+----------
          No |    40,322         98 |    40,420 
             |     80.07      75.97 |     80.06 
-------------+----------------------+----------
 Yes, no OCS |    10,034         31 |    10,065 
             |     19.93      24.03 |     19.94 
-------------+----------------------+----------
       Total |    50,356        129 |    50,485 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic | outcome ONS death any
   Cardiac |         cause
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,300        102 |    40,402 
           |     80.03      79.07 |     80.03 
-----------+----------------------+----------
         1 |    10,056         27 |    10,083 
           |     19.97      20.93 |     19.97 
-----------+----------------------+----------
     Total |    50,356        129 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           | outcome ONS death any
  Diabetes |         cause
   by type |         0          1 |     Total
-----------+----------------------+----------
     NO_DM |    37,587        103 |    37,690 
           |     74.64      79.84 |     74.66 
-----------+----------------------+----------
      T1DM |     1,488          3 |     1,491 
           |      2.95       2.33 |      2.95 
-----------+----------------------+----------
      T2DM |    10,252         22 |    10,274 
           |     20.36      17.05 |     20.35 
-----------+----------------------+----------
UNKNOWN_DM |     1,029          1 |     1,030 
           |      2.04       0.78 |      2.04 
-----------+----------------------+----------
     Total |    50,356        129 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Diabetes | outcome ONS death any
    exeter |         cause
      type |         0          1 |     Total
-----------+----------------------+----------
     NO_DM |    38,784         96 |    38,880 
           |     77.02      74.42 |     77.01 
-----------+----------------------+----------
T1DM_EX_OS |     1,482          3 |     1,485 
           |      2.94       2.33 |      2.94 
-----------+----------------------+----------
T2DM_EX_OS |    10,090         30 |    10,120 
           |     20.04      23.26 |     20.05 
-----------+----------------------+----------
     Total |    50,356        129 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           | outcome ONS death any
           |         cause
    Cancer |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,268        101 |    40,369 
           |     79.97      78.29 |     79.96 
-----------+----------------------+----------
         1 |    10,088         28 |    10,116 
           |     20.03      21.71 |     20.04 
-----------+----------------------+----------
     Total |    50,356        129 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic | outcome ONS death any
     liver |         cause
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,304         95 |    40,399 
           |     80.04      73.64 |     80.02 
-----------+----------------------+----------
         1 |    10,052         34 |    10,086 
           |     19.96      26.36 |     19.98 
-----------+----------------------+----------
     Total |    50,356        129 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           | outcome ONS death any
           |         cause
    Stroke |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,352        103 |    40,455 
           |     80.13      79.84 |     80.13 
-----------+----------------------+----------
         1 |    10,004         26 |    10,030 
           |     19.87      20.16 |     19.87 
-----------+----------------------+----------
     Total |    50,356        129 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           | outcome ONS death any
           |         cause
  Dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,236        105 |    40,341 
           |     79.90      81.40 |     79.91 
-----------+----------------------+----------
         1 |    10,120         24 |    10,144 
           |     20.10      18.60 |     20.09 
-----------+----------------------+----------
     Total |    50,356        129 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           | outcome ONS death any
Neurologic |         cause
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,294        116 |    40,410 
           |     80.02      89.92 |     80.04 
-----------+----------------------+----------
         1 |    10,062         13 |    10,075 
           |     19.98      10.08 |     19.96 
-----------+----------------------+----------
     Total |    50,356        129 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      | outcome ONS death any
       Reduced kidney |         cause
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |    49,767        127 |    49,894 
                      |     98.83      98.45 |     98.83 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |       589          2 |       591 
                      |      1.17       1.55 |      1.17 
----------------------+----------------------+----------
                Total |    50,356        129 |    50,485 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           | outcome ONS death any
Autoimmune |         cause
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,255        104 |    40,359 
           |     79.94      80.62 |     79.94 
-----------+----------------------+----------
         1 |    10,101         25 |    10,126 
           |     20.06      19.38 |     20.06 
-----------+----------------------+----------
     Total |    50,356        129 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        Index of |
        Multiple | outcome ONS death any
     Deprivation |         cause
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |    35,244         90 |    35,334 
                 |     69.99      69.77 |     69.99 
-----------------+----------------------+----------
               4 |     9,987         26 |    10,013 
                 |     19.83      20.16 |     19.83 
-----------------+----------------------+----------
 5 most deprived |     5,125         13 |     5,138 
                 |     10.18      10.08 |     10.18 
-----------------+----------------------+----------
           Total |    50,356        129 |    50,485 
                 |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Rural-Urba | outcome ONS death any
         n |         cause
 Indicator |         0          1 |     Total
-----------+----------------------+----------
     rural |     5,097          9 |     5,106 
           |     10.12       6.98 |     10.11 
-----------+----------------------+----------
     urban |    45,259        120 |    45,379 
           |     89.88      93.02 |     89.89 
-----------+----------------------+----------
     Total |    50,356        129 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      | outcome ONS death any
                      |         cause
    Region of England |         0          1 |     Total
----------------------+----------------------+----------
        East Midlands |     5,079         11 |     5,090 
                      |     10.09       8.53 |     10.08 
----------------------+----------------------+----------
      East of England |     5,003         14 |     5,017 
                      |      9.94      10.85 |      9.94 
----------------------+----------------------+----------
               London |    10,207         23 |    10,230 
                      |     20.27      17.83 |     20.26 
----------------------+----------------------+----------
           North East |     4,999         11 |     5,010 
                      |      9.93       8.53 |      9.92 
----------------------+----------------------+----------
           North West |     5,022          8 |     5,030 
                      |      9.97       6.20 |      9.96 
----------------------+----------------------+----------
           South East |    10,071         35 |    10,106 
                      |     20.00      27.13 |     20.02 
----------------------+----------------------+----------
        West Midlands |     4,998         15 |     5,013 
                      |      9.93      11.63 |      9.93 
----------------------+----------------------+----------
Yorkshire and the H.. |     4,977         12 |     4,989 
                      |      9.88       9.30 |      9.88 
----------------------+----------------------+----------
                Total |    50,356        129 |    50,485 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome ONS COVID
   Grouped |         death
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     9,819          8 |     9,827 
           |     19.46      25.00 |     19.47 
-----------+----------------------+----------
    30-<40 |     8,582          3 |     8,585 
           |     17.01       9.38 |     17.01 
-----------+----------------------+----------
    40-<50 |     8,220          5 |     8,225 
           |     16.29      15.62 |     16.29 
-----------+----------------------+----------
    50-<60 |     8,525          4 |     8,529 
           |     16.90      12.50 |     16.89 
-----------+----------------------+----------
    60-<70 |     6,771          5 |     6,776 
           |     13.42      15.62 |     13.42 
-----------+----------------------+----------
    70-<80 |     5,404          5 |     5,409 
           |     10.71      15.62 |     10.71 
-----------+----------------------+----------
       80+ |     3,132          2 |     3,134 
           |      6.21       6.25 |      6.21 
-----------+----------------------+----------
     Total |    50,453         32 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome ONS COVID
           |         death
      Male |         0          1 |     Total
-----------+----------------------+----------
    Female |    25,861         13 |    25,874 
           |     51.26      40.62 |     51.25 
-----------+----------------------+----------
      Male |    24,592         19 |    24,611 
           |     48.74      59.38 |     48.75 
-----------+----------------------+----------
     Total |    50,453         32 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   outcome ONS COVID
                      |         death
     Eth 5 categories |         0          1 |     Total
----------------------+----------------------+----------
                White |    30,415         17 |    30,432 
                      |     60.28      53.12 |     60.28 
----------------------+----------------------+----------
                Mixed |     1,953          4 |     1,957 
                      |      3.87      12.50 |      3.88 
----------------------+----------------------+----------
Asian or Asian Britis |     1,840          1 |     1,841 
                      |      3.65       3.12 |      3.65 
----------------------+----------------------+----------
                Black |     1,832          0 |     1,832 
                      |      3.63       0.00 |      3.63 
----------------------+----------------------+----------
                Other |     1,806          3 |     1,809 
                      |      3.58       9.38 |      3.58 
----------------------+----------------------+----------
                    . |    12,607          7 |    12,614 
                      |     24.99      21.88 |     24.99 
----------------------+----------------------+----------
                Total |    50,453         32 |    50,485 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   outcome ONS COVID
                      |         death
    Eth 16 categories |         0          1 |     Total
----------------------+----------------------+----------
British or Mixed Brit |    14,296          5 |    14,301 
                      |     28.34      15.62 |     28.33 
----------------------+----------------------+----------
                Irish |     2,834          2 |     2,836 
                      |      5.62       6.25 |      5.62 
----------------------+----------------------+----------
          Other White |     1,323          2 |     1,325 
                      |      2.62       6.25 |      2.62 
----------------------+----------------------+----------
White + Black Caribbe |     1,400          1 |     1,401 
                      |      2.77       3.12 |      2.78 
----------------------+----------------------+----------
White + Black African |     1,421          1 |     1,422 
                      |      2.82       3.12 |      2.82 
----------------------+----------------------+----------
        White + Asian |     1,463          2 |     1,465 
                      |      2.90       6.25 |      2.90 
----------------------+----------------------+----------
          Other mixed |     1,373          0 |     1,373 
                      |      2.72       0.00 |      2.72 
----------------------+----------------------+----------
Indian or British Ind |     1,360          0 |     1,360 
                      |      2.70       0.00 |      2.69 
----------------------+----------------------+----------
Pakistani or British  |       610          0 |       610 
                      |      1.21       0.00 |      1.21 
----------------------+----------------------+----------
Bangladeshi or Britis |       572          3 |       575 
                      |      1.13       9.38 |      1.14 
----------------------+----------------------+----------
          Other Asian |       266          2 |       268 
                      |      0.53       6.25 |      0.53 
----------------------+----------------------+----------
            Caribbean |       265          0 |       265 
                      |      0.53       0.00 |      0.52 
----------------------+----------------------+----------
              African |       278          0 |       278 
                      |      0.55       0.00 |      0.55 
----------------------+----------------------+----------
          Other Black |       271          0 |       271 
                      |      0.54       0.00 |      0.54 
----------------------+----------------------+----------
              Chinese |       287          0 |       287 
                      |      0.57       0.00 |      0.57 
----------------------+----------------------+----------
                Other |       267          0 |       267 
                      |      0.53       0.00 |      0.53 
----------------------+----------------------+----------
                    . |    22,167         14 |    22,181 
                      |     43.94      43.75 |     43.94 
----------------------+----------------------+----------
                Total |    50,453         32 |    50,485 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   outcome ONS COVID
                     |         death
                 BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |       244          0 |       244 
                     |      0.48       0.00 |      0.48 
---------------------+----------------------+----------
  Normal (18.5-24.9) |     1,018          0 |     1,018 
                     |      2.02       0.00 |      2.02 
---------------------+----------------------+----------
Overweight (25-29.9) |     1,452          0 |     1,452 
                     |      2.88       0.00 |      2.88 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,767          2 |     1,769 
                     |      3.50       6.25 |      3.50 
---------------------+----------------------+----------
  Obese II (35-39.9) |     1,803          0 |     1,803 
                     |      3.57       0.00 |      3.57 
---------------------+----------------------+----------
     Obese III (40+) |     2,254          2 |     2,256 
                     |      4.47       6.25 |      4.47 
---------------------+----------------------+----------
        Unknown (.u) |    41,915         28 |    41,943 
                     |     83.08      87.50 |     83.08 
---------------------+----------------------+----------
               Total |    50,453         32 |    50,485 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   outcome ONS COVID
          Obesity (4 |         death
         categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |    44,629         28 |    44,657 
                     |     88.46      87.50 |     88.46 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,767          2 |     1,769 
                     |      3.50       6.25 |      3.50 
---------------------+----------------------+----------
  Obese II (35-39.9) |     1,803          0 |     1,803 
                     |      3.57       0.00 |      3.57 
---------------------+----------------------+----------
     Obese III (40+) |     2,254          2 |     2,256 
                     |      4.47       6.25 |      4.47 
---------------------+----------------------+----------
               Total |    50,453         32 |    50,485 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  BMI with |   outcome ONS COVID
        SA |         death
categories |         0          1 |     Total
-----------+----------------------+----------
         1 |       244          0 |       244 
           |      0.48       0.00 |      0.48 
-----------+----------------------+----------
         2 |     1,001          0 |     1,001 
           |      1.98       0.00 |      1.98 
-----------+----------------------+----------
         3 |     1,449          0 |     1,449 
           |      2.87       0.00 |      2.87 
-----------+----------------------+----------
         4 |     1,787          2 |     1,789 
           |      3.54       6.25 |      3.54 
-----------+----------------------+----------
         5 |     1,803          0 |     1,803 
           |      3.57       0.00 |      3.57 
-----------+----------------------+----------
         6 |     2,254          2 |     2,256 
           |      4.47       6.25 |      4.47 
-----------+----------------------+----------
        .u |    41,915         28 |    41,943 
           |     83.08      87.50 |     83.08 
-----------+----------------------+----------
     Total |    50,453         32 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   outcome ONS COVID
      Obesity with SA |         death
           categories |         0          1 |     Total
----------------------+----------------------+----------
 No record of obesity |    44,609         28 |    44,637 
                      |     88.42      87.50 |     88.42 
----------------------+----------------------+----------
Obese I (30-34.9 / 27 |     1,787          2 |     1,789 
                      |      3.54       6.25 |      3.54 
----------------------+----------------------+----------
   Obese II (35-39.9) |     1,803          0 |     1,803 
                      |      3.57       0.00 |      3.57 
----------------------+----------------------+----------
      Obese III (40+) |     2,254          2 |     2,256 
                      |      4.47       6.25 |      4.47 
----------------------+----------------------+----------
                Total |    50,453         32 |    50,485 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   outcome ONS COVID
     Smoking |         death
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |     2,056          2 |     2,058 
             |      4.08       6.25 |      4.08 
-------------+----------------------+----------
      Former |     1,042          0 |     1,042 
             |      2.07       0.00 |      2.06 
-------------+----------------------+----------
     Current |     6,050          2 |     6,052 
             |     11.99       6.25 |     11.99 
-------------+----------------------+----------
Unknown (.u) |    41,305         28 |    41,333 
             |     81.87      87.50 |     81.87 
-------------+----------------------+----------
       Total |    50,453         32 |    50,485 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |   outcome ONS COVID
Respirator |         death
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,464         23 |    40,487 
           |     80.20      71.88 |     80.20 
-----------+----------------------+----------
         1 |     9,989          9 |     9,998 
           |     19.80      28.12 |     19.80 
-----------+----------------------+----------
     Total |    50,453         32 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome ONS COVID
    Asthma |         death
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,395         25 |    40,420 
           |     80.06      78.12 |     80.06 
-----------+----------------------+----------
         1 |    10,058          7 |    10,065 
           |     19.94      21.88 |     19.94 
-----------+----------------------+----------
     Total |    50,453         32 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

      Asthma |   outcome ONS COVID
    detailed |         death
  categories |         0          1 |     Total
-------------+----------------------+----------
          No |    40,395         25 |    40,420 
             |     80.06      78.12 |     80.06 
-------------+----------------------+----------
 Yes, no OCS |    10,058          7 |    10,065 
             |     19.94      21.88 |     19.94 
-------------+----------------------+----------
       Total |    50,453         32 |    50,485 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |   outcome ONS COVID
   Cardiac |         death
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,378         24 |    40,402 
           |     80.03      75.00 |     80.03 
-----------+----------------------+----------
         1 |    10,075          8 |    10,083 
           |     19.97      25.00 |     19.97 
-----------+----------------------+----------
     Total |    50,453         32 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome ONS COVID
  Diabetes |         death
   by type |         0          1 |     Total
-----------+----------------------+----------
     NO_DM |    37,666         24 |    37,690 
           |     74.66      75.00 |     74.66 
-----------+----------------------+----------
      T1DM |     1,490          1 |     1,491 
           |      2.95       3.12 |      2.95 
-----------+----------------------+----------
      T2DM |    10,267          7 |    10,274 
           |     20.35      21.88 |     20.35 
-----------+----------------------+----------
UNKNOWN_DM |     1,030          0 |     1,030 
           |      2.04       0.00 |      2.04 
-----------+----------------------+----------
     Total |    50,453         32 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Diabetes |   outcome ONS COVID
    exeter |         death
      type |         0          1 |     Total
-----------+----------------------+----------
     NO_DM |    38,852         28 |    38,880 
           |     77.01      87.50 |     77.01 
-----------+----------------------+----------
T1DM_EX_OS |     1,484          1 |     1,485 
           |      2.94       3.12 |      2.94 
-----------+----------------------+----------
T2DM_EX_OS |    10,117          3 |    10,120 
           |     20.05       9.38 |     20.05 
-----------+----------------------+----------
     Total |    50,453         32 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome ONS COVID
           |         death
    Cancer |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,343         26 |    40,369 
           |     79.96      81.25 |     79.96 
-----------+----------------------+----------
         1 |    10,110          6 |    10,116 
           |     20.04      18.75 |     20.04 
-----------+----------------------+----------
     Total |    50,453         32 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |   outcome ONS COVID
     liver |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,375         24 |    40,399 
           |     80.02      75.00 |     80.02 
-----------+----------------------+----------
         1 |    10,078          8 |    10,086 
           |     19.98      25.00 |     19.98 
-----------+----------------------+----------
     Total |    50,453         32 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome ONS COVID
           |         death
    Stroke |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,431         24 |    40,455 
           |     80.14      75.00 |     80.13 
-----------+----------------------+----------
         1 |    10,022          8 |    10,030 
           |     19.86      25.00 |     19.87 
-----------+----------------------+----------
     Total |    50,453         32 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome ONS COVID
           |         death
  Dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,319         22 |    40,341 
           |     79.91      68.75 |     79.91 
-----------+----------------------+----------
         1 |    10,134         10 |    10,144 
           |     20.09      31.25 |     20.09 
-----------+----------------------+----------
     Total |    50,453         32 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome ONS COVID
Neurologic |         death
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,382         28 |    40,410 
           |     80.04      87.50 |     80.04 
-----------+----------------------+----------
         1 |    10,071          4 |    10,075 
           |     19.96      12.50 |     19.96 
-----------+----------------------+----------
     Total |    50,453         32 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   outcome ONS COVID
       Reduced kidney |         death
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |    49,863         31 |    49,894 
                      |     98.83      96.88 |     98.83 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |       590          1 |       591 
                      |      1.17       3.12 |      1.17 
----------------------+----------------------+----------
                Total |    50,453         32 |    50,485 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome ONS COVID
Autoimmune |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,330         29 |    40,359 
           |     79.94      90.62 |     79.94 
-----------+----------------------+----------
         1 |    10,123          3 |    10,126 
           |     20.06       9.38 |     20.06 
-----------+----------------------+----------
     Total |    50,453         32 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        Index of |
        Multiple |   outcome ONS COVID
     Deprivation |         death
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |    35,313         21 |    35,334 
                 |     69.99      65.62 |     69.99 
-----------------+----------------------+----------
               4 |    10,005          8 |    10,013 
                 |     19.83      25.00 |     19.83 
-----------------+----------------------+----------
 5 most deprived |     5,135          3 |     5,138 
                 |     10.18       9.38 |     10.18 
-----------------+----------------------+----------
           Total |    50,453         32 |    50,485 
                 |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Rural-Urba |   outcome ONS COVID
         n |         death
 Indicator |         0          1 |     Total
-----------+----------------------+----------
     rural |     5,104          2 |     5,106 
           |     10.12       6.25 |     10.11 
-----------+----------------------+----------
     urban |    45,349         30 |    45,379 
           |     89.88      93.75 |     89.89 
-----------+----------------------+----------
     Total |    50,453         32 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   outcome ONS COVID
                      |         death
    Region of England |         0          1 |     Total
----------------------+----------------------+----------
        East Midlands |     5,087          3 |     5,090 
                      |     10.08       9.38 |     10.08 
----------------------+----------------------+----------
      East of England |     5,016          1 |     5,017 
                      |      9.94       3.12 |      9.94 
----------------------+----------------------+----------
               London |    10,222          8 |    10,230 
                      |     20.26      25.00 |     20.26 
----------------------+----------------------+----------
           North East |     5,009          1 |     5,010 
                      |      9.93       3.12 |      9.92 
----------------------+----------------------+----------
           North West |     5,028          2 |     5,030 
                      |      9.97       6.25 |      9.96 
----------------------+----------------------+----------
           South East |    10,098          8 |    10,106 
                      |     20.01      25.00 |     20.02 
----------------------+----------------------+----------
        West Midlands |     5,008          5 |     5,013 
                      |      9.93      15.62 |      9.93 
----------------------+----------------------+----------
Yorkshire and the H.. |     4,985          4 |     4,989 
                      |      9.88      12.50 |      9.88 
----------------------+----------------------+----------
                Total |    50,453         32 |    50,485 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           | outcome ONS non-COVID
   Grouped |         death
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     9,803         24 |     9,827 
           |     19.46      24.74 |     19.47 
-----------+----------------------+----------
    30-<40 |     8,571         14 |     8,585 
           |     17.01      14.43 |     17.01 
-----------+----------------------+----------
    40-<50 |     8,209         16 |     8,225 
           |     16.29      16.49 |     16.29 
-----------+----------------------+----------
    50-<60 |     8,516         13 |     8,529 
           |     16.90      13.40 |     16.89 
-----------+----------------------+----------
    60-<70 |     6,762         14 |     6,776 
           |     13.42      14.43 |     13.42 
-----------+----------------------+----------
    70-<80 |     5,400          9 |     5,409 
           |     10.72       9.28 |     10.71 
-----------+----------------------+----------
       80+ |     3,127          7 |     3,134 
           |      6.21       7.22 |      6.21 
-----------+----------------------+----------
     Total |    50,388         97 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           | outcome ONS non-COVID
           |         death
      Male |         0          1 |     Total
-----------+----------------------+----------
    Female |    25,827         47 |    25,874 
           |     51.26      48.45 |     51.25 
-----------+----------------------+----------
      Male |    24,561         50 |    24,611 
           |     48.74      51.55 |     48.75 
-----------+----------------------+----------
     Total |    50,388         97 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      | outcome ONS non-COVID
                      |         death
     Eth 5 categories |         0          1 |     Total
----------------------+----------------------+----------
                White |    30,375         57 |    30,432 
                      |     60.28      58.76 |     60.28 
----------------------+----------------------+----------
                Mixed |     1,951          6 |     1,957 
                      |      3.87       6.19 |      3.88 
----------------------+----------------------+----------
Asian or Asian Britis |     1,837          4 |     1,841 
                      |      3.65       4.12 |      3.65 
----------------------+----------------------+----------
                Black |     1,832          0 |     1,832 
                      |      3.64       0.00 |      3.63 
----------------------+----------------------+----------
                Other |     1,802          7 |     1,809 
                      |      3.58       7.22 |      3.58 
----------------------+----------------------+----------
                    . |    12,591         23 |    12,614 
                      |     24.99      23.71 |     24.99 
----------------------+----------------------+----------
                Total |    50,388         97 |    50,485 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      | outcome ONS non-COVID
                      |         death
    Eth 16 categories |         0          1 |     Total
----------------------+----------------------+----------
British or Mixed Brit |    14,277         24 |    14,301 
                      |     28.33      24.74 |     28.33 
----------------------+----------------------+----------
                Irish |     2,830          6 |     2,836 
                      |      5.62       6.19 |      5.62 
----------------------+----------------------+----------
          Other White |     1,322          3 |     1,325 
                      |      2.62       3.09 |      2.62 
----------------------+----------------------+----------
White + Black Caribbe |     1,398          3 |     1,401 
                      |      2.77       3.09 |      2.78 
----------------------+----------------------+----------
White + Black African |     1,417          5 |     1,422 
                      |      2.81       5.15 |      2.82 
----------------------+----------------------+----------
        White + Asian |     1,464          1 |     1,465 
                      |      2.91       1.03 |      2.90 
----------------------+----------------------+----------
          Other mixed |     1,367          6 |     1,373 
                      |      2.71       6.19 |      2.72 
----------------------+----------------------+----------
Indian or British Ind |     1,354          6 |     1,360 
                      |      2.69       6.19 |      2.69 
----------------------+----------------------+----------
Pakistani or British  |       608          2 |       610 
                      |      1.21       2.06 |      1.21 
----------------------+----------------------+----------
Bangladeshi or Britis |       573          2 |       575 
                      |      1.14       2.06 |      1.14 
----------------------+----------------------+----------
          Other Asian |       268          0 |       268 
                      |      0.53       0.00 |      0.53 
----------------------+----------------------+----------
            Caribbean |       265          0 |       265 
                      |      0.53       0.00 |      0.52 
----------------------+----------------------+----------
              African |       278          0 |       278 
                      |      0.55       0.00 |      0.55 
----------------------+----------------------+----------
          Other Black |       271          0 |       271 
                      |      0.54       0.00 |      0.54 
----------------------+----------------------+----------
              Chinese |       286          1 |       287 
                      |      0.57       1.03 |      0.57 
----------------------+----------------------+----------
                Other |       267          0 |       267 
                      |      0.53       0.00 |      0.53 
----------------------+----------------------+----------
                    . |    22,143         38 |    22,181 
                      |     43.94      39.18 |     43.94 
----------------------+----------------------+----------
                Total |    50,388         97 |    50,485 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     | outcome ONS non-COVID
                     |         death
                 BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |       243          1 |       244 
                     |      0.48       1.03 |      0.48 
---------------------+----------------------+----------
  Normal (18.5-24.9) |     1,016          2 |     1,018 
                     |      2.02       2.06 |      2.02 
---------------------+----------------------+----------
Overweight (25-29.9) |     1,450          2 |     1,452 
                     |      2.88       2.06 |      2.88 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,761          8 |     1,769 
                     |      3.49       8.25 |      3.50 
---------------------+----------------------+----------
  Obese II (35-39.9) |     1,803          0 |     1,803 
                     |      3.58       0.00 |      3.57 
---------------------+----------------------+----------
     Obese III (40+) |     2,249          7 |     2,256 
                     |      4.46       7.22 |      4.47 
---------------------+----------------------+----------
        Unknown (.u) |    41,866         77 |    41,943 
                     |     83.09      79.38 |     83.08 
---------------------+----------------------+----------
               Total |    50,388         97 |    50,485 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     | outcome ONS non-COVID
          Obesity (4 |         death
         categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |    44,575         82 |    44,657 
                     |     88.46      84.54 |     88.46 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,761          8 |     1,769 
                     |      3.49       8.25 |      3.50 
---------------------+----------------------+----------
  Obese II (35-39.9) |     1,803          0 |     1,803 
                     |      3.58       0.00 |      3.57 
---------------------+----------------------+----------
     Obese III (40+) |     2,249          7 |     2,256 
                     |      4.46       7.22 |      4.47 
---------------------+----------------------+----------
               Total |    50,388         97 |    50,485 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  BMI with | outcome ONS non-COVID
        SA |         death
categories |         0          1 |     Total
-----------+----------------------+----------
         1 |       243          1 |       244 
           |      0.48       1.03 |      0.48 
-----------+----------------------+----------
         2 |       999          2 |     1,001 
           |      1.98       2.06 |      1.98 
-----------+----------------------+----------
         3 |     1,447          2 |     1,449 
           |      2.87       2.06 |      2.87 
-----------+----------------------+----------
         4 |     1,781          8 |     1,789 
           |      3.53       8.25 |      3.54 
-----------+----------------------+----------
         5 |     1,803          0 |     1,803 
           |      3.58       0.00 |      3.57 
-----------+----------------------+----------
         6 |     2,249          7 |     2,256 
           |      4.46       7.22 |      4.47 
-----------+----------------------+----------
        .u |    41,866         77 |    41,943 
           |     83.09      79.38 |     83.08 
-----------+----------------------+----------
     Total |    50,388         97 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      | outcome ONS non-COVID
      Obesity with SA |         death
           categories |         0          1 |     Total
----------------------+----------------------+----------
 No record of obesity |    44,555         82 |    44,637 
                      |     88.42      84.54 |     88.42 
----------------------+----------------------+----------
Obese I (30-34.9 / 27 |     1,781          8 |     1,789 
                      |      3.53       8.25 |      3.54 
----------------------+----------------------+----------
   Obese II (35-39.9) |     1,803          0 |     1,803 
                      |      3.58       0.00 |      3.57 
----------------------+----------------------+----------
      Obese III (40+) |     2,249          7 |     2,256 
                      |      4.46       7.22 |      4.47 
----------------------+----------------------+----------
                Total |    50,388         97 |    50,485 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             | outcome ONS non-COVID
     Smoking |         death
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |     2,049          9 |     2,058 
             |      4.07       9.28 |      4.08 
-------------+----------------------+----------
      Former |     1,039          3 |     1,042 
             |      2.06       3.09 |      2.06 
-------------+----------------------+----------
     Current |     6,038         14 |     6,052 
             |     11.98      14.43 |     11.99 
-------------+----------------------+----------
Unknown (.u) |    41,262         71 |    41,333 
             |     81.89      73.20 |     81.87 
-------------+----------------------+----------
       Total |    50,388         97 |    50,485 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic | outcome ONS non-COVID
Respirator |         death
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,399         88 |    40,487 
           |     80.18      90.72 |     80.20 
-----------+----------------------+----------
         1 |     9,989          9 |     9,998 
           |     19.82       9.28 |     19.80 
-----------+----------------------+----------
     Total |    50,388         97 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           | outcome ONS non-COVID
    Asthma |         death
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,347         73 |    40,420 
           |     80.07      75.26 |     80.06 
-----------+----------------------+----------
         1 |    10,041         24 |    10,065 
           |     19.93      24.74 |     19.94 
-----------+----------------------+----------
     Total |    50,388         97 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

      Asthma | outcome ONS non-COVID
    detailed |         death
  categories |         0          1 |     Total
-------------+----------------------+----------
          No |    40,347         73 |    40,420 
             |     80.07      75.26 |     80.06 
-------------+----------------------+----------
 Yes, no OCS |    10,041         24 |    10,065 
             |     19.93      24.74 |     19.94 
-------------+----------------------+----------
       Total |    50,388         97 |    50,485 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic | outcome ONS non-COVID
   Cardiac |         death
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,324         78 |    40,402 
           |     80.03      80.41 |     80.03 
-----------+----------------------+----------
         1 |    10,064         19 |    10,083 
           |     19.97      19.59 |     19.97 
-----------+----------------------+----------
     Total |    50,388         97 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           | outcome ONS non-COVID
  Diabetes |         death
   by type |         0          1 |     Total
-----------+----------------------+----------
     NO_DM |    37,611         79 |    37,690 
           |     74.64      81.44 |     74.66 
-----------+----------------------+----------
      T1DM |     1,489          2 |     1,491 
           |      2.96       2.06 |      2.95 
-----------+----------------------+----------
      T2DM |    10,259         15 |    10,274 
           |     20.36      15.46 |     20.35 
-----------+----------------------+----------
UNKNOWN_DM |     1,029          1 |     1,030 
           |      2.04       1.03 |      2.04 
-----------+----------------------+----------
     Total |    50,388         97 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Diabetes | outcome ONS non-COVID
    exeter |         death
      type |         0          1 |     Total
-----------+----------------------+----------
     NO_DM |    38,812         68 |    38,880 
           |     77.03      70.10 |     77.01 
-----------+----------------------+----------
T1DM_EX_OS |     1,483          2 |     1,485 
           |      2.94       2.06 |      2.94 
-----------+----------------------+----------
T2DM_EX_OS |    10,093         27 |    10,120 
           |     20.03      27.84 |     20.05 
-----------+----------------------+----------
     Total |    50,388         97 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           | outcome ONS non-COVID
           |         death
    Cancer |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,294         75 |    40,369 
           |     79.97      77.32 |     79.96 
-----------+----------------------+----------
         1 |    10,094         22 |    10,116 
           |     20.03      22.68 |     20.04 
-----------+----------------------+----------
     Total |    50,388         97 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic | outcome ONS non-COVID
     liver |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,328         71 |    40,399 
           |     80.03      73.20 |     80.02 
-----------+----------------------+----------
         1 |    10,060         26 |    10,086 
           |     19.97      26.80 |     19.98 
-----------+----------------------+----------
     Total |    50,388         97 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           | outcome ONS non-COVID
           |         death
    Stroke |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,376         79 |    40,455 
           |     80.13      81.44 |     80.13 
-----------+----------------------+----------
         1 |    10,012         18 |    10,030 
           |     19.87      18.56 |     19.87 
-----------+----------------------+----------
     Total |    50,388         97 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           | outcome ONS non-COVID
           |         death
  Dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,258         83 |    40,341 
           |     79.90      85.57 |     79.91 
-----------+----------------------+----------
         1 |    10,130         14 |    10,144 
           |     20.10      14.43 |     20.09 
-----------+----------------------+----------
     Total |    50,388         97 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           | outcome ONS non-COVID
Neurologic |         death
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,322         88 |    40,410 
           |     80.02      90.72 |     80.04 
-----------+----------------------+----------
         1 |    10,066          9 |    10,075 
           |     19.98       9.28 |     19.96 
-----------+----------------------+----------
     Total |    50,388         97 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      | outcome ONS non-COVID
       Reduced kidney |         death
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |    49,798         96 |    49,894 
                      |     98.83      98.97 |     98.83 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |       590          1 |       591 
                      |      1.17       1.03 |      1.17 
----------------------+----------------------+----------
                Total |    50,388         97 |    50,485 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           | outcome ONS non-COVID
Autoimmune |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,284         75 |    40,359 
           |     79.95      77.32 |     79.94 
-----------+----------------------+----------
         1 |    10,104         22 |    10,126 
           |     20.05      22.68 |     20.06 
-----------+----------------------+----------
     Total |    50,388         97 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        Index of |
        Multiple | outcome ONS non-COVID
     Deprivation |         death
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |    35,265         69 |    35,334 
                 |     69.99      71.13 |     69.99 
-----------------+----------------------+----------
               4 |     9,995         18 |    10,013 
                 |     19.84      18.56 |     19.83 
-----------------+----------------------+----------
 5 most deprived |     5,128         10 |     5,138 
                 |     10.18      10.31 |     10.18 
-----------------+----------------------+----------
           Total |    50,388         97 |    50,485 
                 |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Rural-Urba | outcome ONS non-COVID
         n |         death
 Indicator |         0          1 |     Total
-----------+----------------------+----------
     rural |     5,099          7 |     5,106 
           |     10.12       7.22 |     10.11 
-----------+----------------------+----------
     urban |    45,289         90 |    45,379 
           |     89.88      92.78 |     89.89 
-----------+----------------------+----------
     Total |    50,388         97 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      | outcome ONS non-COVID
                      |         death
    Region of England |         0          1 |     Total
----------------------+----------------------+----------
        East Midlands |     5,082          8 |     5,090 
                      |     10.09       8.25 |     10.08 
----------------------+----------------------+----------
      East of England |     5,004         13 |     5,017 
                      |      9.93      13.40 |      9.94 
----------------------+----------------------+----------
               London |    10,215         15 |    10,230 
                      |     20.27      15.46 |     20.26 
----------------------+----------------------+----------
           North East |     5,000         10 |     5,010 
                      |      9.92      10.31 |      9.92 
----------------------+----------------------+----------
           North West |     5,024          6 |     5,030 
                      |      9.97       6.19 |      9.96 
----------------------+----------------------+----------
           South East |    10,079         27 |    10,106 
                      |     20.00      27.84 |     20.02 
----------------------+----------------------+----------
        West Midlands |     5,003         10 |     5,013 
                      |      9.93      10.31 |      9.93 
----------------------+----------------------+----------
Yorkshire and the H.. |     4,981          8 |     4,989 
                      |      9.89       8.25 |      9.88 
----------------------+----------------------+----------
                Total |    50,388         97 |    50,485 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Grouped |  outcome CPNS death
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     9,814         13 |     9,827 
           |     19.47      15.12 |     19.47 
-----------+----------------------+----------
    30-<40 |     8,575         10 |     8,585 
           |     17.01      11.63 |     17.01 
-----------+----------------------+----------
    40-<50 |     8,213         12 |     8,225 
           |     16.30      13.95 |     16.29 
-----------+----------------------+----------
    50-<60 |     8,508         21 |     8,529 
           |     16.88      24.42 |     16.89 
-----------+----------------------+----------
    60-<70 |     6,769          7 |     6,776 
           |     13.43       8.14 |     13.42 
-----------+----------------------+----------
    70-<80 |     5,394         15 |     5,409 
           |     10.70      17.44 |     10.71 
-----------+----------------------+----------
       80+ |     3,126          8 |     3,134 
           |      6.20       9.30 |      6.21 
-----------+----------------------+----------
     Total |    50,399         86 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  outcome CPNS death
      Male |         0          1 |     Total
-----------+----------------------+----------
    Female |    25,828         46 |    25,874 
           |     51.25      53.49 |     51.25 
-----------+----------------------+----------
      Male |    24,571         40 |    24,611 
           |     48.75      46.51 |     48.75 
-----------+----------------------+----------
     Total |    50,399         86 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |  outcome CPNS death
     Eth 5 categories |         0          1 |     Total
----------------------+----------------------+----------
                White |    30,382         50 |    30,432 
                      |     60.28      58.14 |     60.28 
----------------------+----------------------+----------
                Mixed |     1,956          1 |     1,957 
                      |      3.88       1.16 |      3.88 
----------------------+----------------------+----------
Asian or Asian Britis |     1,837          4 |     1,841 
                      |      3.64       4.65 |      3.65 
----------------------+----------------------+----------
                Black |     1,829          3 |     1,832 
                      |      3.63       3.49 |      3.63 
----------------------+----------------------+----------
                Other |     1,804          5 |     1,809 
                      |      3.58       5.81 |      3.58 
----------------------+----------------------+----------
                    . |    12,591         23 |    12,614 
                      |     24.98      26.74 |     24.99 
----------------------+----------------------+----------
                Total |    50,399         86 |    50,485 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |  outcome CPNS death
    Eth 16 categories |         0          1 |     Total
----------------------+----------------------+----------
British or Mixed Brit |    14,270         31 |    14,301 
                      |     28.31      36.05 |     28.33 
----------------------+----------------------+----------
                Irish |     2,832          4 |     2,836 
                      |      5.62       4.65 |      5.62 
----------------------+----------------------+----------
          Other White |     1,324          1 |     1,325 
                      |      2.63       1.16 |      2.62 
----------------------+----------------------+----------
White + Black Caribbe |     1,397          4 |     1,401 
                      |      2.77       4.65 |      2.78 
----------------------+----------------------+----------
White + Black African |     1,421          1 |     1,422 
                      |      2.82       1.16 |      2.82 
----------------------+----------------------+----------
        White + Asian |     1,463          2 |     1,465 
                      |      2.90       2.33 |      2.90 
----------------------+----------------------+----------
          Other mixed |     1,372          1 |     1,373 
                      |      2.72       1.16 |      2.72 
----------------------+----------------------+----------
Indian or British Ind |     1,360          0 |     1,360 
                      |      2.70       0.00 |      2.69 
----------------------+----------------------+----------
Pakistani or British  |       610          0 |       610 
                      |      1.21       0.00 |      1.21 
----------------------+----------------------+----------
Bangladeshi or Britis |       575          0 |       575 
                      |      1.14       0.00 |      1.14 
----------------------+----------------------+----------
          Other Asian |       268          0 |       268 
                      |      0.53       0.00 |      0.53 
----------------------+----------------------+----------
            Caribbean |       265          0 |       265 
                      |      0.53       0.00 |      0.52 
----------------------+----------------------+----------
              African |       277          1 |       278 
                      |      0.55       1.16 |      0.55 
----------------------+----------------------+----------
          Other Black |       271          0 |       271 
                      |      0.54       0.00 |      0.54 
----------------------+----------------------+----------
              Chinese |       284          3 |       287 
                      |      0.56       3.49 |      0.57 
----------------------+----------------------+----------
                Other |       266          1 |       267 
                      |      0.53       1.16 |      0.53 
----------------------+----------------------+----------
                    . |    22,144         37 |    22,181 
                      |     43.94      43.02 |     43.94 
----------------------+----------------------+----------
                Total |    50,399         86 |    50,485 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |  outcome CPNS death
                 BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |       244          0 |       244 
                     |      0.48       0.00 |      0.48 
---------------------+----------------------+----------
  Normal (18.5-24.9) |     1,014          4 |     1,018 
                     |      2.01       4.65 |      2.02 
---------------------+----------------------+----------
Overweight (25-29.9) |     1,449          3 |     1,452 
                     |      2.88       3.49 |      2.88 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,768          1 |     1,769 
                     |      3.51       1.16 |      3.50 
---------------------+----------------------+----------
  Obese II (35-39.9) |     1,799          4 |     1,803 
                     |      3.57       4.65 |      3.57 
---------------------+----------------------+----------
     Obese III (40+) |     2,253          3 |     2,256 
                     |      4.47       3.49 |      4.47 
---------------------+----------------------+----------
        Unknown (.u) |    41,872         71 |    41,943 
                     |     83.08      82.56 |     83.08 
---------------------+----------------------+----------
               Total |    50,399         86 |    50,485 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

          Obesity (4 |  outcome CPNS death
         categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |    44,579         78 |    44,657 
                     |     88.45      90.70 |     88.46 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,768          1 |     1,769 
                     |      3.51       1.16 |      3.50 
---------------------+----------------------+----------
  Obese II (35-39.9) |     1,799          4 |     1,803 
                     |      3.57       4.65 |      3.57 
---------------------+----------------------+----------
     Obese III (40+) |     2,253          3 |     2,256 
                     |      4.47       3.49 |      4.47 
---------------------+----------------------+----------
               Total |    50,399         86 |    50,485 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  BMI with |
        SA |  outcome CPNS death
categories |         0          1 |     Total
-----------+----------------------+----------
         1 |       244          0 |       244 
           |      0.48       0.00 |      0.48 
-----------+----------------------+----------
         2 |       997          4 |     1,001 
           |      1.98       4.65 |      1.98 
-----------+----------------------+----------
         3 |     1,446          3 |     1,449 
           |      2.87       3.49 |      2.87 
-----------+----------------------+----------
         4 |     1,788          1 |     1,789 
           |      3.55       1.16 |      3.54 
-----------+----------------------+----------
         5 |     1,799          4 |     1,803 
           |      3.57       4.65 |      3.57 
-----------+----------------------+----------
         6 |     2,253          3 |     2,256 
           |      4.47       3.49 |      4.47 
-----------+----------------------+----------
        .u |    41,872         71 |    41,943 
           |     83.08      82.56 |     83.08 
-----------+----------------------+----------
     Total |    50,399         86 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

      Obesity with SA |  outcome CPNS death
           categories |         0          1 |     Total
----------------------+----------------------+----------
 No record of obesity |    44,559         78 |    44,637 
                      |     88.41      90.70 |     88.42 
----------------------+----------------------+----------
Obese I (30-34.9 / 27 |     1,788          1 |     1,789 
                      |      3.55       1.16 |      3.54 
----------------------+----------------------+----------
   Obese II (35-39.9) |     1,799          4 |     1,803 
                      |      3.57       4.65 |      3.57 
----------------------+----------------------+----------
      Obese III (40+) |     2,253          3 |     2,256 
                      |      4.47       3.49 |      4.47 
----------------------+----------------------+----------
                Total |    50,399         86 |    50,485 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Smoking |  outcome CPNS death
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |     2,054          4 |     2,058 
             |      4.08       4.65 |      4.08 
-------------+----------------------+----------
      Former |     1,041          1 |     1,042 
             |      2.07       1.16 |      2.06 
-------------+----------------------+----------
     Current |     6,044          8 |     6,052 
             |     11.99       9.30 |     11.99 
-------------+----------------------+----------
Unknown (.u) |    41,260         73 |    41,333 
             |     81.87      84.88 |     81.87 
-------------+----------------------+----------
       Total |    50,399         86 |    50,485 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |
Respirator |  outcome CPNS death
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,418         69 |    40,487 
           |     80.20      80.23 |     80.20 
-----------+----------------------+----------
         1 |     9,981         17 |     9,998 
           |     19.80      19.77 |     19.80 
-----------+----------------------+----------
     Total |    50,399         86 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Asthma |  outcome CPNS death
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,344         76 |    40,420 
           |     80.05      88.37 |     80.06 
-----------+----------------------+----------
         1 |    10,055         10 |    10,065 
           |     19.95      11.63 |     19.94 
-----------+----------------------+----------
     Total |    50,399         86 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

      Asthma |
    detailed |  outcome CPNS death
  categories |         0          1 |     Total
-------------+----------------------+----------
          No |    40,344         76 |    40,420 
             |     80.05      88.37 |     80.06 
-------------+----------------------+----------
 Yes, no OCS |    10,055         10 |    10,065 
             |     19.95      11.63 |     19.94 
-------------+----------------------+----------
       Total |    50,399         86 |    50,485 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |
   Cardiac |  outcome CPNS death
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,323         79 |    40,402 
           |     80.01      91.86 |     80.03 
-----------+----------------------+----------
         1 |    10,076          7 |    10,083 
           |     19.99       8.14 |     19.97 
-----------+----------------------+----------
     Total |    50,399         86 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Diabetes |  outcome CPNS death
   by type |         0          1 |     Total
-----------+----------------------+----------
     NO_DM |    37,624         66 |    37,690 
           |     74.65      76.74 |     74.66 
-----------+----------------------+----------
      T1DM |     1,490          1 |     1,491 
           |      2.96       1.16 |      2.95 
-----------+----------------------+----------
      T2DM |    10,256         18 |    10,274 
           |     20.35      20.93 |     20.35 
-----------+----------------------+----------
UNKNOWN_DM |     1,029          1 |     1,030 
           |      2.04       1.16 |      2.04 
-----------+----------------------+----------
     Total |    50,399         86 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Diabetes |
    exeter |  outcome CPNS death
      type |         0          1 |     Total
-----------+----------------------+----------
     NO_DM |    38,816         64 |    38,880 
           |     77.02      74.42 |     77.01 
-----------+----------------------+----------
T1DM_EX_OS |     1,484          1 |     1,485 
           |      2.94       1.16 |      2.94 
-----------+----------------------+----------
T2DM_EX_OS |    10,099         21 |    10,120 
           |     20.04      24.42 |     20.05 
-----------+----------------------+----------
     Total |    50,399         86 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  outcome CPNS death
    Cancer |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,298         71 |    40,369 
           |     79.96      82.56 |     79.96 
-----------+----------------------+----------
         1 |    10,101         15 |    10,116 
           |     20.04      17.44 |     20.04 
-----------+----------------------+----------
     Total |    50,399         86 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |
     liver |  outcome CPNS death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,329         70 |    40,399 
           |     80.02      81.40 |     80.02 
-----------+----------------------+----------
         1 |    10,070         16 |    10,086 
           |     19.98      18.60 |     19.98 
-----------+----------------------+----------
     Total |    50,399         86 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  outcome CPNS death
    Stroke |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,393         62 |    40,455 
           |     80.15      72.09 |     80.13 
-----------+----------------------+----------
         1 |    10,006         24 |    10,030 
           |     19.85      27.91 |     19.87 
-----------+----------------------+----------
     Total |    50,399         86 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  outcome CPNS death
  Dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,268         73 |    40,341 
           |     79.90      84.88 |     79.91 
-----------+----------------------+----------
         1 |    10,131         13 |    10,144 
           |     20.10      15.12 |     20.09 
-----------+----------------------+----------
     Total |    50,399         86 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Neurologic |  outcome CPNS death
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,345         65 |    40,410 
           |     80.05      75.58 |     80.04 
-----------+----------------------+----------
         1 |    10,054         21 |    10,075 
           |     19.95      24.42 |     19.96 
-----------+----------------------+----------
     Total |    50,399         86 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

       Reduced kidney |  outcome CPNS death
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |    49,809         85 |    49,894 
                      |     98.83      98.84 |     98.83 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |       590          1 |       591 
                      |      1.17       1.16 |      1.17 
----------------------+----------------------+----------
                Total |    50,399         86 |    50,485 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Autoimmune |  outcome CPNS death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,287         72 |    40,359 
           |     79.94      83.72 |     79.94 
-----------+----------------------+----------
         1 |    10,112         14 |    10,126 
           |     20.06      16.28 |     20.06 
-----------+----------------------+----------
     Total |    50,399         86 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        Index of |
        Multiple |
     Deprivation |  outcome CPNS death
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |    35,278         56 |    35,334 
                 |     70.00      65.12 |     69.99 
-----------------+----------------------+----------
               4 |     9,995         18 |    10,013 
                 |     19.83      20.93 |     19.83 
-----------------+----------------------+----------
 5 most deprived |     5,126         12 |     5,138 
                 |     10.17      13.95 |     10.18 
-----------------+----------------------+----------
           Total |    50,399         86 |    50,485 
                 |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Rural-Urba |
         n |  outcome CPNS death
 Indicator |         0          1 |     Total
-----------+----------------------+----------
     rural |     5,100          6 |     5,106 
           |     10.12       6.98 |     10.11 
-----------+----------------------+----------
     urban |    45,299         80 |    45,379 
           |     89.88      93.02 |     89.89 
-----------+----------------------+----------
     Total |    50,399         86 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |  outcome CPNS death
    Region of England |         0          1 |     Total
----------------------+----------------------+----------
        East Midlands |     5,079         11 |     5,090 
                      |     10.08      12.79 |     10.08 
----------------------+----------------------+----------
      East of England |     5,011          6 |     5,017 
                      |      9.94       6.98 |      9.94 
----------------------+----------------------+----------
               London |    10,211         19 |    10,230 
                      |     20.26      22.09 |     20.26 
----------------------+----------------------+----------
           North East |     5,003          7 |     5,010 
                      |      9.93       8.14 |      9.92 
----------------------+----------------------+----------
           North West |     5,017         13 |     5,030 
                      |      9.95      15.12 |      9.96 
----------------------+----------------------+----------
           South East |    10,088         18 |    10,106 
                      |     20.02      20.93 |     20.02 
----------------------+----------------------+----------
        West Midlands |     5,006          7 |     5,013 
                      |      9.93       8.14 |      9.93 
----------------------+----------------------+----------
Yorkshire and the H.. |     4,984          5 |     4,989 
                      |      9.89       5.81 |      9.88 
----------------------+----------------------+----------
                Total |    50,399         86 |    50,485 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |      outcome A&E
   Grouped |      Attendance
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     7,813      2,014 |     9,827 
           |     19.36      19.90 |     19.47 
-----------+----------------------+----------
    30-<40 |     6,929      1,656 |     8,585 
           |     17.17      16.36 |     17.01 
-----------+----------------------+----------
    40-<50 |     6,592      1,633 |     8,225 
           |     16.33      16.13 |     16.29 
-----------+----------------------+----------
    50-<60 |     6,816      1,713 |     8,529 
           |     16.89      16.93 |     16.89 
-----------+----------------------+----------
    60-<70 |     5,464      1,312 |     6,776 
           |     13.54      12.96 |     13.42 
-----------+----------------------+----------
    70-<80 |     4,291      1,118 |     5,409 
           |     10.63      11.05 |     10.71 
-----------+----------------------+----------
       80+ |     2,459        675 |     3,134 
           |      6.09       6.67 |      6.21 
-----------+----------------------+----------
     Total |    40,364     10,121 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |      outcome A&E
           |      Attendance
      Male |         0          1 |     Total
-----------+----------------------+----------
    Female |    20,666      5,208 |    25,874 
           |     51.20      51.46 |     51.25 
-----------+----------------------+----------
      Male |    19,698      4,913 |    24,611 
           |     48.80      48.54 |     48.75 
-----------+----------------------+----------
     Total |    40,364     10,121 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |      outcome A&E
                      |      Attendance
     Eth 5 categories |         0          1 |     Total
----------------------+----------------------+----------
                White |    24,311      6,121 |    30,432 
                      |     60.23      60.48 |     60.28 
----------------------+----------------------+----------
                Mixed |     1,587        370 |     1,957 
                      |      3.93       3.66 |      3.88 
----------------------+----------------------+----------
Asian or Asian Britis |     1,479        362 |     1,841 
                      |      3.66       3.58 |      3.65 
----------------------+----------------------+----------
                Black |     1,465        367 |     1,832 
                      |      3.63       3.63 |      3.63 
----------------------+----------------------+----------
                Other |     1,441        368 |     1,809 
                      |      3.57       3.64 |      3.58 
----------------------+----------------------+----------
                    . |    10,081      2,533 |    12,614 
                      |     24.98      25.03 |     24.99 
----------------------+----------------------+----------
                Total |    40,364     10,121 |    50,485 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |      outcome A&E
                      |      Attendance
    Eth 16 categories |         0          1 |     Total
----------------------+----------------------+----------
British or Mixed Brit |    11,419      2,882 |    14,301 
                      |     28.29      28.48 |     28.33 
----------------------+----------------------+----------
                Irish |     2,311        525 |     2,836 
                      |      5.73       5.19 |      5.62 
----------------------+----------------------+----------
          Other White |     1,050        275 |     1,325 
                      |      2.60       2.72 |      2.62 
----------------------+----------------------+----------
White + Black Caribbe |     1,128        273 |     1,401 
                      |      2.79       2.70 |      2.78 
----------------------+----------------------+----------
White + Black African |     1,130        292 |     1,422 
                      |      2.80       2.89 |      2.82 
----------------------+----------------------+----------
        White + Asian |     1,182        283 |     1,465 
                      |      2.93       2.80 |      2.90 
----------------------+----------------------+----------
          Other mixed |     1,082        291 |     1,373 
                      |      2.68       2.88 |      2.72 
----------------------+----------------------+----------
Indian or British Ind |     1,092        268 |     1,360 
                      |      2.71       2.65 |      2.69 
----------------------+----------------------+----------
Pakistani or British  |       498        112 |       610 
                      |      1.23       1.11 |      1.21 
----------------------+----------------------+----------
Bangladeshi or Britis |       461        114 |       575 
                      |      1.14       1.13 |      1.14 
----------------------+----------------------+----------
          Other Asian |       207         61 |       268 
                      |      0.51       0.60 |      0.53 
----------------------+----------------------+----------
            Caribbean |       211         54 |       265 
                      |      0.52       0.53 |      0.52 
----------------------+----------------------+----------
              African |       213         65 |       278 
                      |      0.53       0.64 |      0.55 
----------------------+----------------------+----------
          Other Black |       224         47 |       271 
                      |      0.55       0.46 |      0.54 
----------------------+----------------------+----------
              Chinese |       231         56 |       287 
                      |      0.57       0.55 |      0.57 
----------------------+----------------------+----------
                Other |       204         63 |       267 
                      |      0.51       0.62 |      0.53 
----------------------+----------------------+----------
                    . |    17,721      4,460 |    22,181 
                      |     43.90      44.07 |     43.94 
----------------------+----------------------+----------
                Total |    40,364     10,121 |    50,485 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |      outcome A&E
                     |      Attendance
                 BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |       187         57 |       244 
                     |      0.46       0.56 |      0.48 
---------------------+----------------------+----------
  Normal (18.5-24.9) |       814        204 |     1,018 
                     |      2.02       2.02 |      2.02 
---------------------+----------------------+----------
Overweight (25-29.9) |     1,160        292 |     1,452 
                     |      2.87       2.89 |      2.88 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,437        332 |     1,769 
                     |      3.56       3.28 |      3.50 
---------------------+----------------------+----------
  Obese II (35-39.9) |     1,424        379 |     1,803 
                     |      3.53       3.74 |      3.57 
---------------------+----------------------+----------
     Obese III (40+) |     1,798        458 |     2,256 
                     |      4.45       4.53 |      4.47 
---------------------+----------------------+----------
        Unknown (.u) |    33,544      8,399 |    41,943 
                     |     83.10      82.99 |     83.08 
---------------------+----------------------+----------
               Total |    40,364     10,121 |    50,485 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |      outcome A&E
          Obesity (4 |      Attendance
         categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |    35,705      8,952 |    44,657 
                     |     88.46      88.45 |     88.46 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,437        332 |     1,769 
                     |      3.56       3.28 |      3.50 
---------------------+----------------------+----------
  Obese II (35-39.9) |     1,424        379 |     1,803 
                     |      3.53       3.74 |      3.57 
---------------------+----------------------+----------
     Obese III (40+) |     1,798        458 |     2,256 
                     |      4.45       4.53 |      4.47 
---------------------+----------------------+----------
               Total |    40,364     10,121 |    50,485 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  BMI with |      outcome A&E
        SA |      Attendance
categories |         0          1 |     Total
-----------+----------------------+----------
         1 |       187         57 |       244 
           |      0.46       0.56 |      0.48 
-----------+----------------------+----------
         2 |       800        201 |     1,001 
           |      1.98       1.99 |      1.98 
-----------+----------------------+----------
         3 |     1,160        289 |     1,449 
           |      2.87       2.86 |      2.87 
-----------+----------------------+----------
         4 |     1,451        338 |     1,789 
           |      3.59       3.34 |      3.54 
-----------+----------------------+----------
         5 |     1,424        379 |     1,803 
           |      3.53       3.74 |      3.57 
-----------+----------------------+----------
         6 |     1,798        458 |     2,256 
           |      4.45       4.53 |      4.47 
-----------+----------------------+----------
        .u |    33,544      8,399 |    41,943 
           |     83.10      82.99 |     83.08 
-----------+----------------------+----------
     Total |    40,364     10,121 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |      outcome A&E
      Obesity with SA |      Attendance
           categories |         0          1 |     Total
----------------------+----------------------+----------
 No record of obesity |    35,691      8,946 |    44,637 
                      |     88.42      88.39 |     88.42 
----------------------+----------------------+----------
Obese I (30-34.9 / 27 |     1,451        338 |     1,789 
                      |      3.59       3.34 |      3.54 
----------------------+----------------------+----------
   Obese II (35-39.9) |     1,424        379 |     1,803 
                      |      3.53       3.74 |      3.57 
----------------------+----------------------+----------
      Obese III (40+) |     1,798        458 |     2,256 
                      |      4.45       4.53 |      4.47 
----------------------+----------------------+----------
                Total |    40,364     10,121 |    50,485 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |      outcome A&E
     Smoking |      Attendance
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |     1,652        406 |     2,058 
             |      4.09       4.01 |      4.08 
-------------+----------------------+----------
      Former |       825        217 |     1,042 
             |      2.04       2.14 |      2.06 
-------------+----------------------+----------
     Current |     4,845      1,207 |     6,052 
             |     12.00      11.93 |     11.99 
-------------+----------------------+----------
Unknown (.u) |    33,042      8,291 |    41,333 
             |     81.86      81.92 |     81.87 
-------------+----------------------+----------
       Total |    40,364     10,121 |    50,485 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |      outcome A&E
Respirator |      Attendance
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,361      8,126 |    40,487 
           |     80.17      80.29 |     80.20 
-----------+----------------------+----------
         1 |     8,003      1,995 |     9,998 
           |     19.83      19.71 |     19.80 
-----------+----------------------+----------
     Total |    40,364     10,121 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |      outcome A&E
    Asthma |      Attendance
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,284      8,136 |    40,420 
           |     79.98      80.39 |     80.06 
-----------+----------------------+----------
         1 |     8,080      1,985 |    10,065 
           |     20.02      19.61 |     19.94 
-----------+----------------------+----------
     Total |    40,364     10,121 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

      Asthma |      outcome A&E
    detailed |      Attendance
  categories |         0          1 |     Total
-------------+----------------------+----------
          No |    32,284      8,136 |    40,420 
             |     79.98      80.39 |     80.06 
-------------+----------------------+----------
 Yes, no OCS |     8,080      1,985 |    10,065 
             |     20.02      19.61 |     19.94 
-------------+----------------------+----------
       Total |    40,364     10,121 |    50,485 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |      outcome A&E
   Cardiac |      Attendance
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,322      8,080 |    40,402 
           |     80.08      79.83 |     80.03 
-----------+----------------------+----------
         1 |     8,042      2,041 |    10,083 
           |     19.92      20.17 |     19.97 
-----------+----------------------+----------
     Total |    40,364     10,121 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |      outcome A&E
  Diabetes |      Attendance
   by type |         0          1 |     Total
-----------+----------------------+----------
     NO_DM |    30,088      7,602 |    37,690 
           |     74.54      75.11 |     74.66 
-----------+----------------------+----------
      T1DM |     1,173        318 |     1,491 
           |      2.91       3.14 |      2.95 
-----------+----------------------+----------
      T2DM |     8,272      2,002 |    10,274 
           |     20.49      19.78 |     20.35 
-----------+----------------------+----------
UNKNOWN_DM |       831        199 |     1,030 
           |      2.06       1.97 |      2.04 
-----------+----------------------+----------
     Total |    40,364     10,121 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Diabetes |      outcome A&E
    exeter |      Attendance
      type |         0          1 |     Total
-----------+----------------------+----------
     NO_DM |    31,100      7,780 |    38,880 
           |     77.05      76.87 |     77.01 
-----------+----------------------+----------
T1DM_EX_OS |     1,184        301 |     1,485 
           |      2.93       2.97 |      2.94 
-----------+----------------------+----------
T2DM_EX_OS |     8,080      2,040 |    10,120 
           |     20.02      20.16 |     20.05 
-----------+----------------------+----------
     Total |    40,364     10,121 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |      outcome A&E
           |      Attendance
    Cancer |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,305      8,064 |    40,369 
           |     80.03      79.68 |     79.96 
-----------+----------------------+----------
         1 |     8,059      2,057 |    10,116 
           |     19.97      20.32 |     20.04 
-----------+----------------------+----------
     Total |    40,364     10,121 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |      outcome A&E
     liver |      Attendance
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,247      8,152 |    40,399 
           |     79.89      80.55 |     80.02 
-----------+----------------------+----------
         1 |     8,117      1,969 |    10,086 
           |     20.11      19.45 |     19.98 
-----------+----------------------+----------
     Total |    40,364     10,121 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |      outcome A&E
           |      Attendance
    Stroke |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,340      8,115 |    40,455 
           |     80.12      80.18 |     80.13 
-----------+----------------------+----------
         1 |     8,024      2,006 |    10,030 
           |     19.88      19.82 |     19.87 
-----------+----------------------+----------
     Total |    40,364     10,121 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |      outcome A&E
           |      Attendance
  Dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,244      8,097 |    40,341 
           |     79.88      80.00 |     79.91 
-----------+----------------------+----------
         1 |     8,120      2,024 |    10,144 
           |     20.12      20.00 |     20.09 
-----------+----------------------+----------
     Total |    40,364     10,121 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |      outcome A&E
Neurologic |      Attendance
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,282      8,128 |    40,410 
           |     79.98      80.31 |     80.04 
-----------+----------------------+----------
         1 |     8,082      1,993 |    10,075 
           |     20.02      19.69 |     19.96 
-----------+----------------------+----------
     Total |    40,364     10,121 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |      outcome A&E
       Reduced kidney |      Attendance
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |    39,901      9,993 |    49,894 
                      |     98.85      98.74 |     98.83 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |       463        128 |       591 
                      |      1.15       1.26 |      1.17 
----------------------+----------------------+----------
                Total |    40,364     10,121 |    50,485 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |      outcome A&E
Autoimmune |      Attendance
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,285      8,074 |    40,359 
           |     79.98      79.77 |     79.94 
-----------+----------------------+----------
         1 |     8,079      2,047 |    10,126 
           |     20.02      20.23 |     20.06 
-----------+----------------------+----------
     Total |    40,364     10,121 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        Index of |
        Multiple |      outcome A&E
     Deprivation |      Attendance
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |    28,267      7,067 |    35,334 
                 |     70.03      69.83 |     69.99 
-----------------+----------------------+----------
               4 |     7,997      2,016 |    10,013 
                 |     19.81      19.92 |     19.83 
-----------------+----------------------+----------
 5 most deprived |     4,100      1,038 |     5,138 
                 |     10.16      10.26 |     10.18 
-----------------+----------------------+----------
           Total |    40,364     10,121 |    50,485 
                 |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Rural-Urba |      outcome A&E
         n |      Attendance
 Indicator |         0          1 |     Total
-----------+----------------------+----------
     rural |     4,070      1,036 |     5,106 
           |     10.08      10.24 |     10.11 
-----------+----------------------+----------
     urban |    36,294      9,085 |    45,379 
           |     89.92      89.76 |     89.89 
-----------+----------------------+----------
     Total |    40,364     10,121 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |      outcome A&E
                      |      Attendance
    Region of England |         0          1 |     Total
----------------------+----------------------+----------
        East Midlands |     4,104        986 |     5,090 
                      |     10.17       9.74 |     10.08 
----------------------+----------------------+----------
      East of England |     3,996      1,021 |     5,017 
                      |      9.90      10.09 |      9.94 
----------------------+----------------------+----------
               London |     8,230      2,000 |    10,230 
                      |     20.39      19.76 |     20.26 
----------------------+----------------------+----------
           North East |     3,977      1,033 |     5,010 
                      |      9.85      10.21 |      9.92 
----------------------+----------------------+----------
           North West |     4,033        997 |     5,030 
                      |      9.99       9.85 |      9.96 
----------------------+----------------------+----------
           South East |     8,083      2,023 |    10,106 
                      |     20.03      19.99 |     20.02 
----------------------+----------------------+----------
        West Midlands |     3,974      1,039 |     5,013 
                      |      9.85      10.27 |      9.93 
----------------------+----------------------+----------
Yorkshire and the H.. |     3,967      1,022 |     4,989 
                      |      9.83      10.10 |      9.88 
----------------------+----------------------+----------
                Total |    40,364     10,121 |    50,485 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Grouped | outcome ICU Admission
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     9,809         18 |     9,827 
           |     19.46      20.69 |     19.47 
-----------+----------------------+----------
    30-<40 |     8,573         12 |     8,585 
           |     17.01      13.79 |     17.01 
-----------+----------------------+----------
    40-<50 |     8,211         14 |     8,225 
           |     16.29      16.09 |     16.29 
-----------+----------------------+----------
    50-<60 |     8,514         15 |     8,529 
           |     16.89      17.24 |     16.89 
-----------+----------------------+----------
    60-<70 |     6,764         12 |     6,776 
           |     13.42      13.79 |     13.42 
-----------+----------------------+----------
    70-<80 |     5,397         12 |     5,409 
           |     10.71      13.79 |     10.71 
-----------+----------------------+----------
       80+ |     3,130          4 |     3,134 
           |      6.21       4.60 |      6.21 
-----------+----------------------+----------
     Total |    50,398         87 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           | outcome ICU Admission
      Male |         0          1 |     Total
-----------+----------------------+----------
    Female |    25,836         38 |    25,874 
           |     51.26      43.68 |     51.25 
-----------+----------------------+----------
      Male |    24,562         49 |    24,611 
           |     48.74      56.32 |     48.75 
-----------+----------------------+----------
     Total |    50,398         87 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      | outcome ICU Admission
     Eth 5 categories |         0          1 |     Total
----------------------+----------------------+----------
                White |    30,372         60 |    30,432 
                      |     60.26      68.97 |     60.28 
----------------------+----------------------+----------
                Mixed |     1,956          1 |     1,957 
                      |      3.88       1.15 |      3.88 
----------------------+----------------------+----------
Asian or Asian Britis |     1,835          6 |     1,841 
                      |      3.64       6.90 |      3.65 
----------------------+----------------------+----------
                Black |     1,832          0 |     1,832 
                      |      3.64       0.00 |      3.63 
----------------------+----------------------+----------
                Other |     1,806          3 |     1,809 
                      |      3.58       3.45 |      3.58 
----------------------+----------------------+----------
                    . |    12,597         17 |    12,614 
                      |     25.00      19.54 |     24.99 
----------------------+----------------------+----------
                Total |    50,398         87 |    50,485 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      | outcome ICU Admission
    Eth 16 categories |         0          1 |     Total
----------------------+----------------------+----------
British or Mixed Brit |    14,270         31 |    14,301 
                      |     28.31      35.63 |     28.33 
----------------------+----------------------+----------
                Irish |     2,831          5 |     2,836 
                      |      5.62       5.75 |      5.62 
----------------------+----------------------+----------
          Other White |     1,321          4 |     1,325 
                      |      2.62       4.60 |      2.62 
----------------------+----------------------+----------
White + Black Caribbe |     1,398          3 |     1,401 
                      |      2.77       3.45 |      2.78 
----------------------+----------------------+----------
White + Black African |     1,421          1 |     1,422 
                      |      2.82       1.15 |      2.82 
----------------------+----------------------+----------
        White + Asian |     1,461          4 |     1,465 
                      |      2.90       4.60 |      2.90 
----------------------+----------------------+----------
          Other mixed |     1,371          2 |     1,373 
                      |      2.72       2.30 |      2.72 
----------------------+----------------------+----------
Indian or British Ind |     1,359          1 |     1,360 
                      |      2.70       1.15 |      2.69 
----------------------+----------------------+----------
Pakistani or British  |       608          2 |       610 
                      |      1.21       2.30 |      1.21 
----------------------+----------------------+----------
Bangladeshi or Britis |       574          1 |       575 
                      |      1.14       1.15 |      1.14 
----------------------+----------------------+----------
          Other Asian |       268          0 |       268 
                      |      0.53       0.00 |      0.53 
----------------------+----------------------+----------
            Caribbean |       265          0 |       265 
                      |      0.53       0.00 |      0.52 
----------------------+----------------------+----------
              African |       277          1 |       278 
                      |      0.55       1.15 |      0.55 
----------------------+----------------------+----------
          Other Black |       270          1 |       271 
                      |      0.54       1.15 |      0.54 
----------------------+----------------------+----------
              Chinese |       287          0 |       287 
                      |      0.57       0.00 |      0.57 
----------------------+----------------------+----------
                Other |       265          2 |       267 
                      |      0.53       2.30 |      0.53 
----------------------+----------------------+----------
                    . |    22,152         29 |    22,181 
                      |     43.95      33.33 |     43.94 
----------------------+----------------------+----------
                Total |    50,398         87 |    50,485 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     | outcome ICU Admission
                 BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |       244          0 |       244 
                     |      0.48       0.00 |      0.48 
---------------------+----------------------+----------
  Normal (18.5-24.9) |     1,017          1 |     1,018 
                     |      2.02       1.15 |      2.02 
---------------------+----------------------+----------
Overweight (25-29.9) |     1,449          3 |     1,452 
                     |      2.88       3.45 |      2.88 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,769          0 |     1,769 
                     |      3.51       0.00 |      3.50 
---------------------+----------------------+----------
  Obese II (35-39.9) |     1,802          1 |     1,803 
                     |      3.58       1.15 |      3.57 
---------------------+----------------------+----------
     Obese III (40+) |     2,253          3 |     2,256 
                     |      4.47       3.45 |      4.47 
---------------------+----------------------+----------
        Unknown (.u) |    41,864         79 |    41,943 
                     |     83.07      90.80 |     83.08 
---------------------+----------------------+----------
               Total |    50,398         87 |    50,485 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

          Obesity (4 | outcome ICU Admission
         categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |    44,574         83 |    44,657 
                     |     88.44      95.40 |     88.46 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,769          0 |     1,769 
                     |      3.51       0.00 |      3.50 
---------------------+----------------------+----------
  Obese II (35-39.9) |     1,802          1 |     1,803 
                     |      3.58       1.15 |      3.57 
---------------------+----------------------+----------
     Obese III (40+) |     2,253          3 |     2,256 
                     |      4.47       3.45 |      4.47 
---------------------+----------------------+----------
               Total |    50,398         87 |    50,485 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  BMI with |
        SA | outcome ICU Admission
categories |         0          1 |     Total
-----------+----------------------+----------
         1 |       244          0 |       244 
           |      0.48       0.00 |      0.48 
-----------+----------------------+----------
         2 |     1,000          1 |     1,001 
           |      1.98       1.15 |      1.98 
-----------+----------------------+----------
         3 |     1,446          3 |     1,449 
           |      2.87       3.45 |      2.87 
-----------+----------------------+----------
         4 |     1,789          0 |     1,789 
           |      3.55       0.00 |      3.54 
-----------+----------------------+----------
         5 |     1,802          1 |     1,803 
           |      3.58       1.15 |      3.57 
-----------+----------------------+----------
         6 |     2,253          3 |     2,256 
           |      4.47       3.45 |      4.47 
-----------+----------------------+----------
        .u |    41,864         79 |    41,943 
           |     83.07      90.80 |     83.08 
-----------+----------------------+----------
     Total |    50,398         87 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

      Obesity with SA | outcome ICU Admission
           categories |         0          1 |     Total
----------------------+----------------------+----------
 No record of obesity |    44,554         83 |    44,637 
                      |     88.40      95.40 |     88.42 
----------------------+----------------------+----------
Obese I (30-34.9 / 27 |     1,789          0 |     1,789 
                      |      3.55       0.00 |      3.54 
----------------------+----------------------+----------
   Obese II (35-39.9) |     1,802          1 |     1,803 
                      |      3.58       1.15 |      3.57 
----------------------+----------------------+----------
      Obese III (40+) |     2,253          3 |     2,256 
                      |      4.47       3.45 |      4.47 
----------------------+----------------------+----------
                Total |    50,398         87 |    50,485 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Smoking | outcome ICU Admission
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |     2,053          5 |     2,058 
             |      4.07       5.75 |      4.08 
-------------+----------------------+----------
      Former |     1,042          0 |     1,042 
             |      2.07       0.00 |      2.06 
-------------+----------------------+----------
     Current |     6,043          9 |     6,052 
             |     11.99      10.34 |     11.99 
-------------+----------------------+----------
Unknown (.u) |    41,260         73 |    41,333 
             |     81.87      83.91 |     81.87 
-------------+----------------------+----------
       Total |    50,398         87 |    50,485 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |
Respirator | outcome ICU Admission
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,418         69 |    40,487 
           |     80.20      79.31 |     80.20 
-----------+----------------------+----------
         1 |     9,980         18 |     9,998 
           |     19.80      20.69 |     19.80 
-----------+----------------------+----------
     Total |    50,398         87 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Asthma | outcome ICU Admission
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,354         66 |    40,420 
           |     80.07      75.86 |     80.06 
-----------+----------------------+----------
         1 |    10,044         21 |    10,065 
           |     19.93      24.14 |     19.94 
-----------+----------------------+----------
     Total |    50,398         87 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

      Asthma |
    detailed | outcome ICU Admission
  categories |         0          1 |     Total
-------------+----------------------+----------
          No |    40,354         66 |    40,420 
             |     80.07      75.86 |     80.06 
-------------+----------------------+----------
 Yes, no OCS |    10,044         21 |    10,065 
             |     19.93      24.14 |     19.94 
-------------+----------------------+----------
       Total |    50,398         87 |    50,485 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |
   Cardiac | outcome ICU Admission
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,335         67 |    40,402 
           |     80.03      77.01 |     80.03 
-----------+----------------------+----------
         1 |    10,063         20 |    10,083 
           |     19.97      22.99 |     19.97 
-----------+----------------------+----------
     Total |    50,398         87 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Diabetes | outcome ICU Admission
   by type |         0          1 |     Total
-----------+----------------------+----------
     NO_DM |    37,634         56 |    37,690 
           |     74.67      64.37 |     74.66 
-----------+----------------------+----------
      T1DM |     1,488          3 |     1,491 
           |      2.95       3.45 |      2.95 
-----------+----------------------+----------
      T2DM |    10,250         24 |    10,274 
           |     20.34      27.59 |     20.35 
-----------+----------------------+----------
UNKNOWN_DM |     1,026          4 |     1,030 
           |      2.04       4.60 |      2.04 
-----------+----------------------+----------
     Total |    50,398         87 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Diabetes |
    exeter | outcome ICU Admission
      type |         0          1 |     Total
-----------+----------------------+----------
     NO_DM |    38,812         68 |    38,880 
           |     77.01      78.16 |     77.01 
-----------+----------------------+----------
T1DM_EX_OS |     1,482          3 |     1,485 
           |      2.94       3.45 |      2.94 
-----------+----------------------+----------
T2DM_EX_OS |    10,104         16 |    10,120 
           |     20.05      18.39 |     20.05 
-----------+----------------------+----------
     Total |    50,398         87 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           | outcome ICU Admission
    Cancer |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,294         75 |    40,369 
           |     79.95      86.21 |     79.96 
-----------+----------------------+----------
         1 |    10,104         12 |    10,116 
           |     20.05      13.79 |     20.04 
-----------+----------------------+----------
     Total |    50,398         87 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |
     liver | outcome ICU Admission
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,335         64 |    40,399 
           |     80.03      73.56 |     80.02 
-----------+----------------------+----------
         1 |    10,063         23 |    10,086 
           |     19.97      26.44 |     19.98 
-----------+----------------------+----------
     Total |    50,398         87 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           | outcome ICU Admission
    Stroke |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,385         70 |    40,455 
           |     80.13      80.46 |     80.13 
-----------+----------------------+----------
         1 |    10,013         17 |    10,030 
           |     19.87      19.54 |     19.87 
-----------+----------------------+----------
     Total |    50,398         87 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           | outcome ICU Admission
  Dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,270         71 |    40,341 
           |     79.90      81.61 |     79.91 
-----------+----------------------+----------
         1 |    10,128         16 |    10,144 
           |     20.10      18.39 |     20.09 
-----------+----------------------+----------
     Total |    50,398         87 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Neurologic | outcome ICU Admission
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,339         71 |    40,410 
           |     80.04      81.61 |     80.04 
-----------+----------------------+----------
         1 |    10,059         16 |    10,075 
           |     19.96      18.39 |     19.96 
-----------+----------------------+----------
     Total |    50,398         87 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

       Reduced kidney | outcome ICU Admission
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |    49,807         87 |    49,894 
                      |     98.83     100.00 |     98.83 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |       591          0 |       591 
                      |      1.17       0.00 |      1.17 
----------------------+----------------------+----------
                Total |    50,398         87 |    50,485 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Autoimmune | outcome ICU Admission
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,289         70 |    40,359 
           |     79.94      80.46 |     79.94 
-----------+----------------------+----------
         1 |    10,109         17 |    10,126 
           |     20.06      19.54 |     20.06 
-----------+----------------------+----------
     Total |    50,398         87 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        Index of |
        Multiple |
     Deprivation | outcome ICU Admission
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |    35,275         59 |    35,334 
                 |     69.99      67.82 |     69.99 
-----------------+----------------------+----------
               4 |     9,990         23 |    10,013 
                 |     19.82      26.44 |     19.83 
-----------------+----------------------+----------
 5 most deprived |     5,133          5 |     5,138 
                 |     10.18       5.75 |     10.18 
-----------------+----------------------+----------
           Total |    50,398         87 |    50,485 
                 |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Rural-Urba |
         n | outcome ICU Admission
 Indicator |         0          1 |     Total
-----------+----------------------+----------
     rural |     5,098          8 |     5,106 
           |     10.12       9.20 |     10.11 
-----------+----------------------+----------
     urban |    45,300         79 |    45,379 
           |     89.88      90.80 |     89.89 
-----------+----------------------+----------
     Total |    50,398         87 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      | outcome ICU Admission
    Region of England |         0          1 |     Total
----------------------+----------------------+----------
        East Midlands |     5,086          4 |     5,090 
                      |     10.09       4.60 |     10.08 
----------------------+----------------------+----------
      East of England |     5,008          9 |     5,017 
                      |      9.94      10.34 |      9.94 
----------------------+----------------------+----------
               London |    10,214         16 |    10,230 
                      |     20.27      18.39 |     20.26 
----------------------+----------------------+----------
           North East |     4,993         17 |     5,010 
                      |      9.91      19.54 |      9.92 
----------------------+----------------------+----------
           North West |     5,021          9 |     5,030 
                      |      9.96      10.34 |      9.96 
----------------------+----------------------+----------
           South East |    10,091         15 |    10,106 
                      |     20.02      17.24 |     20.02 
----------------------+----------------------+----------
        West Midlands |     5,002         11 |     5,013 
                      |      9.92      12.64 |      9.93 
----------------------+----------------------+----------
Yorkshire and the H.. |     4,983          6 |     4,989 
                      |      9.89       6.90 |      9.88 
----------------------+----------------------+----------
                Total |    50,398         87 |    50,485 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome suspected
   Grouped |         case
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     7,796      2,031 |     9,827 
           |     19.32      20.03 |     19.47 
-----------+----------------------+----------
    30-<40 |     6,892      1,693 |     8,585 
           |     17.08      16.69 |     17.01 
-----------+----------------------+----------
    40-<50 |     6,532      1,693 |     8,225 
           |     16.19      16.69 |     16.29 
-----------+----------------------+----------
    50-<60 |     6,873      1,656 |     8,529 
           |     17.04      16.33 |     16.89 
-----------+----------------------+----------
    60-<70 |     5,418      1,358 |     6,776 
           |     13.43      13.39 |     13.42 
-----------+----------------------+----------
    70-<80 |     4,309      1,100 |     5,409 
           |     10.68      10.85 |     10.71 
-----------+----------------------+----------
       80+ |     2,523        611 |     3,134 
           |      6.25       6.02 |      6.21 
-----------+----------------------+----------
     Total |    40,343     10,142 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome suspected
           |         case
      Male |         0          1 |     Total
-----------+----------------------+----------
    Female |    20,634      5,240 |    25,874 
           |     51.15      51.67 |     51.25 
-----------+----------------------+----------
      Male |    19,709      4,902 |    24,611 
           |     48.85      48.33 |     48.75 
-----------+----------------------+----------
     Total |    40,343     10,142 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   outcome suspected
                      |         case
     Eth 5 categories |         0          1 |     Total
----------------------+----------------------+----------
                White |    24,344      6,088 |    30,432 
                      |     60.34      60.03 |     60.28 
----------------------+----------------------+----------
                Mixed |     1,547        410 |     1,957 
                      |      3.83       4.04 |      3.88 
----------------------+----------------------+----------
Asian or Asian Britis |     1,449        392 |     1,841 
                      |      3.59       3.87 |      3.65 
----------------------+----------------------+----------
                Black |     1,457        375 |     1,832 
                      |      3.61       3.70 |      3.63 
----------------------+----------------------+----------
                Other |     1,469        340 |     1,809 
                      |      3.64       3.35 |      3.58 
----------------------+----------------------+----------
                    . |    10,077      2,537 |    12,614 
                      |     24.98      25.01 |     24.99 
----------------------+----------------------+----------
                Total |    40,343     10,142 |    50,485 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   outcome suspected
                      |         case
    Eth 16 categories |         0          1 |     Total
----------------------+----------------------+----------
British or Mixed Brit |    11,435      2,866 |    14,301 
                      |     28.34      28.26 |     28.33 
----------------------+----------------------+----------
                Irish |     2,285        551 |     2,836 
                      |      5.66       5.43 |      5.62 
----------------------+----------------------+----------
          Other White |     1,055        270 |     1,325 
                      |      2.62       2.66 |      2.62 
----------------------+----------------------+----------
White + Black Caribbe |     1,106        295 |     1,401 
                      |      2.74       2.91 |      2.78 
----------------------+----------------------+----------
White + Black African |     1,152        270 |     1,422 
                      |      2.86       2.66 |      2.82 
----------------------+----------------------+----------
        White + Asian |     1,169        296 |     1,465 
                      |      2.90       2.92 |      2.90 
----------------------+----------------------+----------
          Other mixed |     1,101        272 |     1,373 
                      |      2.73       2.68 |      2.72 
----------------------+----------------------+----------
Indian or British Ind |     1,070        290 |     1,360 
                      |      2.65       2.86 |      2.69 
----------------------+----------------------+----------
Pakistani or British  |       499        111 |       610 
                      |      1.24       1.09 |      1.21 
----------------------+----------------------+----------
Bangladeshi or Britis |       469        106 |       575 
                      |      1.16       1.05 |      1.14 
----------------------+----------------------+----------
          Other Asian |       207         61 |       268 
                      |      0.51       0.60 |      0.53 
----------------------+----------------------+----------
            Caribbean |       212         53 |       265 
                      |      0.53       0.52 |      0.52 
----------------------+----------------------+----------
              African |       215         63 |       278 
                      |      0.53       0.62 |      0.55 
----------------------+----------------------+----------
          Other Black |       213         58 |       271 
                      |      0.53       0.57 |      0.54 
----------------------+----------------------+----------
              Chinese |       231         56 |       287 
                      |      0.57       0.55 |      0.57 
----------------------+----------------------+----------
                Other |       222         45 |       267 
                      |      0.55       0.44 |      0.53 
----------------------+----------------------+----------
                    . |    17,702      4,479 |    22,181 
                      |     43.88      44.16 |     43.94 
----------------------+----------------------+----------
                Total |    40,343     10,142 |    50,485 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   outcome suspected
                     |         case
                 BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |       205         39 |       244 
                     |      0.51       0.38 |      0.48 
---------------------+----------------------+----------
  Normal (18.5-24.9) |       807        211 |     1,018 
                     |      2.00       2.08 |      2.02 
---------------------+----------------------+----------
Overweight (25-29.9) |     1,162        290 |     1,452 
                     |      2.88       2.86 |      2.88 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,421        348 |     1,769 
                     |      3.52       3.43 |      3.50 
---------------------+----------------------+----------
  Obese II (35-39.9) |     1,429        374 |     1,803 
                     |      3.54       3.69 |      3.57 
---------------------+----------------------+----------
     Obese III (40+) |     1,832        424 |     2,256 
                     |      4.54       4.18 |      4.47 
---------------------+----------------------+----------
        Unknown (.u) |    33,487      8,456 |    41,943 
                     |     83.01      83.38 |     83.08 
---------------------+----------------------+----------
               Total |    40,343     10,142 |    50,485 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   outcome suspected
          Obesity (4 |         case
         categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |    35,661      8,996 |    44,657 
                     |     88.39      88.70 |     88.46 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,421        348 |     1,769 
                     |      3.52       3.43 |      3.50 
---------------------+----------------------+----------
  Obese II (35-39.9) |     1,429        374 |     1,803 
                     |      3.54       3.69 |      3.57 
---------------------+----------------------+----------
     Obese III (40+) |     1,832        424 |     2,256 
                     |      4.54       4.18 |      4.47 
---------------------+----------------------+----------
               Total |    40,343     10,142 |    50,485 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  BMI with |   outcome suspected
        SA |         case
categories |         0          1 |     Total
-----------+----------------------+----------
         1 |       205         39 |       244 
           |      0.51       0.38 |      0.48 
-----------+----------------------+----------
         2 |       790        211 |     1,001 
           |      1.96       2.08 |      1.98 
-----------+----------------------+----------
         3 |     1,163        286 |     1,449 
           |      2.88       2.82 |      2.87 
-----------+----------------------+----------
         4 |     1,437        352 |     1,789 
           |      3.56       3.47 |      3.54 
-----------+----------------------+----------
         5 |     1,429        374 |     1,803 
           |      3.54       3.69 |      3.57 
-----------+----------------------+----------
         6 |     1,832        424 |     2,256 
           |      4.54       4.18 |      4.47 
-----------+----------------------+----------
        .u |    33,487      8,456 |    41,943 
           |     83.01      83.38 |     83.08 
-----------+----------------------+----------
     Total |    40,343     10,142 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   outcome suspected
      Obesity with SA |         case
           categories |         0          1 |     Total
----------------------+----------------------+----------
 No record of obesity |    35,645      8,992 |    44,637 
                      |     88.35      88.66 |     88.42 
----------------------+----------------------+----------
Obese I (30-34.9 / 27 |     1,437        352 |     1,789 
                      |      3.56       3.47 |      3.54 
----------------------+----------------------+----------
   Obese II (35-39.9) |     1,429        374 |     1,803 
                      |      3.54       3.69 |      3.57 
----------------------+----------------------+----------
      Obese III (40+) |     1,832        424 |     2,256 
                      |      4.54       4.18 |      4.47 
----------------------+----------------------+----------
                Total |    40,343     10,142 |    50,485 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   outcome suspected
     Smoking |         case
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |     1,640        418 |     2,058 
             |      4.07       4.12 |      4.08 
-------------+----------------------+----------
      Former |       843        199 |     1,042 
             |      2.09       1.96 |      2.06 
-------------+----------------------+----------
     Current |     4,821      1,231 |     6,052 
             |     11.95      12.14 |     11.99 
-------------+----------------------+----------
Unknown (.u) |    33,039      8,294 |    41,333 
             |     81.90      81.78 |     81.87 
-------------+----------------------+----------
       Total |    40,343     10,142 |    50,485 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |   outcome suspected
Respirator |         case
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,354      8,133 |    40,487 
           |     80.20      80.19 |     80.20 
-----------+----------------------+----------
         1 |     7,989      2,009 |     9,998 
           |     19.80      19.81 |     19.80 
-----------+----------------------+----------
     Total |    40,343     10,142 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome suspected
    Asthma |         case
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,338      8,082 |    40,420 
           |     80.16      79.69 |     80.06 
-----------+----------------------+----------
         1 |     8,005      2,060 |    10,065 
           |     19.84      20.31 |     19.94 
-----------+----------------------+----------
     Total |    40,343     10,142 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

      Asthma |   outcome suspected
    detailed |         case
  categories |         0          1 |     Total
-------------+----------------------+----------
          No |    32,338      8,082 |    40,420 
             |     80.16      79.69 |     80.06 
-------------+----------------------+----------
 Yes, no OCS |     8,005      2,060 |    10,065 
             |     19.84      20.31 |     19.94 
-------------+----------------------+----------
       Total |    40,343     10,142 |    50,485 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |   outcome suspected
   Cardiac |         case
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,277      8,125 |    40,402 
           |     80.01      80.11 |     80.03 
-----------+----------------------+----------
         1 |     8,066      2,017 |    10,083 
           |     19.99      19.89 |     19.97 
-----------+----------------------+----------
     Total |    40,343     10,142 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome suspected
  Diabetes |         case
   by type |         0          1 |     Total
-----------+----------------------+----------
     NO_DM |    30,130      7,560 |    37,690 
           |     74.68      74.54 |     74.66 
-----------+----------------------+----------
      T1DM |     1,232        259 |     1,491 
           |      3.05       2.55 |      2.95 
-----------+----------------------+----------
      T2DM |     8,148      2,126 |    10,274 
           |     20.20      20.96 |     20.35 
-----------+----------------------+----------
UNKNOWN_DM |       833        197 |     1,030 
           |      2.06       1.94 |      2.04 
-----------+----------------------+----------
     Total |    40,343     10,142 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Diabetes |   outcome suspected
    exeter |         case
      type |         0          1 |     Total
-----------+----------------------+----------
     NO_DM |    31,027      7,853 |    38,880 
           |     76.91      77.43 |     77.01 
-----------+----------------------+----------
T1DM_EX_OS |     1,191        294 |     1,485 
           |      2.95       2.90 |      2.94 
-----------+----------------------+----------
T2DM_EX_OS |     8,125      1,995 |    10,120 
           |     20.14      19.67 |     20.05 
-----------+----------------------+----------
     Total |    40,343     10,142 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome suspected
           |         case
    Cancer |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,277      8,092 |    40,369 
           |     80.01      79.79 |     79.96 
-----------+----------------------+----------
         1 |     8,066      2,050 |    10,116 
           |     19.99      20.21 |     20.04 
-----------+----------------------+----------
     Total |    40,343     10,142 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |   outcome suspected
     liver |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,258      8,141 |    40,399 
           |     79.96      80.27 |     80.02 
-----------+----------------------+----------
         1 |     8,085      2,001 |    10,086 
           |     20.04      19.73 |     19.98 
-----------+----------------------+----------
     Total |    40,343     10,142 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome suspected
           |         case
    Stroke |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,355      8,100 |    40,455 
           |     80.20      79.87 |     80.13 
-----------+----------------------+----------
         1 |     7,988      2,042 |    10,030 
           |     19.80      20.13 |     19.87 
-----------+----------------------+----------
     Total |    40,343     10,142 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome suspected
           |         case
  Dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,217      8,124 |    40,341 
           |     79.86      80.10 |     79.91 
-----------+----------------------+----------
         1 |     8,126      2,018 |    10,144 
           |     20.14      19.90 |     20.09 
-----------+----------------------+----------
     Total |    40,343     10,142 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome suspected
Neurologic |         case
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,305      8,105 |    40,410 
           |     80.08      79.92 |     80.04 
-----------+----------------------+----------
         1 |     8,038      2,037 |    10,075 
           |     19.92      20.08 |     19.96 
-----------+----------------------+----------
     Total |    40,343     10,142 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   outcome suspected
       Reduced kidney |         case
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |    39,890     10,004 |    49,894 
                      |     98.88      98.64 |     98.83 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |       453        138 |       591 
                      |      1.12       1.36 |      1.17 
----------------------+----------------------+----------
                Total |    40,343     10,142 |    50,485 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome suspected
Autoimmune |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,235      8,124 |    40,359 
           |     79.90      80.10 |     79.94 
-----------+----------------------+----------
         1 |     8,108      2,018 |    10,126 
           |     20.10      19.90 |     20.06 
-----------+----------------------+----------
     Total |    40,343     10,142 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        Index of |
        Multiple |   outcome suspected
     Deprivation |         case
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |    28,267      7,067 |    35,334 
                 |     70.07      69.68 |     69.99 
-----------------+----------------------+----------
               4 |     8,018      1,995 |    10,013 
                 |     19.87      19.67 |     19.83 
-----------------+----------------------+----------
 5 most deprived |     4,058      1,080 |     5,138 
                 |     10.06      10.65 |     10.18 
-----------------+----------------------+----------
           Total |    40,343     10,142 |    50,485 
                 |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Rural-Urba |   outcome suspected
         n |         case
 Indicator |         0          1 |     Total
-----------+----------------------+----------
     rural |     4,118        988 |     5,106 
           |     10.21       9.74 |     10.11 
-----------+----------------------+----------
     urban |    36,225      9,154 |    45,379 
           |     89.79      90.26 |     89.89 
-----------+----------------------+----------
     Total |    40,343     10,142 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   outcome suspected
                      |         case
    Region of England |         0          1 |     Total
----------------------+----------------------+----------
        East Midlands |     4,087      1,003 |     5,090 
                      |     10.13       9.89 |     10.08 
----------------------+----------------------+----------
      East of England |     4,012      1,005 |     5,017 
                      |      9.94       9.91 |      9.94 
----------------------+----------------------+----------
               London |     8,142      2,088 |    10,230 
                      |     20.18      20.59 |     20.26 
----------------------+----------------------+----------
           North East |     4,041        969 |     5,010 
                      |     10.02       9.55 |      9.92 
----------------------+----------------------+----------
           North West |     4,020      1,010 |     5,030 
                      |      9.96       9.96 |      9.96 
----------------------+----------------------+----------
           South East |     8,063      2,043 |    10,106 
                      |     19.99      20.14 |     20.02 
----------------------+----------------------+----------
        West Midlands |     3,990      1,023 |     5,013 
                      |      9.89      10.09 |      9.93 
----------------------+----------------------+----------
Yorkshire and the H.. |     3,988      1,001 |     4,989 
                      |      9.89       9.87 |      9.88 
----------------------+----------------------+----------
                Total |    40,343     10,142 |    50,485 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome confirmed
   Grouped |         case
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     7,849      1,978 |     9,827 
           |     19.45      19.54 |     19.47 
-----------+----------------------+----------
    30-<40 |     6,860      1,725 |     8,585 
           |     17.00      17.04 |     17.01 
-----------+----------------------+----------
    40-<50 |     6,671      1,554 |     8,225 
           |     16.53      15.35 |     16.29 
-----------+----------------------+----------
    50-<60 |     6,798      1,731 |     8,529 
           |     16.84      17.10 |     16.89 
-----------+----------------------+----------
    60-<70 |     5,374      1,402 |     6,776 
           |     13.31      13.85 |     13.42 
-----------+----------------------+----------
    70-<80 |     4,305      1,104 |     5,409 
           |     10.67      10.90 |     10.71 
-----------+----------------------+----------
       80+ |     2,504        630 |     3,134 
           |      6.20       6.22 |      6.21 
-----------+----------------------+----------
     Total |    40,361     10,124 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome confirmed
           |         case
      Male |         0          1 |     Total
-----------+----------------------+----------
    Female |    20,732      5,142 |    25,874 
           |     51.37      50.79 |     51.25 
-----------+----------------------+----------
      Male |    19,629      4,982 |    24,611 
           |     48.63      49.21 |     48.75 
-----------+----------------------+----------
     Total |    40,361     10,124 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   outcome confirmed
                      |         case
     Eth 5 categories |         0          1 |     Total
----------------------+----------------------+----------
                White |    24,299      6,133 |    30,432 
                      |     60.20      60.58 |     60.28 
----------------------+----------------------+----------
                Mixed |     1,550        407 |     1,957 
                      |      3.84       4.02 |      3.88 
----------------------+----------------------+----------
Asian or Asian Britis |     1,468        373 |     1,841 
                      |      3.64       3.68 |      3.65 
----------------------+----------------------+----------
                Black |     1,442        390 |     1,832 
                      |      3.57       3.85 |      3.63 
----------------------+----------------------+----------
                Other |     1,468        341 |     1,809 
                      |      3.64       3.37 |      3.58 
----------------------+----------------------+----------
                    . |    10,134      2,480 |    12,614 
                      |     25.11      24.50 |     24.99 
----------------------+----------------------+----------
                Total |    40,361     10,124 |    50,485 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   outcome confirmed
                      |         case
    Eth 16 categories |         0          1 |     Total
----------------------+----------------------+----------
British or Mixed Brit |    11,531      2,770 |    14,301 
                      |     28.57      27.36 |     28.33 
----------------------+----------------------+----------
                Irish |     2,245        591 |     2,836 
                      |      5.56       5.84 |      5.62 
----------------------+----------------------+----------
          Other White |     1,032        293 |     1,325 
                      |      2.56       2.89 |      2.62 
----------------------+----------------------+----------
White + Black Caribbe |     1,126        275 |     1,401 
                      |      2.79       2.72 |      2.78 
----------------------+----------------------+----------
White + Black African |     1,156        266 |     1,422 
                      |      2.86       2.63 |      2.82 
----------------------+----------------------+----------
        White + Asian |     1,143        322 |     1,465 
                      |      2.83       3.18 |      2.90 
----------------------+----------------------+----------
          Other mixed |     1,095        278 |     1,373 
                      |      2.71       2.75 |      2.72 
----------------------+----------------------+----------
Indian or British Ind |     1,068        292 |     1,360 
                      |      2.65       2.88 |      2.69 
----------------------+----------------------+----------
Pakistani or British  |       479        131 |       610 
                      |      1.19       1.29 |      1.21 
----------------------+----------------------+----------
Bangladeshi or Britis |       447        128 |       575 
                      |      1.11       1.26 |      1.14 
----------------------+----------------------+----------
          Other Asian |       206         62 |       268 
                      |      0.51       0.61 |      0.53 
----------------------+----------------------+----------
            Caribbean |       210         55 |       265 
                      |      0.52       0.54 |      0.52 
----------------------+----------------------+----------
              African |       226         52 |       278 
                      |      0.56       0.51 |      0.55 
----------------------+----------------------+----------
          Other Black |       199         72 |       271 
                      |      0.49       0.71 |      0.54 
----------------------+----------------------+----------
              Chinese |       226         61 |       287 
                      |      0.56       0.60 |      0.57 
----------------------+----------------------+----------
                Other |       214         53 |       267 
                      |      0.53       0.52 |      0.53 
----------------------+----------------------+----------
                    . |    17,758      4,423 |    22,181 
                      |     44.00      43.69 |     43.94 
----------------------+----------------------+----------
                Total |    40,361     10,124 |    50,485 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   outcome confirmed
                     |         case
                 BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |       190         54 |       244 
                     |      0.47       0.53 |      0.48 
---------------------+----------------------+----------
  Normal (18.5-24.9) |       820        198 |     1,018 
                     |      2.03       1.96 |      2.02 
---------------------+----------------------+----------
Overweight (25-29.9) |     1,159        293 |     1,452 
                     |      2.87       2.89 |      2.88 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,385        384 |     1,769 
                     |      3.43       3.79 |      3.50 
---------------------+----------------------+----------
  Obese II (35-39.9) |     1,445        358 |     1,803 
                     |      3.58       3.54 |      3.57 
---------------------+----------------------+----------
     Obese III (40+) |     1,771        485 |     2,256 
                     |      4.39       4.79 |      4.47 
---------------------+----------------------+----------
        Unknown (.u) |    33,591      8,352 |    41,943 
                     |     83.23      82.50 |     83.08 
---------------------+----------------------+----------
               Total |    40,361     10,124 |    50,485 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   outcome confirmed
          Obesity (4 |         case
         categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |    35,760      8,897 |    44,657 
                     |     88.60      87.88 |     88.46 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,385        384 |     1,769 
                     |      3.43       3.79 |      3.50 
---------------------+----------------------+----------
  Obese II (35-39.9) |     1,445        358 |     1,803 
                     |      3.58       3.54 |      3.57 
---------------------+----------------------+----------
     Obese III (40+) |     1,771        485 |     2,256 
                     |      4.39       4.79 |      4.47 
---------------------+----------------------+----------
               Total |    40,361     10,124 |    50,485 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  BMI with |   outcome confirmed
        SA |         case
categories |         0          1 |     Total
-----------+----------------------+----------
         1 |       190         54 |       244 
           |      0.47       0.53 |      0.48 
-----------+----------------------+----------
         2 |       804        197 |     1,001 
           |      1.99       1.95 |      1.98 
-----------+----------------------+----------
         3 |     1,163        286 |     1,449 
           |      2.88       2.82 |      2.87 
-----------+----------------------+----------
         4 |     1,397        392 |     1,789 
           |      3.46       3.87 |      3.54 
-----------+----------------------+----------
         5 |     1,445        358 |     1,803 
           |      3.58       3.54 |      3.57 
-----------+----------------------+----------
         6 |     1,771        485 |     2,256 
           |      4.39       4.79 |      4.47 
-----------+----------------------+----------
        .u |    33,591      8,352 |    41,943 
           |     83.23      82.50 |     83.08 
-----------+----------------------+----------
     Total |    40,361     10,124 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   outcome confirmed
      Obesity with SA |         case
           categories |         0          1 |     Total
----------------------+----------------------+----------
 No record of obesity |    35,748      8,889 |    44,637 
                      |     88.57      87.80 |     88.42 
----------------------+----------------------+----------
Obese I (30-34.9 / 27 |     1,397        392 |     1,789 
                      |      3.46       3.87 |      3.54 
----------------------+----------------------+----------
   Obese II (35-39.9) |     1,445        358 |     1,803 
                      |      3.58       3.54 |      3.57 
----------------------+----------------------+----------
      Obese III (40+) |     1,771        485 |     2,256 
                      |      4.39       4.79 |      4.47 
----------------------+----------------------+----------
                Total |    40,361     10,124 |    50,485 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   outcome confirmed
     Smoking |         case
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |     1,622        436 |     2,058 
             |      4.02       4.31 |      4.08 
-------------+----------------------+----------
      Former |       835        207 |     1,042 
             |      2.07       2.04 |      2.06 
-------------+----------------------+----------
     Current |     4,863      1,189 |     6,052 
             |     12.05      11.74 |     11.99 
-------------+----------------------+----------
Unknown (.u) |    33,041      8,292 |    41,333 
             |     81.86      81.90 |     81.87 
-------------+----------------------+----------
       Total |    40,361     10,124 |    50,485 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |   outcome confirmed
Respirator |         case
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,404      8,083 |    40,487 
           |     80.29      79.84 |     80.20 
-----------+----------------------+----------
         1 |     7,957      2,041 |     9,998 
           |     19.71      20.16 |     19.80 
-----------+----------------------+----------
     Total |    40,361     10,124 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome confirmed
    Asthma |         case
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,367      8,053 |    40,420 
           |     80.19      79.54 |     80.06 
-----------+----------------------+----------
         1 |     7,994      2,071 |    10,065 
           |     19.81      20.46 |     19.94 
-----------+----------------------+----------
     Total |    40,361     10,124 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

      Asthma |   outcome confirmed
    detailed |         case
  categories |         0          1 |     Total
-------------+----------------------+----------
          No |    32,367      8,053 |    40,420 
             |     80.19      79.54 |     80.06 
-------------+----------------------+----------
 Yes, no OCS |     7,994      2,071 |    10,065 
             |     19.81      20.46 |     19.94 
-------------+----------------------+----------
       Total |    40,361     10,124 |    50,485 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |   outcome confirmed
   Cardiac |         case
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,282      8,120 |    40,402 
           |     79.98      80.21 |     80.03 
-----------+----------------------+----------
         1 |     8,079      2,004 |    10,083 
           |     20.02      19.79 |     19.97 
-----------+----------------------+----------
     Total |    40,361     10,124 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome confirmed
  Diabetes |         case
   by type |         0          1 |     Total
-----------+----------------------+----------
     NO_DM |    30,087      7,603 |    37,690 
           |     74.54      75.10 |     74.66 
-----------+----------------------+----------
      T1DM |     1,186        305 |     1,491 
           |      2.94       3.01 |      2.95 
-----------+----------------------+----------
      T2DM |     8,238      2,036 |    10,274 
           |     20.41      20.11 |     20.35 
-----------+----------------------+----------
UNKNOWN_DM |       850        180 |     1,030 
           |      2.11       1.78 |      2.04 
-----------+----------------------+----------
     Total |    40,361     10,124 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Diabetes |   outcome confirmed
    exeter |         case
      type |         0          1 |     Total
-----------+----------------------+----------
     NO_DM |    31,043      7,837 |    38,880 
           |     76.91      77.41 |     77.01 
-----------+----------------------+----------
T1DM_EX_OS |     1,221        264 |     1,485 
           |      3.03       2.61 |      2.94 
-----------+----------------------+----------
T2DM_EX_OS |     8,097      2,023 |    10,120 
           |     20.06      19.98 |     20.05 
-----------+----------------------+----------
     Total |    40,361     10,124 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome confirmed
           |         case
    Cancer |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,247      8,122 |    40,369 
           |     79.90      80.23 |     79.96 
-----------+----------------------+----------
         1 |     8,114      2,002 |    10,116 
           |     20.10      19.77 |     20.04 
-----------+----------------------+----------
     Total |    40,361     10,124 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |   outcome confirmed
     liver |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,297      8,102 |    40,399 
           |     80.02      80.03 |     80.02 
-----------+----------------------+----------
         1 |     8,064      2,022 |    10,086 
           |     19.98      19.97 |     19.98 
-----------+----------------------+----------
     Total |    40,361     10,124 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome confirmed
           |         case
    Stroke |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,376      8,079 |    40,455 
           |     80.22      79.80 |     80.13 
-----------+----------------------+----------
         1 |     7,985      2,045 |    10,030 
           |     19.78      20.20 |     19.87 
-----------+----------------------+----------
     Total |    40,361     10,124 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome confirmed
           |         case
  Dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,220      8,121 |    40,341 
           |     79.83      80.22 |     79.91 
-----------+----------------------+----------
         1 |     8,141      2,003 |    10,144 
           |     20.17      19.78 |     20.09 
-----------+----------------------+----------
     Total |    40,361     10,124 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome confirmed
Neurologic |         case
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,301      8,109 |    40,410 
           |     80.03      80.10 |     80.04 
-----------+----------------------+----------
         1 |     8,060      2,015 |    10,075 
           |     19.97      19.90 |     19.96 
-----------+----------------------+----------
     Total |    40,361     10,124 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   outcome confirmed
       Reduced kidney |         case
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |    39,887     10,007 |    49,894 
                      |     98.83      98.84 |     98.83 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |       474        117 |       591 
                      |      1.17       1.16 |      1.17 
----------------------+----------------------+----------
                Total |    40,361     10,124 |    50,485 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome confirmed
Autoimmune |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,264      8,095 |    40,359 
           |     79.94      79.96 |     79.94 
-----------+----------------------+----------
         1 |     8,097      2,029 |    10,126 
           |     20.06      20.04 |     20.06 
-----------+----------------------+----------
     Total |    40,361     10,124 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        Index of |
        Multiple |   outcome confirmed
     Deprivation |         case
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |    28,240      7,094 |    35,334 
                 |     69.97      70.07 |     69.99 
-----------------+----------------------+----------
               4 |     7,970      2,043 |    10,013 
                 |     19.75      20.18 |     19.83 
-----------------+----------------------+----------
 5 most deprived |     4,151        987 |     5,138 
                 |     10.28       9.75 |     10.18 
-----------------+----------------------+----------
           Total |    40,361     10,124 |    50,485 
                 |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Rural-Urba |   outcome confirmed
         n |         case
 Indicator |         0          1 |     Total
-----------+----------------------+----------
     rural |     4,041      1,065 |     5,106 
           |     10.01      10.52 |     10.11 
-----------+----------------------+----------
     urban |    36,320      9,059 |    45,379 
           |     89.99      89.48 |     89.89 
-----------+----------------------+----------
     Total |    40,361     10,124 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   outcome confirmed
                      |         case
    Region of England |         0          1 |     Total
----------------------+----------------------+----------
        East Midlands |     4,084      1,006 |     5,090 
                      |     10.12       9.94 |     10.08 
----------------------+----------------------+----------
      East of England |     3,990      1,027 |     5,017 
                      |      9.89      10.14 |      9.94 
----------------------+----------------------+----------
               London |     8,197      2,033 |    10,230 
                      |     20.31      20.08 |     20.26 
----------------------+----------------------+----------
           North East |     3,984      1,026 |     5,010 
                      |      9.87      10.13 |      9.92 
----------------------+----------------------+----------
           North West |     4,054        976 |     5,030 
                      |     10.04       9.64 |      9.96 
----------------------+----------------------+----------
           South East |     8,100      2,006 |    10,106 
                      |     20.07      19.81 |     20.02 
----------------------+----------------------+----------
        West Midlands |     3,989      1,024 |     5,013 
                      |      9.88      10.11 |      9.93 
----------------------+----------------------+----------
Yorkshire and the H.. |     3,963      1,026 |     4,989 
                      |      9.82      10.13 |      9.88 
----------------------+----------------------+----------
                Total |    40,361     10,124 |    50,485 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome SGSS test
   Grouped |       performed
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     7,889      1,938 |     9,827 
           |     19.51      19.30 |     19.47 
-----------+----------------------+----------
    30-<40 |     6,943      1,642 |     8,585 
           |     17.17      16.35 |     17.01 
-----------+----------------------+----------
    40-<50 |     6,612      1,613 |     8,225 
           |     16.35      16.06 |     16.29 
-----------+----------------------+----------
    50-<60 |     6,795      1,734 |     8,529 
           |     16.80      17.27 |     16.89 
-----------+----------------------+----------
    60-<70 |     5,383      1,393 |     6,776 
           |     13.31      13.87 |     13.42 
-----------+----------------------+----------
    70-<80 |     4,336      1,073 |     5,409 
           |     10.72      10.69 |     10.71 
-----------+----------------------+----------
       80+ |     2,485        649 |     3,134 
           |      6.14       6.46 |      6.21 
-----------+----------------------+----------
     Total |    40,443     10,042 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome SGSS test
           |       performed
      Male |         0          1 |     Total
-----------+----------------------+----------
    Female |    20,759      5,115 |    25,874 
           |     51.33      50.94 |     51.25 
-----------+----------------------+----------
      Male |    19,684      4,927 |    24,611 
           |     48.67      49.06 |     48.75 
-----------+----------------------+----------
     Total |    40,443     10,042 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   outcome SGSS test
                      |       performed
     Eth 5 categories |         0          1 |     Total
----------------------+----------------------+----------
                White |    24,448      5,984 |    30,432 
                      |     60.45      59.59 |     60.28 
----------------------+----------------------+----------
                Mixed |     1,565        392 |     1,957 
                      |      3.87       3.90 |      3.88 
----------------------+----------------------+----------
Asian or Asian Britis |     1,469        372 |     1,841 
                      |      3.63       3.70 |      3.65 
----------------------+----------------------+----------
                Black |     1,447        385 |     1,832 
                      |      3.58       3.83 |      3.63 
----------------------+----------------------+----------
                Other |     1,454        355 |     1,809 
                      |      3.60       3.54 |      3.58 
----------------------+----------------------+----------
                    . |    10,060      2,554 |    12,614 
                      |     24.87      25.43 |     24.99 
----------------------+----------------------+----------
                Total |    40,443     10,042 |    50,485 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   outcome SGSS test
                      |       performed
    Eth 16 categories |         0          1 |     Total
----------------------+----------------------+----------
British or Mixed Brit |    11,524      2,777 |    14,301 
                      |     28.49      27.65 |     28.33 
----------------------+----------------------+----------
                Irish |     2,250        586 |     2,836 
                      |      5.56       5.84 |      5.62 
----------------------+----------------------+----------
          Other White |     1,053        272 |     1,325 
                      |      2.60       2.71 |      2.62 
----------------------+----------------------+----------
White + Black Caribbe |     1,122        279 |     1,401 
                      |      2.77       2.78 |      2.78 
----------------------+----------------------+----------
White + Black African |     1,121        301 |     1,422 
                      |      2.77       3.00 |      2.82 
----------------------+----------------------+----------
        White + Asian |     1,171        294 |     1,465 
                      |      2.90       2.93 |      2.90 
----------------------+----------------------+----------
          Other mixed |     1,082        291 |     1,373 
                      |      2.68       2.90 |      2.72 
----------------------+----------------------+----------
Indian or British Ind |     1,087        273 |     1,360 
                      |      2.69       2.72 |      2.69 
----------------------+----------------------+----------
Pakistani or British  |       488        122 |       610 
                      |      1.21       1.21 |      1.21 
----------------------+----------------------+----------
Bangladeshi or Britis |       448        127 |       575 
                      |      1.11       1.26 |      1.14 
----------------------+----------------------+----------
          Other Asian |       206         62 |       268 
                      |      0.51       0.62 |      0.53 
----------------------+----------------------+----------
            Caribbean |       222         43 |       265 
                      |      0.55       0.43 |      0.52 
----------------------+----------------------+----------
              African |       222         56 |       278 
                      |      0.55       0.56 |      0.55 
----------------------+----------------------+----------
          Other Black |       217         54 |       271 
                      |      0.54       0.54 |      0.54 
----------------------+----------------------+----------
              Chinese |       235         52 |       287 
                      |      0.58       0.52 |      0.57 
----------------------+----------------------+----------
                Other |       221         46 |       267 
                      |      0.55       0.46 |      0.53 
----------------------+----------------------+----------
                    . |    17,774      4,407 |    22,181 
                      |     43.95      43.89 |     43.94 
----------------------+----------------------+----------
                Total |    40,443     10,042 |    50,485 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   outcome SGSS test
                     |       performed
                 BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |       183         61 |       244 
                     |      0.45       0.61 |      0.48 
---------------------+----------------------+----------
  Normal (18.5-24.9) |       804        214 |     1,018 
                     |      1.99       2.13 |      2.02 
---------------------+----------------------+----------
Overweight (25-29.9) |     1,177        275 |     1,452 
                     |      2.91       2.74 |      2.88 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,425        344 |     1,769 
                     |      3.52       3.43 |      3.50 
---------------------+----------------------+----------
  Obese II (35-39.9) |     1,457        346 |     1,803 
                     |      3.60       3.45 |      3.57 
---------------------+----------------------+----------
     Obese III (40+) |     1,851        405 |     2,256 
                     |      4.58       4.03 |      4.47 
---------------------+----------------------+----------
        Unknown (.u) |    33,546      8,397 |    41,943 
                     |     82.95      83.62 |     83.08 
---------------------+----------------------+----------
               Total |    40,443     10,042 |    50,485 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   outcome SGSS test
          Obesity (4 |       performed
         categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |    35,710      8,947 |    44,657 
                     |     88.30      89.10 |     88.46 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,425        344 |     1,769 
                     |      3.52       3.43 |      3.50 
---------------------+----------------------+----------
  Obese II (35-39.9) |     1,457        346 |     1,803 
                     |      3.60       3.45 |      3.57 
---------------------+----------------------+----------
     Obese III (40+) |     1,851        405 |     2,256 
                     |      4.58       4.03 |      4.47 
---------------------+----------------------+----------
               Total |    40,443     10,042 |    50,485 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  BMI with |   outcome SGSS test
        SA |       performed
categories |         0          1 |     Total
-----------+----------------------+----------
         1 |       183         61 |       244 
           |      0.45       0.61 |      0.48 
-----------+----------------------+----------
         2 |       789        212 |     1,001 
           |      1.95       2.11 |      1.98 
-----------+----------------------+----------
         3 |     1,174        275 |     1,449 
           |      2.90       2.74 |      2.87 
-----------+----------------------+----------
         4 |     1,443        346 |     1,789 
           |      3.57       3.45 |      3.54 
-----------+----------------------+----------
         5 |     1,457        346 |     1,803 
           |      3.60       3.45 |      3.57 
-----------+----------------------+----------
         6 |     1,851        405 |     2,256 
           |      4.58       4.03 |      4.47 
-----------+----------------------+----------
        .u |    33,546      8,397 |    41,943 
           |     82.95      83.62 |     83.08 
-----------+----------------------+----------
     Total |    40,443     10,042 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   outcome SGSS test
      Obesity with SA |       performed
           categories |         0          1 |     Total
----------------------+----------------------+----------
 No record of obesity |    35,692      8,945 |    44,637 
                      |     88.25      89.08 |     88.42 
----------------------+----------------------+----------
Obese I (30-34.9 / 27 |     1,443        346 |     1,789 
                      |      3.57       3.45 |      3.54 
----------------------+----------------------+----------
   Obese II (35-39.9) |     1,457        346 |     1,803 
                      |      3.60       3.45 |      3.57 
----------------------+----------------------+----------
      Obese III (40+) |     1,851        405 |     2,256 
                      |      4.58       4.03 |      4.47 
----------------------+----------------------+----------
                Total |    40,443     10,042 |    50,485 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   outcome SGSS test
     Smoking |       performed
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |     1,670        388 |     2,058 
             |      4.13       3.86 |      4.08 
-------------+----------------------+----------
      Former |       819        223 |     1,042 
             |      2.03       2.22 |      2.06 
-------------+----------------------+----------
     Current |     4,923      1,129 |     6,052 
             |     12.17      11.24 |     11.99 
-------------+----------------------+----------
Unknown (.u) |    33,031      8,302 |    41,333 
             |     81.67      82.67 |     81.87 
-------------+----------------------+----------
       Total |    40,443     10,042 |    50,485 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |   outcome SGSS test
Respirator |       performed
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,426      8,061 |    40,487 
           |     80.18      80.27 |     80.20 
-----------+----------------------+----------
         1 |     8,017      1,981 |     9,998 
           |     19.82      19.73 |     19.80 
-----------+----------------------+----------
     Total |    40,443     10,042 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome SGSS test
    Asthma |       performed
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,356      8,064 |    40,420 
           |     80.00      80.30 |     80.06 
-----------+----------------------+----------
         1 |     8,087      1,978 |    10,065 
           |     20.00      19.70 |     19.94 
-----------+----------------------+----------
     Total |    40,443     10,042 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

      Asthma |   outcome SGSS test
    detailed |       performed
  categories |         0          1 |     Total
-------------+----------------------+----------
          No |    32,356      8,064 |    40,420 
             |     80.00      80.30 |     80.06 
-------------+----------------------+----------
 Yes, no OCS |     8,087      1,978 |    10,065 
             |     20.00      19.70 |     19.94 
-------------+----------------------+----------
       Total |    40,443     10,042 |    50,485 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |   outcome SGSS test
   Cardiac |       performed
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,409      7,993 |    40,402 
           |     80.14      79.60 |     80.03 
-----------+----------------------+----------
         1 |     8,034      2,049 |    10,083 
           |     19.86      20.40 |     19.97 
-----------+----------------------+----------
     Total |    40,443     10,042 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome SGSS test
  Diabetes |       performed
   by type |         0          1 |     Total
-----------+----------------------+----------
     NO_DM |    30,237      7,453 |    37,690 
           |     74.76      74.22 |     74.66 
-----------+----------------------+----------
      T1DM |     1,207        284 |     1,491 
           |      2.98       2.83 |      2.95 
-----------+----------------------+----------
      T2DM |     8,169      2,105 |    10,274 
           |     20.20      20.96 |     20.35 
-----------+----------------------+----------
UNKNOWN_DM |       830        200 |     1,030 
           |      2.05       1.99 |      2.04 
-----------+----------------------+----------
     Total |    40,443     10,042 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Diabetes |   outcome SGSS test
    exeter |       performed
      type |         0          1 |     Total
-----------+----------------------+----------
     NO_DM |    31,172      7,708 |    38,880 
           |     77.08      76.76 |     77.01 
-----------+----------------------+----------
T1DM_EX_OS |     1,166        319 |     1,485 
           |      2.88       3.18 |      2.94 
-----------+----------------------+----------
T2DM_EX_OS |     8,105      2,015 |    10,120 
           |     20.04      20.07 |     20.05 
-----------+----------------------+----------
     Total |    40,443     10,042 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome SGSS test
           |       performed
    Cancer |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,321      8,048 |    40,369 
           |     79.92      80.14 |     79.96 
-----------+----------------------+----------
         1 |     8,122      1,994 |    10,116 
           |     20.08      19.86 |     20.04 
-----------+----------------------+----------
     Total |    40,443     10,042 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |   outcome SGSS test
     liver |       performed
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,401      7,998 |    40,399 
           |     80.12      79.65 |     80.02 
-----------+----------------------+----------
         1 |     8,042      2,044 |    10,086 
           |     19.88      20.35 |     19.98 
-----------+----------------------+----------
     Total |    40,443     10,042 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome SGSS test
           |       performed
    Stroke |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,379      8,076 |    40,455 
           |     80.06      80.42 |     80.13 
-----------+----------------------+----------
         1 |     8,064      1,966 |    10,030 
           |     19.94      19.58 |     19.87 
-----------+----------------------+----------
     Total |    40,443     10,042 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome SGSS test
           |       performed
  Dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,262      8,079 |    40,341 
           |     79.77      80.45 |     79.91 
-----------+----------------------+----------
         1 |     8,181      1,963 |    10,144 
           |     20.23      19.55 |     20.09 
-----------+----------------------+----------
     Total |    40,443     10,042 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome SGSS test
Neurologic |       performed
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,373      8,037 |    40,410 
           |     80.05      80.03 |     80.04 
-----------+----------------------+----------
         1 |     8,070      2,005 |    10,075 
           |     19.95      19.97 |     19.96 
-----------+----------------------+----------
     Total |    40,443     10,042 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   outcome SGSS test
       Reduced kidney |       performed
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |    39,957      9,937 |    49,894 
                      |     98.80      98.95 |     98.83 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |       486        105 |       591 
                      |      1.20       1.05 |      1.17 
----------------------+----------------------+----------
                Total |    40,443     10,042 |    50,485 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome SGSS test
Autoimmune |       performed
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,359      8,000 |    40,359 
           |     80.01      79.67 |     79.94 
-----------+----------------------+----------
         1 |     8,084      2,042 |    10,126 
           |     19.99      20.33 |     20.06 
-----------+----------------------+----------
     Total |    40,443     10,042 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        Index of |
        Multiple |   outcome SGSS test
     Deprivation |       performed
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |    28,253      7,081 |    35,334 
                 |     69.86      70.51 |     69.99 
-----------------+----------------------+----------
               4 |     8,066      1,947 |    10,013 
                 |     19.94      19.39 |     19.83 
-----------------+----------------------+----------
 5 most deprived |     4,124      1,014 |     5,138 
                 |     10.20      10.10 |     10.18 
-----------------+----------------------+----------
           Total |    40,443     10,042 |    50,485 
                 |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Rural-Urba |   outcome SGSS test
         n |       performed
 Indicator |         0          1 |     Total
-----------+----------------------+----------
     rural |     4,105      1,001 |     5,106 
           |     10.15       9.97 |     10.11 
-----------+----------------------+----------
     urban |    36,338      9,041 |    45,379 
           |     89.85      90.03 |     89.89 
-----------+----------------------+----------
     Total |    40,443     10,042 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   outcome SGSS test
                      |       performed
    Region of England |         0          1 |     Total
----------------------+----------------------+----------
        East Midlands |     4,116        974 |     5,090 
                      |     10.18       9.70 |     10.08 
----------------------+----------------------+----------
      East of England |     4,046        971 |     5,017 
                      |     10.00       9.67 |      9.94 
----------------------+----------------------+----------
               London |     8,174      2,056 |    10,230 
                      |     20.21      20.47 |     20.26 
----------------------+----------------------+----------
           North East |     4,010      1,000 |     5,010 
                      |      9.92       9.96 |      9.92 
----------------------+----------------------+----------
           North West |     4,026      1,004 |     5,030 
                      |      9.95      10.00 |      9.96 
----------------------+----------------------+----------
           South East |     8,112      1,994 |    10,106 
                      |     20.06      19.86 |     20.02 
----------------------+----------------------+----------
        West Midlands |     3,976      1,037 |     5,013 
                      |      9.83      10.33 |      9.93 
----------------------+----------------------+----------
Yorkshire and the H.. |     3,983      1,006 |     4,989 
                      |      9.85      10.02 |      9.88 
----------------------+----------------------+----------
                Total |    40,443     10,042 |    50,485 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome SGSS test
   Grouped |       positive
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     7,886      1,941 |     9,827 
           |     19.49      19.36 |     19.47 
-----------+----------------------+----------
    30-<40 |     6,905      1,680 |     8,585 
           |     17.07      16.75 |     17.01 
-----------+----------------------+----------
    40-<50 |     6,605      1,620 |     8,225 
           |     16.33      16.15 |     16.29 
-----------+----------------------+----------
    50-<60 |     6,822      1,707 |     8,529 
           |     16.86      17.02 |     16.89 
-----------+----------------------+----------
    60-<70 |     5,432      1,344 |     6,776 
           |     13.43      13.40 |     13.42 
-----------+----------------------+----------
    70-<80 |     4,270      1,139 |     5,409 
           |     10.55      11.36 |     10.71 
-----------+----------------------+----------
       80+ |     2,537        597 |     3,134 
           |      6.27       5.95 |      6.21 
-----------+----------------------+----------
     Total |    40,457     10,028 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome SGSS test
           |       positive
      Male |         0          1 |     Total
-----------+----------------------+----------
    Female |    20,762      5,112 |    25,874 
           |     51.32      50.98 |     51.25 
-----------+----------------------+----------
      Male |    19,695      4,916 |    24,611 
           |     48.68      49.02 |     48.75 
-----------+----------------------+----------
     Total |    40,457     10,028 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   outcome SGSS test
                      |       positive
     Eth 5 categories |         0          1 |     Total
----------------------+----------------------+----------
                White |    24,345      6,087 |    30,432 
                      |     60.18      60.70 |     60.28 
----------------------+----------------------+----------
                Mixed |     1,560        397 |     1,957 
                      |      3.86       3.96 |      3.88 
----------------------+----------------------+----------
Asian or Asian Britis |     1,469        372 |     1,841 
                      |      3.63       3.71 |      3.65 
----------------------+----------------------+----------
                Black |     1,477        355 |     1,832 
                      |      3.65       3.54 |      3.63 
----------------------+----------------------+----------
                Other |     1,457        352 |     1,809 
                      |      3.60       3.51 |      3.58 
----------------------+----------------------+----------
                    . |    10,149      2,465 |    12,614 
                      |     25.09      24.58 |     24.99 
----------------------+----------------------+----------
                Total |    40,457     10,028 |    50,485 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   outcome SGSS test
                      |       positive
    Eth 16 categories |         0          1 |     Total
----------------------+----------------------+----------
British or Mixed Brit |    11,393      2,908 |    14,301 
                      |     28.16      29.00 |     28.33 
----------------------+----------------------+----------
                Irish |     2,283        553 |     2,836 
                      |      5.64       5.51 |      5.62 
----------------------+----------------------+----------
          Other White |     1,062        263 |     1,325 
                      |      2.63       2.62 |      2.62 
----------------------+----------------------+----------
White + Black Caribbe |     1,125        276 |     1,401 
                      |      2.78       2.75 |      2.78 
----------------------+----------------------+----------
White + Black African |     1,160        262 |     1,422 
                      |      2.87       2.61 |      2.82 
----------------------+----------------------+----------
        White + Asian |     1,172        293 |     1,465 
                      |      2.90       2.92 |      2.90 
----------------------+----------------------+----------
          Other mixed |     1,110        263 |     1,373 
                      |      2.74       2.62 |      2.72 
----------------------+----------------------+----------
Indian or British Ind |     1,084        276 |     1,360 
                      |      2.68       2.75 |      2.69 
----------------------+----------------------+----------
Pakistani or British  |       485        125 |       610 
                      |      1.20       1.25 |      1.21 
----------------------+----------------------+----------
Bangladeshi or Britis |       457        118 |       575 
                      |      1.13       1.18 |      1.14 
----------------------+----------------------+----------
          Other Asian |       208         60 |       268 
                      |      0.51       0.60 |      0.53 
----------------------+----------------------+----------
            Caribbean |       208         57 |       265 
                      |      0.51       0.57 |      0.52 
----------------------+----------------------+----------
              African |       230         48 |       278 
                      |      0.57       0.48 |      0.55 
----------------------+----------------------+----------
          Other Black |       217         54 |       271 
                      |      0.54       0.54 |      0.54 
----------------------+----------------------+----------
              Chinese |       242         45 |       287 
                      |      0.60       0.45 |      0.57 
----------------------+----------------------+----------
                Other |       227         40 |       267 
                      |      0.56       0.40 |      0.53 
----------------------+----------------------+----------
                    . |    17,794      4,387 |    22,181 
                      |     43.98      43.75 |     43.94 
----------------------+----------------------+----------
                Total |    40,457     10,028 |    50,485 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   outcome SGSS test
                     |       positive
                 BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |       204         40 |       244 
                     |      0.50       0.40 |      0.48 
---------------------+----------------------+----------
  Normal (18.5-24.9) |       811        207 |     1,018 
                     |      2.00       2.06 |      2.02 
---------------------+----------------------+----------
Overweight (25-29.9) |     1,149        303 |     1,452 
                     |      2.84       3.02 |      2.88 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,419        350 |     1,769 
                     |      3.51       3.49 |      3.50 
---------------------+----------------------+----------
  Obese II (35-39.9) |     1,448        355 |     1,803 
                     |      3.58       3.54 |      3.57 
---------------------+----------------------+----------
     Obese III (40+) |     1,812        444 |     2,256 
                     |      4.48       4.43 |      4.47 
---------------------+----------------------+----------
        Unknown (.u) |    33,614      8,329 |    41,943 
                     |     83.09      83.06 |     83.08 
---------------------+----------------------+----------
               Total |    40,457     10,028 |    50,485 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   outcome SGSS test
          Obesity (4 |       positive
         categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |    35,778      8,879 |    44,657 
                     |     88.43      88.54 |     88.46 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,419        350 |     1,769 
                     |      3.51       3.49 |      3.50 
---------------------+----------------------+----------
  Obese II (35-39.9) |     1,448        355 |     1,803 
                     |      3.58       3.54 |      3.57 
---------------------+----------------------+----------
     Obese III (40+) |     1,812        444 |     2,256 
                     |      4.48       4.43 |      4.47 
---------------------+----------------------+----------
               Total |    40,457     10,028 |    50,485 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  BMI with |   outcome SGSS test
        SA |       positive
categories |         0          1 |     Total
-----------+----------------------+----------
         1 |       204         40 |       244 
           |      0.50       0.40 |      0.48 
-----------+----------------------+----------
         2 |       797        204 |     1,001 
           |      1.97       2.03 |      1.98 
-----------+----------------------+----------
         3 |     1,145        304 |     1,449 
           |      2.83       3.03 |      2.87 
-----------+----------------------+----------
         4 |     1,437        352 |     1,789 
           |      3.55       3.51 |      3.54 
-----------+----------------------+----------
         5 |     1,448        355 |     1,803 
           |      3.58       3.54 |      3.57 
-----------+----------------------+----------
         6 |     1,812        444 |     2,256 
           |      4.48       4.43 |      4.47 
-----------+----------------------+----------
        .u |    33,614      8,329 |    41,943 
           |     83.09      83.06 |     83.08 
-----------+----------------------+----------
     Total |    40,457     10,028 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   outcome SGSS test
      Obesity with SA |       positive
           categories |         0          1 |     Total
----------------------+----------------------+----------
 No record of obesity |    35,760      8,877 |    44,637 
                      |     88.39      88.52 |     88.42 
----------------------+----------------------+----------
Obese I (30-34.9 / 27 |     1,437        352 |     1,789 
                      |      3.55       3.51 |      3.54 
----------------------+----------------------+----------
   Obese II (35-39.9) |     1,448        355 |     1,803 
                      |      3.58       3.54 |      3.57 
----------------------+----------------------+----------
      Obese III (40+) |     1,812        444 |     2,256 
                      |      4.48       4.43 |      4.47 
----------------------+----------------------+----------
                Total |    40,457     10,028 |    50,485 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   outcome SGSS test
     Smoking |       positive
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |     1,648        410 |     2,058 
             |      4.07       4.09 |      4.08 
-------------+----------------------+----------
      Former |       843        199 |     1,042 
             |      2.08       1.98 |      2.06 
-------------+----------------------+----------
     Current |     4,838      1,214 |     6,052 
             |     11.96      12.11 |     11.99 
-------------+----------------------+----------
Unknown (.u) |    33,128      8,205 |    41,333 
             |     81.88      81.82 |     81.87 
-------------+----------------------+----------
       Total |    40,457     10,028 |    50,485 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |   outcome SGSS test
Respirator |       positive
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,420      8,067 |    40,487 
           |     80.13      80.44 |     80.20 
-----------+----------------------+----------
         1 |     8,037      1,961 |     9,998 
           |     19.87      19.56 |     19.80 
-----------+----------------------+----------
     Total |    40,457     10,028 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome SGSS test
    Asthma |       positive
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,413      8,007 |    40,420 
           |     80.12      79.85 |     80.06 
-----------+----------------------+----------
         1 |     8,044      2,021 |    10,065 
           |     19.88      20.15 |     19.94 
-----------+----------------------+----------
     Total |    40,457     10,028 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

      Asthma |   outcome SGSS test
    detailed |       positive
  categories |         0          1 |     Total
-------------+----------------------+----------
          No |    32,413      8,007 |    40,420 
             |     80.12      79.85 |     80.06 
-------------+----------------------+----------
 Yes, no OCS |     8,044      2,021 |    10,065 
             |     19.88      20.15 |     19.94 
-------------+----------------------+----------
       Total |    40,457     10,028 |    50,485 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |   outcome SGSS test
   Cardiac |       positive
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,335      8,067 |    40,402 
           |     79.92      80.44 |     80.03 
-----------+----------------------+----------
         1 |     8,122      1,961 |    10,083 
           |     20.08      19.56 |     19.97 
-----------+----------------------+----------
     Total |    40,457     10,028 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome SGSS test
  Diabetes |       positive
   by type |         0          1 |     Total
-----------+----------------------+----------
     NO_DM |    30,158      7,532 |    37,690 
           |     74.54      75.11 |     74.66 
-----------+----------------------+----------
      T1DM |     1,200        291 |     1,491 
           |      2.97       2.90 |      2.95 
-----------+----------------------+----------
      T2DM |     8,251      2,023 |    10,274 
           |     20.39      20.17 |     20.35 
-----------+----------------------+----------
UNKNOWN_DM |       848        182 |     1,030 
           |      2.10       1.81 |      2.04 
-----------+----------------------+----------
     Total |    40,457     10,028 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Diabetes |   outcome SGSS test
    exeter |       positive
      type |         0          1 |     Total
-----------+----------------------+----------
     NO_DM |    31,184      7,696 |    38,880 
           |     77.08      76.75 |     77.01 
-----------+----------------------+----------
T1DM_EX_OS |     1,179        306 |     1,485 
           |      2.91       3.05 |      2.94 
-----------+----------------------+----------
T2DM_EX_OS |     8,094      2,026 |    10,120 
           |     20.01      20.20 |     20.05 
-----------+----------------------+----------
     Total |    40,457     10,028 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome SGSS test
           |       positive
    Cancer |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,375      7,994 |    40,369 
           |     80.02      79.72 |     79.96 
-----------+----------------------+----------
         1 |     8,082      2,034 |    10,116 
           |     19.98      20.28 |     20.04 
-----------+----------------------+----------
     Total |    40,457     10,028 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |   outcome SGSS test
     liver |       positive
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,400      7,999 |    40,399 
           |     80.09      79.77 |     80.02 
-----------+----------------------+----------
         1 |     8,057      2,029 |    10,086 
           |     19.91      20.23 |     19.98 
-----------+----------------------+----------
     Total |    40,457     10,028 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome SGSS test
           |       positive
    Stroke |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,445      8,010 |    40,455 
           |     80.20      79.88 |     80.13 
-----------+----------------------+----------
         1 |     8,012      2,018 |    10,030 
           |     19.80      20.12 |     19.87 
-----------+----------------------+----------
     Total |    40,457     10,028 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome SGSS test
           |       positive
  Dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,326      8,015 |    40,341 
           |     79.90      79.93 |     79.91 
-----------+----------------------+----------
         1 |     8,131      2,013 |    10,144 
           |     20.10      20.07 |     20.09 
-----------+----------------------+----------
     Total |    40,457     10,028 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome SGSS test
Neurologic |       positive
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,373      8,037 |    40,410 
           |     80.02      80.15 |     80.04 
-----------+----------------------+----------
         1 |     8,084      1,991 |    10,075 
           |     19.98      19.85 |     19.96 
-----------+----------------------+----------
     Total |    40,457     10,028 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   outcome SGSS test
       Reduced kidney |       positive
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |    39,978      9,916 |    49,894 
                      |     98.82      98.88 |     98.83 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |       479        112 |       591 
                      |      1.18       1.12 |      1.17 
----------------------+----------------------+----------
                Total |    40,457     10,028 |    50,485 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome SGSS test
Autoimmune |       positive
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,291      8,068 |    40,359 
           |     79.82      80.45 |     79.94 
-----------+----------------------+----------
         1 |     8,166      1,960 |    10,126 
           |     20.18      19.55 |     20.06 
-----------+----------------------+----------
     Total |    40,457     10,028 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        Index of |
        Multiple |   outcome SGSS test
     Deprivation |       positive
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |    28,386      6,948 |    35,334 
                 |     70.16      69.29 |     69.99 
-----------------+----------------------+----------
               4 |     7,957      2,056 |    10,013 
                 |     19.67      20.50 |     19.83 
-----------------+----------------------+----------
 5 most deprived |     4,114      1,024 |     5,138 
                 |     10.17      10.21 |     10.18 
-----------------+----------------------+----------
           Total |    40,457     10,028 |    50,485 
                 |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Rural-Urba |   outcome SGSS test
         n |       positive
 Indicator |         0          1 |     Total
-----------+----------------------+----------
     rural |     4,088      1,018 |     5,106 
           |     10.10      10.15 |     10.11 
-----------+----------------------+----------
     urban |    36,369      9,010 |    45,379 
           |     89.90      89.85 |     89.89 
-----------+----------------------+----------
     Total |    40,457     10,028 |    50,485 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   outcome SGSS test
                      |       positive
    Region of England |         0          1 |     Total
----------------------+----------------------+----------
        East Midlands |     4,077      1,013 |     5,090 
                      |     10.08      10.10 |     10.08 
----------------------+----------------------+----------
      East of England |     4,005      1,012 |     5,017 
                      |      9.90      10.09 |      9.94 
----------------------+----------------------+----------
               London |     8,220      2,010 |    10,230 
                      |     20.32      20.04 |     20.26 
----------------------+----------------------+----------
           North East |     4,058        952 |     5,010 
                      |     10.03       9.49 |      9.92 
----------------------+----------------------+----------
           North West |     4,019      1,011 |     5,030 
                      |      9.93      10.08 |      9.96 
----------------------+----------------------+----------
           South East |     8,069      2,037 |    10,106 
                      |     19.94      20.31 |     20.02 
----------------------+----------------------+----------
        West Midlands |     3,983      1,030 |     5,013 
                      |      9.85      10.27 |      9.93 
----------------------+----------------------+----------
Yorkshire and the H.. |     4,026        963 |     4,989 
                      |      9.95       9.60 |      9.88 
----------------------+----------------------+----------
                Total |    40,457     10,028 |    50,485 
                      |    100.00     100.00 |    100.00 

. 
. 
. ********************************************
. *  Cumulative incidence of EACH OUTCOME *
. ********************************************
. local p"suspected confirmed tested positivetest ae icu cpnsdeath onsdeath onscoviddeath ons_noncoviddea
> th" //ventilation

. foreach i of local p {
  2.         use "$Tempdir/analysis_dataset_STSET_`i'.dta", clear
  3.         sts list , at(0 80) by(agegroup male) fail
  4. }

         failure _d:  suspected
   analysis time _t:  (stime_suspected-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

              Beg.                      Failure       Std.
    Time     Total     Fail             Function     Error     [95% Conf. Int.]
-------------------------------------------------------------------------------
18-<30 Female 
       0         0        0              0.0000         .          .         .
      80      4993        3              0.0006    0.0003     0.0002    0.0019
18-<30 Male 
       0         0        0              0.0000         .          .         .
      80      4818        3              0.0006    0.0004     0.0002    0.0019
30-<40 Female 
       0         0        0              0.0000         .          .         .
      80      4409        2              0.0005    0.0003     0.0001    0.0018
30-<40 Male 
       0         0        0              0.0000         .          .         .
      80      4167        2              0.0005    0.0003     0.0001    0.0019
40-<50 Female 
       0         0        0              0.0000         .          .         .
      80      4170        3              0.0007    0.0004     0.0002    0.0022
40-<50 Male 
       0         0        0              0.0000         .          .         .
      80      4041        3              0.0007    0.0004     0.0002    0.0023
50-<60 Female 
       0         0        0              0.0000         .          .         .
      80      4396        6              0.0014    0.0006     0.0006    0.0030
50-<60 Male 
       0         0        0              0.0000         .          .         .
      80      4117        3              0.0007    0.0004     0.0002    0.0023
60-<70 Female 
       0         0        0              0.0000         .          .         .
      80      3476        3              0.0009    0.0005     0.0003    0.0027
60-<70 Male 
       0         0        0              0.0000         .          .         .
      80      3292        1              0.0003    0.0003     0.0000    0.0022
70-<80 Female 
       0         0        0              0.0000         .          .         .
      80      2814        1              0.0004    0.0004     0.0001    0.0025
70-<80 Male 
       0         0        0              0.0000         .          .         .
      80      2591        1              0.0004    0.0004     0.0001    0.0027
80+ Female 
       0         0        0              0.0000         .          .         .
      80      1582        1              0.0006    0.0006     0.0001    0.0045
80+ Male 
       0         0        0              0.0000         .          .         .
      80      1552        0              0.0000         .          .         .
-------------------------------------------------------------------------------
Note: Failure function is calculated over full data and evaluated at indicated
      times; it is not calculated from aggregates shown at left.

         failure _d:  confirmed
   analysis time _t:  (stime_confirmed-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

              Beg.                      Failure       Std.
    Time     Total     Fail             Function     Error     [95% Conf. Int.]
-------------------------------------------------------------------------------
18-<30 Female 
       0         0        0              0.0000         .          .         .
      80      4992        5              0.0010    0.0004     0.0004    0.0024
18-<30 Male 
       0         0        0              0.0000         .          .         .
      80      4818        4              0.0008    0.0004     0.0003    0.0022
30-<40 Female 
       0         0        0              0.0000         .          .         .
      80      4407        4              0.0009    0.0005     0.0003    0.0024
30-<40 Male 
       0         0        0              0.0000         .          .         .
      80      4168        1              0.0002    0.0002     0.0000    0.0017
40-<50 Female 
       0         0        0              0.0000         .          .         .
      80      4169        4              0.0010    0.0005     0.0004    0.0026
40-<50 Male 
       0         0        0              0.0000         .          .         .
      80      4041        5              0.0012    0.0006     0.0005    0.0030
50-<60 Female 
       0         0        0              0.0000         .          .         .
      80      4400        2              0.0005    0.0003     0.0001    0.0018
50-<60 Male 
       0         0        0              0.0000         .          .         .
      80      4117        3              0.0007    0.0004     0.0002    0.0023
60-<70 Female 
       0         0        0              0.0000         .          .         .
      80      3474        3              0.0009    0.0005     0.0003    0.0027
60-<70 Male 
       0         0        0              0.0000         .          .         .
      80      3289        4              0.0012    0.0006     0.0005    0.0032
70-<80 Female 
       0         0        0              0.0000         .          .         .
      80      2813        2              0.0007    0.0005     0.0002    0.0028
70-<80 Male 
       0         0        0              0.0000         .          .         .
      80      2592        0              0.0000         .          .         .
80+ Female 
       0         0        0              0.0000         .          .         .
      80      1580        2              0.0013    0.0009     0.0003    0.0050
80+ Male 
       0         0        0              0.0000         .          .         .
      80      1551        1              0.0006    0.0006     0.0001    0.0046
-------------------------------------------------------------------------------
Note: Failure function is calculated over full data and evaluated at indicated
      times; it is not calculated from aggregates shown at left.

         failure _d:  tested
   analysis time _t:  (stime_tested-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

              Beg.                      Failure       Std.
    Time     Total     Fail             Function     Error     [95% Conf. Int.]
-------------------------------------------------------------------------------
18-<30 Female 
       0         0        0              0.0000         .          .         .
      80      4557      447              0.0894    0.0040     0.0818    0.0976
18-<30 Male 
       0         0        0              0.0000         .          .         .
      80      4363      465              0.0964    0.0042     0.0884    0.1051
30-<40 Female 
       0         0        0              0.0000         .          .         .
      80      3990      426              0.0966    0.0044     0.0882    0.1056
30-<40 Male 
       0         0        0              0.0000         .          .         .
      80      3770      407              0.0976    0.0046     0.0890    0.1071
40-<50 Female 
       0         0        0              0.0000         .          .         .
      80      3785      393              0.0942    0.0045     0.0857    0.1034
40-<50 Male 
       0         0        0              0.0000         .          .         .
      80      3648      396              0.0979    0.0047     0.0891    0.1074
50-<60 Female 
       0         0        0              0.0000         .          .         .
      80      3983      421              0.0956    0.0044     0.0873    0.1047
50-<60 Male 
       0         0        0              0.0000         .          .         .
      80      3688      441              0.1070    0.0048     0.0979    0.1168
60-<70 Female 
       0         0        0              0.0000         .          .         .
      80      3104      376              0.1081    0.0053     0.0982    0.1189
60-<70 Male 
       0         0        0              0.0000         .          .         .
      80      2958      338              0.1026    0.0053     0.0927    0.1134
70-<80 Female 
       0         0        0              0.0000         .          .         .
      80      2556      260              0.0924    0.0055     0.0823    0.1037
70-<80 Male 
       0         0        0              0.0000         .          .         .
      80      2331      265              0.1022    0.0059     0.0911    0.1145
80+ Female 
       0         0        0              0.0000         .          .         .
      80      1414      170              0.1075    0.0078     0.0932    0.1239
80+ Male 
       0         0        0              0.0000         .          .         .
      80      1402      150              0.0967    0.0075     0.0830    0.1125
-------------------------------------------------------------------------------
Note: Failure function is calculated over full data and evaluated at indicated
      times; it is not calculated from aggregates shown at left.

         failure _d:  positivetest
   analysis time _t:  (stime_positivetest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

              Beg.                      Failure       Std.
    Time     Total     Fail             Function     Error     [95% Conf. Int.]
-------------------------------------------------------------------------------
18-<30 Female 
       0         0        0              0.0000         .          .         .
      80      4519      486              0.0972    0.0042     0.0893    0.1058
18-<30 Male 
       0         0        0              0.0000         .          .         .
      80      4379      445              0.0923    0.0042     0.0844    0.1008
30-<40 Female 
       0         0        0              0.0000         .          .         .
      80      4018      399              0.0905    0.0043     0.0824    0.0993
30-<40 Male 
       0         0        0              0.0000         .          .         .
      80      3762      410              0.0984    0.0046     0.0897    0.1078
40-<50 Female 
       0         0        0              0.0000         .          .         .
      80      3769      412              0.0987    0.0046     0.0900    0.1082
40-<50 Male 
       0         0        0              0.0000         .          .         .
      80      3641      403              0.0996    0.0047     0.0908    0.1093
50-<60 Female 
       0         0        0              0.0000         .          .         .
      80      3975      433              0.0983    0.0045     0.0899    0.1075
50-<60 Male 
       0         0        0              0.0000         .          .         .
      80      3717      411              0.0997    0.0047     0.0910    0.1093
60-<70 Female 
       0         0        0              0.0000         .          .         .
      80      3152      331              0.0952    0.0050     0.0859    0.1054
60-<70 Male 
       0         0        0              0.0000         .          .         .
      80      2988      307              0.0932    0.0051     0.0837    0.1036
70-<80 Female 
       0         0        0              0.0000         .          .         .
      80      2519      297              0.1055    0.0058     0.0948    0.1175
70-<80 Male 
       0         0        0              0.0000         .          .         .
      80      2328      266              0.1026    0.0060     0.0915    0.1149
80+ Female 
       0         0        0              0.0000         .          .         .
      80      1454      131              0.0829    0.0069     0.0703    0.0976
80+ Male 
       0         0        0              0.0000         .          .         .
      80      1400      153              0.0986    0.0076     0.0848    0.1145
-------------------------------------------------------------------------------
Note: Failure function is calculated over full data and evaluated at indicated
      times; it is not calculated from aggregates shown at left.

         failure _d:  ae
   analysis time _t:  (stime_ae-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

              Beg.                      Failure       Std.
    Time     Total     Fail             Function     Error     [95% Conf. Int.]
-------------------------------------------------------------------------------
18-<30 Female 
       0         0        0              0.0000         .          .         .
      80      4994        6              0.0012    0.0005     0.0005    0.0027
18-<30 Male 
       0         0        0              0.0000         .          .         .
      80      4819        3              0.0006    0.0004     0.0002    0.0019
30-<40 Female 
       0         0        0              0.0000         .          .         .
      80      4408        2              0.0005    0.0003     0.0001    0.0018
30-<40 Male 
       0         0        0              0.0000         .          .         .
      80      4167        1              0.0002    0.0002     0.0000    0.0017
40-<50 Female 
       0         0        0              0.0000         .          .         .
      80      4169        3              0.0007    0.0004     0.0002    0.0022
40-<50 Male 
       0         0        0              0.0000         .          .         .
      80      4038        5              0.0012    0.0006     0.0005    0.0030
50-<60 Female 
       0         0        0              0.0000         .          .         .
      80      4400        3              0.0007    0.0004     0.0002    0.0021
50-<60 Male 
       0         0        0              0.0000         .          .         .
      80      4117        3              0.0007    0.0004     0.0002    0.0023
60-<70 Female 
       0         0        0              0.0000         .          .         .
      80      3473        6              0.0017    0.0007     0.0008    0.0038
60-<70 Male 
       0         0        0              0.0000         .          .         .
      80      3291        2              0.0006    0.0004     0.0002    0.0024
70-<80 Female 
       0         0        0              0.0000         .          .         .
      80      2813        1              0.0004    0.0004     0.0001    0.0025
70-<80 Male 
       0         0        0              0.0000         .          .         .
      80      2592        1              0.0004    0.0004     0.0001    0.0027
80+ Female 
       0         0        0              0.0000         .          .         .
      80      1582        0              0.0000         .          .         .
80+ Male 
       0         0        0              0.0000         .          .         .
      80      1552        1              0.0006    0.0006     0.0001    0.0046
-------------------------------------------------------------------------------
Note: Failure function is calculated over full data and evaluated at indicated
      times; it is not calculated from aggregates shown at left.

         failure _d:  icu
   analysis time _t:  (stime_icu-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

              Beg.                      Failure       Std.
    Time     Total     Fail             Function     Error     [95% Conf. Int.]
-------------------------------------------------------------------------------
18-<30 Female 
       0         0        0              0.0000         .          .         .
      80      4993        3              0.0006    0.0003     0.0002    0.0019
18-<30 Male 
       0         0        0              0.0000         .          .         .
      80      4816        5              0.0010    0.0005     0.0004    0.0025
30-<40 Female 
       0         0        0              0.0000         .          .         .
      80      4409        1              0.0002    0.0002     0.0000    0.0016
30-<40 Male 
       0         0        0              0.0000         .          .         .
      80      4163        5              0.0012    0.0005     0.0005    0.0029
40-<50 Female 
       0         0        0              0.0000         .          .         .
      80      4168        5              0.0012    0.0005     0.0005    0.0029
40-<50 Male 
       0         0        0              0.0000         .          .         .
      80      4038        3              0.0007    0.0004     0.0002    0.0023
50-<60 Female 
       0         0        0              0.0000         .          .         .
      80      4397        5              0.0011    0.0005     0.0005    0.0027
50-<60 Male 
       0         0        0              0.0000         .          .         .
      80      4118        1              0.0002    0.0002     0.0000    0.0017
60-<70 Female 
       0         0        0              0.0000         .          .         .
      80      3473        3              0.0009    0.0005     0.0003    0.0027
60-<70 Male 
       0         0        0              0.0000         .          .         .
      80      3290        2              0.0006    0.0004     0.0002    0.0024
70-<80 Female 
       0         0        0              0.0000         .          .         .
      80      2813        1              0.0004    0.0004     0.0001    0.0025
70-<80 Male 
       0         0        0              0.0000         .          .         .
      80      2588        4              0.0015    0.0008     0.0006    0.0041
80+ Female 
       0         0        0              0.0000         .          .         .
      80      1582        0              0.0000         .          .         .
80+ Male 
       0         0        0              0.0000         .          .         .
      80      1550        2              0.0013    0.0009     0.0003    0.0051
-------------------------------------------------------------------------------
Note: Failure function is calculated over full data and evaluated at indicated
      times; it is not calculated from aggregates shown at left.

         failure _d:  cpnsdeath
   analysis time _t:  (stime_cpnsdeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

              Beg.                      Failure       Std.
    Time     Total     Fail             Function     Error     [95% Conf. Int.]
-------------------------------------------------------------------------------
18-<30 Female 
       0         0        0              0.0000         .          .         .
      80      5000        4              0.0008    0.0004     0.0003    0.0021
18-<30 Male 
       0         0        0              0.0000         .          .         .
      80      4820        5              0.0010    0.0005     0.0004    0.0025
30-<40 Female 
       0         0        0              0.0000         .          .         .
      80      4407        8              0.0018    0.0006     0.0009    0.0036
30-<40 Male 
       0         0        0              0.0000         .          .         .
      80      4170        2              0.0005    0.0003     0.0001    0.0019
40-<50 Female 
       0         0        0              0.0000         .          .         .
      80      4176        1              0.0002    0.0002     0.0000    0.0017
40-<50 Male 
       0         0        0              0.0000         .          .         .
      80      4044        6              0.0015    0.0006     0.0007    0.0033
50-<60 Female 
       0         0        0              0.0000         .          .         .
      80      4399        7              0.0016    0.0006     0.0008    0.0033
50-<60 Male 
       0         0        0              0.0000         .          .         .
      80      4116        9              0.0022    0.0007     0.0011    0.0042
60-<70 Female 
       0         0        0              0.0000         .          .         .
      80      3477        3              0.0009    0.0005     0.0003    0.0027
60-<70 Male 
       0         0        0              0.0000         .          .         .
      80      3297        1              0.0003    0.0003     0.0000    0.0022
70-<80 Female 
       0         0        0              0.0000         .          .         .
      80      2814        2              0.0007    0.0005     0.0002    0.0028
70-<80 Male 
       0         0        0              0.0000         .          .         .
      80      2589        6              0.0023    0.0009     0.0010    0.0051
80+ Female 
       0         0        0              0.0000         .          .         .
      80      1580        3              0.0019    0.0011     0.0006    0.0059
80+ Male 
       0         0        0              0.0000         .          .         .
      80      1550        3              0.0019    0.0011     0.0006    0.0060
-------------------------------------------------------------------------------
Note: Failure function is calculated over full data and evaluated at indicated
      times; it is not calculated from aggregates shown at left.

         failure _d:  onsdeath
   analysis time _t:  (stime_onsdeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

              Beg.                      Failure       Std.
    Time     Total     Fail             Function     Error     [95% Conf. Int.]
-------------------------------------------------------------------------------
18-<30 Female 
       0         0        0              0.0000         .          .         .
      80      4996        8              0.0016    0.0006     0.0008    0.0032
18-<30 Male 
       0         0        0              0.0000         .          .         .
      80      4820        5              0.0010    0.0005     0.0004    0.0025
30-<40 Female 
       0         0        0              0.0000         .          .         .
      80      4410        5              0.0011    0.0005     0.0005    0.0027
30-<40 Male 
       0         0        0              0.0000         .          .         .
      80      4168        4              0.0010    0.0005     0.0004    0.0026
40-<50 Female 
       0         0        0              0.0000         .          .         .
      80      4172        5              0.0012    0.0005     0.0005    0.0029
40-<50 Male 
       0         0        0              0.0000         .          .         .
      80      4041        9              0.0022    0.0007     0.0012    0.0043
50-<60 Female 
       0         0        0              0.0000         .          .         .
      80      4401        5              0.0011    0.0005     0.0005    0.0027
50-<60 Male 
       0         0        0              0.0000         .          .         .
      80      4119        6              0.0015    0.0006     0.0007    0.0032
60-<70 Female 
       0         0        0              0.0000         .          .         .
      80      3477        4              0.0011    0.0006     0.0004    0.0031
60-<70 Male 
       0         0        0              0.0000         .          .         .
      80      3292        6              0.0018    0.0007     0.0008    0.0040
70-<80 Female 
       0         0        0              0.0000         .          .         .
      80      2814        2              0.0007    0.0005     0.0002    0.0028
70-<80 Male 
       0         0        0              0.0000         .          .         .
      80      2592        3              0.0012    0.0007     0.0004    0.0036
80+ Female 
       0         0        0              0.0000         .          .         .
      80      1582        1              0.0006    0.0006     0.0001    0.0045
80+ Male 
       0         0        0              0.0000         .          .         .
      80      1552        1              0.0006    0.0006     0.0001    0.0046
-------------------------------------------------------------------------------
Note: Failure function is calculated over full data and evaluated at indicated
      times; it is not calculated from aggregates shown at left.

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

              Beg.                      Failure       Std.
    Time     Total     Fail             Function     Error     [95% Conf. Int.]
-------------------------------------------------------------------------------
18-<30 Female 
       0         0        0              0.0000         .          .         .
      80      5002        2              0.0004    0.0003     0.0001    0.0016
18-<30 Male 
       0         0        0              0.0000         .          .         .
      80      4823        2              0.0004    0.0003     0.0001    0.0017
30-<40 Female 
       0         0        0              0.0000         .          .         .
      80         0        0              0.0000         .          .         .
30-<40 Male 
       0         0        0              0.0000         .          .         .
      80         0        0              0.0000         .          .         .
40-<50 Female 
       0         0        0              0.0000         .          .         .
      80      4176        1              0.0002    0.0002     0.0000    0.0017
40-<50 Male 
       0         0        0              0.0000         .          .         .
      80      4047        3              0.0007    0.0004     0.0002    0.0023
50-<60 Female 
       0         0        0              0.0000         .          .         .
      80      4404        2              0.0005    0.0003     0.0001    0.0018
50-<60 Male 
       0         0        0              0.0000         .          .         .
      80         0        0              0.0000         .          .         .
60-<70 Female 
       0         0        0              0.0000         .          .         .
      80      3479        1              0.0003    0.0003     0.0000    0.0020
60-<70 Male 
       0         0        0              0.0000         .          .         .
      80      3296        2              0.0006    0.0004     0.0002    0.0024
70-<80 Female 
       0         0        0              0.0000         .          .         .
      80      2815        1              0.0004    0.0004     0.0001    0.0025
70-<80 Male 
       0         0        0              0.0000         .          .         .
      80      2593        2              0.0008    0.0005     0.0002    0.0031
80+ Female 
       0         0        0              0.0000         .          .         .
      80         0        0              0.0000         .          .         .
80+ Male 
       0         0        0              0.0000         .          .         .
      80         0        0              0.0000         .          .         .
-------------------------------------------------------------------------------
Note: Failure function is calculated over full data and evaluated at indicated
      times; it is not calculated from aggregates shown at left.

         failure _d:  ons_noncoviddeath
   analysis time _t:  (stime_ons_noncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

              Beg.                      Failure       Std.
    Time     Total     Fail             Function     Error     [95% Conf. Int.]
-------------------------------------------------------------------------------
18-<30 Female 
       0         0        0              0.0000         .          .         .
      80      4998        6              0.0012    0.0005     0.0005    0.0027
18-<30 Male 
       0         0        0              0.0000         .          .         .
      80      4822        3              0.0006    0.0004     0.0002    0.0019
30-<40 Female 
       0         0        0              0.0000         .          .         .
      80      4410        5              0.0011    0.0005     0.0005    0.0027
30-<40 Male 
       0         0        0              0.0000         .          .         .
      80      4168        4              0.0010    0.0005     0.0004    0.0026
40-<50 Female 
       0         0        0              0.0000         .          .         .
      80      4173        4              0.0010    0.0005     0.0004    0.0026
40-<50 Male 
       0         0        0              0.0000         .          .         .
      80      4044        6              0.0015    0.0006     0.0007    0.0033
50-<60 Female 
       0         0        0              0.0000         .          .         .
      80      4403        3              0.0007    0.0004     0.0002    0.0021
50-<60 Male 
       0         0        0              0.0000         .          .         .
      80      4119        6              0.0015    0.0006     0.0007    0.0032
60-<70 Female 
       0         0        0              0.0000         .          .         .
      80      3477        3              0.0009    0.0005     0.0003    0.0027
60-<70 Male 
       0         0        0              0.0000         .          .         .
      80      3294        4              0.0012    0.0006     0.0005    0.0032
70-<80 Female 
       0         0        0              0.0000         .          .         .
      80      2815        1              0.0004    0.0004     0.0001    0.0025
70-<80 Male 
       0         0        0              0.0000         .          .         .
      80      2594        1              0.0004    0.0004     0.0001    0.0027
80+ Female 
       0         0        0              0.0000         .          .         .
      80      1582        1              0.0006    0.0006     0.0001    0.0045
80+ Male 
       0         0        0              0.0000         .          .         .
      80      1552        1              0.0006    0.0006     0.0001    0.0046
-------------------------------------------------------------------------------
Note: Failure function is calculated over full data and evaluated at indicated
      times; it is not calculated from aggregates shown at left.

. 
. * Close the log file
. log close
      name:  <unnamed>
       log:  /Users/lsh152058/Documents/GitHub/ethnicity-covid-research/output/log/03_eth_an_descriptive_
> tables.log
  log type:  text
 closed on:  13 Jul 2020, 21:12:33
---------------------------------------------------------------------------------------------------------
