-----------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/lsh152058/Documents/GitHub/ethnicity-covid-re
> search/output/log/03_eth_an_descriptive_tables.log
  log type:  text
 opened on:  12 Jul 2020, 23:04:49

. 
. * Open Stata dataset
. use $tempdir/analysis_dataset, clear

. 
. 
. **********************************
. *  Distribution in whole cohort  *
. **********************************
. 
. 
. * Demographics
. summ age

    Variable |        Obs        Mean    Std. Dev.       Min     
>    Max
-------------+---------------------------------------------------
> ------
         age |     50,444    48.92401    18.99561         18     
>    105

. tab agegroup

Grouped age |      Freq.     Percent        Cum.
------------+-----------------------------------
     18-<30 |      9,852       19.53       19.53
     30-<40 |      8,434       16.72       36.25
     40-<50 |      8,081       16.02       52.27
     50-<60 |      8,708       17.26       69.53
     60-<70 |      6,929       13.74       83.27
     70-<80 |      5,254       10.42       93.68
        80+ |      3,186        6.32      100.00
------------+-----------------------------------
      Total |     50,444      100.00

. tab male

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     25,969       51.48       51.48
          1 |     24,475       48.52      100.00
------------+-----------------------------------
      Total |     50,444      100.00

. tab bmicat

                 BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |        308        3.57        3.57
  Normal (18.5-24.9) |      1,009       11.70       15.27
Overweight (25-29.9) |      1,422       16.49       31.76
   Obese I (30-34.9) |      1,861       21.58       53.33
  Obese II (35-39.9) |      1,805       20.93       74.26
     Obese III (40+) |      2,220       25.74      100.00
---------------------+-----------------------------------
               Total |      8,625      100.00

. tab bmicat, m

                 BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
 Underweight (<18.5) |        308        0.61        0.61
  Normal (18.5-24.9) |      1,009        2.00        2.61
Overweight (25-29.9) |      1,422        2.82        5.43
   Obese I (30-34.9) |      1,861        3.69        9.12
  Obese II (35-39.9) |      1,805        3.58       12.70
     Obese III (40+) |      2,220        4.40       17.10
        Unknown (.u) |     41,819       82.90      100.00
---------------------+-----------------------------------
               Total |     50,444      100.00

. tab bmicat_sa

BMI with SA |
 categories |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        308        3.57        3.57
          2 |        978       11.34       14.91
          3 |      1,401       16.24       31.15
          4 |      1,913       22.18       53.33
          5 |      1,805       20.93       74.26
          6 |      2,220       25.74      100.00
------------+-----------------------------------
      Total |      8,625      100.00

. tab bmicat_sa, m

BMI with SA |
 categories |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        308        0.61        0.61
          2 |        978        1.94        2.55
          3 |      1,401        2.78        5.33
          4 |      1,913        3.79        9.12
          5 |      1,805        3.58       12.70
          6 |      2,220        4.40       17.10
         .u |     41,819       82.90      100.00
------------+-----------------------------------
      Total |     50,444      100.00

. tab obese4cat

          Obesity (4 |
         categories) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
No record of obesity |     44,558       88.33       88.33
   Obese I (30-34.9) |      1,861        3.69       92.02
  Obese II (35-39.9) |      1,805        3.58       95.60
     Obese III (40+) |      2,220        4.40      100.00
---------------------+-----------------------------------
               Total |     50,444      100.00

. tab obese4cat, m

          Obesity (4 |
         categories) |      Freq.     Percent        Cum.
---------------------+-----------------------------------
No record of obesity |     44,558       88.33       88.33
   Obese I (30-34.9) |      1,861        3.69       92.02
  Obese II (35-39.9) |      1,805        3.58       95.60
     Obese III (40+) |      2,220        4.40      100.00
---------------------+-----------------------------------
               Total |     50,444      100.00

. tab obese4cat_sa, m

   Obesity with SA categories |      Freq.     Percent        Cum
> .
------------------------------+----------------------------------
> -
         No record of obesity |     44,506       88.23       88.2
> 3
Obese I (30-34.9 / 27.5-34.9) |      1,913        3.79       92.0
> 2
           Obese II (35-39.9) |      1,805        3.58       95.6
> 0
              Obese III (40+) |      2,220        4.40      100.0
> 0
------------------------------+----------------------------------
> -
                        Total |     50,444      100.00

. tab smoke

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |      2,030       22.51       22.51
      Former |        992       11.00       33.51
     Current |      5,995       66.49      100.00
-------------+-----------------------------------
       Total |      9,017      100.00

. tab smoke, m

     Smoking |
      status |      Freq.     Percent        Cum.
-------------+-----------------------------------
       Never |      2,030        4.02        4.02
      Former |        992        1.97        5.99
     Current |      5,995       11.88       17.88
Unknown (.u) |     41,427       82.12      100.00
-------------+-----------------------------------
       Total |     50,444      100.00

. tab bpcat

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |          2        0.00        0.00
 High, stage I |         67        0.15        0.15
High, stage II |     45,473       99.85      100.00
---------------+-----------------------------------
         Total |     45,542      100.00

. tab bpcat, m

Blood pressure |
  four levels, |
   non-missing |      Freq.     Percent        Cum.
---------------+-----------------------------------
        Normal |          2        0.00        0.00
 High, stage I |         67        0.13        0.14
High, stage II |     45,473       90.15       90.28
       Unknown |      4,902        9.72      100.00
---------------+-----------------------------------
         Total |     50,444      100.00

. tab htdiag_or_highbp

 High blood |
pressure or |
hypertensio |
n diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      4,003        7.94        7.94
          1 |     46,441       92.06      100.00
------------+-----------------------------------
      Total |     50,444      100.00

. 
. 
. * Comorbidities
. tab chronic_respiratory_disease

    Chronic |
Respiratory |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     40,346       79.98       79.98
          1 |     10,098       20.02      100.00
------------+-----------------------------------
      Total |     50,444      100.00

. tab asthma

     Asthma |
   category |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     40,355       80.00       80.00
          1 |     10,089       20.00      100.00
------------+-----------------------------------
      Total |     50,444      100.00

. tab chronic_cardiac_disease

    Chronic |
    Cardiac |
   Diseases |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     40,413       80.11       80.11
          1 |     10,031       19.89      100.00
------------+-----------------------------------
      Total |     50,444      100.00

. tab cancer

     Cancer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     40,307       79.90       79.90
          1 |     10,137       20.10      100.00
------------+-----------------------------------
      Total |     50,444      100.00

. tab chronic_liver_disease

    Chronic |
      liver |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     40,390       80.07       80.07
          1 |     10,054       19.93      100.00
------------+-----------------------------------
      Total |     50,444      100.00

. tab diabetes_type

Diabetes by |
       type |      Freq.     Percent        Cum.
------------+-----------------------------------
      NO_DM |     37,887       75.11       75.11
       T1DM |      1,496        2.97       78.07
       T2DM |     10,017       19.86       97.93
 UNKNOWN_DM |      1,044        2.07      100.00
------------+-----------------------------------
      Total |     50,444      100.00

. tab perm_immunodef

  Permanent |
immunosuppr |
     ession |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     40,452       80.19       80.19
          1 |      9,992       19.81      100.00
------------+-----------------------------------
      Total |     50,444      100.00

. tab temp_immunodef

  Temporary |
immunosuppr |
     ession |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     40,294       79.88       79.88
          1 |     10,150       20.12      100.00
------------+-----------------------------------
      Total |     50,444      100.00

. tab other_neuro

Neurologica |
  l disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     40,435       80.16       80.16
          1 |     10,009       19.84      100.00
------------+-----------------------------------
      Total |     50,444      100.00

. tab dementia

   Dementia |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     40,438       80.16       80.16
          1 |     10,006       19.84      100.00
------------+-----------------------------------
      Total |     50,444      100.00

. tab stroke

     Stroke |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     40,360       80.01       80.01
          1 |     10,084       19.99      100.00
------------+-----------------------------------
      Total |     50,444      100.00

. tab esrf

  end stage |
      renal |
    failure |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     40,352       79.99       79.99
          1 |     10,092       20.01      100.00
------------+-----------------------------------
      Total |     50,444      100.00

. tab hypertension

  Diagnosed |
hypertensio |
          n |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     40,401       80.09       80.09
          1 |     10,043       19.91      100.00
------------+-----------------------------------
      Total |     50,444      100.00

. tab reduced_kidney_function_cat

     Reduced kidney function |      Freq.     Percent        Cum.
-----------------------------+-----------------------------------
                        None |     49,872       98.87       98.87
Stage 3a/3b egfr 30-60       |        572        1.13      100.00
-----------------------------+-----------------------------------
                       Total |     50,444      100.00

. tab ra_sle_psoriasis

 Autoimmune |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     40,370       80.03       80.03
          1 |     10,074       19.97      100.00
------------+-----------------------------------
      Total |     50,444      100.00

. tab gi_bleed_and_ulcer

   GI Bleed |
  and ulcer |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     40,434       80.16       80.16
          1 |     10,010       19.84      100.00
------------+-----------------------------------
      Total |     50,444      100.00

. tab inflammatory_bowel_disease

inflammator |
    y bowel |
    disease |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     40,217       79.73       79.73
          1 |     10,227       20.27      100.00
------------+-----------------------------------
      Total |     50,444      100.00

. 
. tab imd 

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |     35,297       69.97       69.97
               4 |     10,082       19.99       89.96
 5 most deprived |      5,065       10.04      100.00
-----------------+-----------------------------------
           Total |     50,444      100.00

. tab imd, m

        Index of |
        Multiple |
     Deprivation |
           (IMD) |      Freq.     Percent        Cum.
-----------------+-----------------------------------
1 least deprived |     35,297       69.97       69.97
               4 |     10,082       19.99       89.96
 5 most deprived |      5,065       10.04      100.00
-----------------+-----------------------------------
           Total |     50,444      100.00

. tab ethnicity

      Eth 5 categories |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |     30,173       79.81       79.81
Asian or Asian British |      3,879       10.26       90.07
                 Other |      3,755        9.93      100.00
-----------------------+-----------------------------------
                 Total |     37,807      100.00

. tab ethnicity, m

      Eth 5 categories |      Freq.     Percent        Cum.
-----------------------+-----------------------------------
                 White |     30,173       59.81       59.81
Asian or Asian British |      3,879        7.69       67.50
                 Other |      3,755        7.44       74.95
                     . |     12,637       25.05      100.00
-----------------------+-----------------------------------
                 Total |     50,444      100.00

. 
. tab stp

Sustainabil |
    ity and |
Transformat |
        ion |
Partnership |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      5,049       10.01       10.01
          2 |      5,036        9.98       19.99
          3 |      4,958        9.83       29.82
          4 |      4,920        9.75       39.57
          5 |      5,030        9.97       49.55
          6 |      5,036        9.98       59.53
          7 |      5,219       10.35       69.88
          8 |      5,080       10.07       79.95
          9 |      5,006        9.92       89.87
         10 |      5,110       10.13      100.00
------------+-----------------------------------
      Total |     50,444      100.00

. tab region

       Region of England |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
           East Midlands |      5,052       10.02       10.02
         East of England |      4,983        9.88       19.89
                  London |     10,086       19.99       39.89
              North East |      5,016        9.94       49.83
              North West |      5,076       10.06       59.89
              South East |     10,154       20.13       80.02
           West Midlands |      5,004        9.92       89.94
Yorkshire and the Humber |      5,073       10.06      100.00
-------------------------+-----------------------------------
                   Total |     50,444      100.00

. tab rural_urban

Rural-Urban |
  Indicator |      Freq.     Percent        Cum.
------------+-----------------------------------
      rural |      5,088       10.09       10.09
      urban |     45,356       89.91      100.00
------------+-----------------------------------
      Total |     50,444      100.00

. 
. 
. * Outcomes
. tab suspected

    outcome |
  suspected |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     40,411       80.11       80.11
          1 |     10,033       19.89      100.00
------------+-----------------------------------
      Total |     50,444      100.00

. tab confirmed

    outcome |
  confirmed |
       case |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     40,301       79.89       79.89
          1 |     10,143       20.11      100.00
------------+-----------------------------------
      Total |     50,444      100.00

. tab tested

    outcome |
  SGSS test |
  performed |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     40,281       79.85       79.85
          1 |     10,163       20.15      100.00
------------+-----------------------------------
      Total |     50,444      100.00

. tab positivetest

    outcome |
  SGSS test |
   positive |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     40,487       80.26       80.26
          1 |      9,957       19.74      100.00
------------+-----------------------------------
      Total |     50,444      100.00

. 
. tab ae

outcome A&E |
 Attendance |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     40,399       80.09       80.09
          1 |     10,045       19.91      100.00
------------+-----------------------------------
      Total |     50,444      100.00

. tab icu

outcome ICU |
  Admission |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     50,350       99.81       99.81
          1 |         94        0.19      100.00
------------+-----------------------------------
      Total |     50,444      100.00

. 
. tab onsdeath

outcome ONS |
  death any |
      cause |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     50,331       99.78       99.78
          1 |        113        0.22      100.00
------------+-----------------------------------
      Total |     50,444      100.00

. tab onscoviddeath

outcome ONS |
COVID death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     50,424       99.96       99.96
          1 |         20        0.04      100.00
------------+-----------------------------------
      Total |     50,444      100.00

. tab ons_noncoviddeath

outcome ONS |
  non-COVID |
      death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     50,351       99.82       99.82
          1 |         93        0.18      100.00
------------+-----------------------------------
      Total |     50,444      100.00

. tab cpnsdeath

    outcome |
 CPNS death |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     50,372       99.86       99.86
          1 |         72        0.14      100.00
------------+-----------------------------------
      Total |     50,444      100.00

. 
. 
. **********************************
. *  Number (%) with each outcome  *
. **********************************
. 
. foreach outvar of varlist       onsdeath ///
>                                                         onscovi
> ddeath ///
>                                                         ons_non
> coviddeath ///
>                                                         cpnsdea
> th ///
>                                                         ae  ///
>                                                         icu ///
>                                                         suspect
> ed ///
>                                                         confirm
> ed ///
>                                                         tested 
> ///
>                                                         positiv
> etest ///
>                                                         {
  2.         * Demographics
.         tab agegroup                                           
>          `outvar', col
  3.         tab male                                            
>                     `outvar', col
  4.         tab ethnicity                                       
>             `outvar', col m
  5.         tab ethnicity_16                                    
>             `outvar', col m
  6.         tab bmicat                                          
>                     `outvar', col m 
  7.         tab obese4cat                                       
>             `outvar', col m 
  8.         tab bmicat_sa                                       
>             `outvar', col m 
  9.         tab obese4cat_sa                                    
>             `outvar', col m 
 10.         tab smoke                                           
>                     `outvar', col m
 11. 
.         * Comorbidities
.         tab chronic_respiratory_disease                 `outvar
> ', col
 12.         tab asthma                                          
>                     `outvar', col
 13.         tab asthmacat                                       
>             `outvar', col
 14.         tab chronic_cardiac_disease                     `out
> var', col
 15.         tab diabetes_type                                   
>             `outvar', col
 16.         tab diabetes_exeter_os                              
>     `outvar', col
 17.         tab cancer                                          
>                     `outvar', col
 18.         tab chronic_liver_disease                           
>     `outvar', col
 19.         tab stroke                                          
>                     `outvar', col
 20.         tab dementia                                        
>             `outvar', col
 21.         tab other_neuro                                     
>             `outvar', col
 22.         tab reduced_kidney_function_cat                 `out
> var', col
 23.         tab ra_sle_psoriasis                                
>     `outvar', col
 24.         
.         tab imd                                                
>                  `outvar', col m
 25.         tab rural_urban                                     
>             `outvar', col
 26.         tab region                                          
>                     `outvar', col
 27. }

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           | outcome ONS death any
   Grouped |         cause
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     9,827         25 |     9,852 
           |     19.52      22.12 |     19.53 
-----------+----------------------+----------
    30-<40 |     8,411         23 |     8,434 
           |     16.71      20.35 |     16.72 
-----------+----------------------+----------
    40-<50 |     8,061         20 |     8,081 
           |     16.02      17.70 |     16.02 
-----------+----------------------+----------
    50-<60 |     8,694         14 |     8,708 
           |     17.27      12.39 |     17.26 
-----------+----------------------+----------
    60-<70 |     6,914         15 |     6,929 
           |     13.74      13.27 |     13.74 
-----------+----------------------+----------
    70-<80 |     5,245          9 |     5,254 
           |     10.42       7.96 |     10.42 
-----------+----------------------+----------
       80+ |     3,179          7 |     3,186 
           |      6.32       6.19 |      6.32 
-----------+----------------------+----------
     Total |    50,331        113 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           | outcome ONS death any
           |         cause
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    25,907         62 |    25,969 
           |     51.47      54.87 |     51.48 
-----------+----------------------+----------
         1 |    24,424         51 |    24,475 
           |     48.53      45.13 |     48.52 
-----------+----------------------+----------
     Total |    50,331        113 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      | outcome ONS death any
                      |         cause
     Eth 5 categories |         0          1 |     Total
----------------------+----------------------+----------
                White |    30,096         77 |    30,173 
                      |     59.80      68.14 |     59.81 
----------------------+----------------------+----------
Asian or Asian Britis |     3,868         11 |     3,879 
                      |      7.69       9.73 |      7.69 
----------------------+----------------------+----------
                Other |     3,750          5 |     3,755 
                      |      7.45       4.42 |      7.44 
----------------------+----------------------+----------
                    . |    12,617         20 |    12,637 
                      |     25.07      17.70 |     25.05 
----------------------+----------------------+----------
                Total |    50,331        113 |    50,444 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      | outcome ONS death any
                      |         cause
    Eth 16 categories |         0          1 |     Total
----------------------+----------------------+----------
British or Mixed Brit |    14,171         40 |    14,211 
                      |     28.16      35.40 |     28.17 
----------------------+----------------------+----------
                Irish |     2,891          4 |     2,895 
                      |      5.74       3.54 |      5.74 
----------------------+----------------------+----------
          Other White |     1,388          2 |     1,390 
                      |      2.76       1.77 |      2.76 
----------------------+----------------------+----------
White + Black Caribbe |     1,393          3 |     1,396 
                      |      2.77       2.65 |      2.77 
----------------------+----------------------+----------
White + Black African |     1,361          4 |     1,365 
                      |      2.70       3.54 |      2.71 
----------------------+----------------------+----------
        White + Asian |     1,489          3 |     1,492 
                      |      2.96       2.65 |      2.96 
----------------------+----------------------+----------
          Other mixed |     1,410          3 |     1,413 
                      |      2.80       2.65 |      2.80 
----------------------+----------------------+----------
Indian or British Ind |     1,366          5 |     1,371 
                      |      2.71       4.42 |      2.72 
----------------------+----------------------+----------
Pakistani or British  |       556          0 |       556 
                      |      1.10       0.00 |      1.10 
----------------------+----------------------+----------
Bangladeshi or Britis |       555          2 |       557 
                      |      1.10       1.77 |      1.10 
----------------------+----------------------+----------
          Other Asian |       291          0 |       291 
                      |      0.58       0.00 |      0.58 
----------------------+----------------------+----------
            Caribbean |       282          1 |       283 
                      |      0.56       0.88 |      0.56 
----------------------+----------------------+----------
              African |       263          0 |       263 
                      |      0.52       0.00 |      0.52 
----------------------+----------------------+----------
          Other Black |       282          0 |       282 
                      |      0.56       0.00 |      0.56 
----------------------+----------------------+----------
              Chinese |       283          0 |       283 
                      |      0.56       0.00 |      0.56 
----------------------+----------------------+----------
                Other |       298          1 |       299 
                      |      0.59       0.88 |      0.59 
----------------------+----------------------+----------
                    . |    22,052         45 |    22,097 
                      |     43.81      39.82 |     43.81 
----------------------+----------------------+----------
                Total |    50,331        113 |    50,444 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     | outcome ONS death any
                     |         cause
                 BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |       307          1 |       308 
                     |      0.61       0.88 |      0.61 
---------------------+----------------------+----------
  Normal (18.5-24.9) |     1,006          3 |     1,009 
                     |      2.00       2.65 |      2.00 
---------------------+----------------------+----------
Overweight (25-29.9) |     1,422          0 |     1,422 
                     |      2.83       0.00 |      2.82 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,855          6 |     1,861 
                     |      3.69       5.31 |      3.69 
---------------------+----------------------+----------
  Obese II (35-39.9) |     1,798          7 |     1,805 
                     |      3.57       6.19 |      3.58 
---------------------+----------------------+----------
     Obese III (40+) |     2,217          3 |     2,220 
                     |      4.40       2.65 |      4.40 
---------------------+----------------------+----------
        Unknown (.u) |    41,726         93 |    41,819 
                     |     82.90      82.30 |     82.90 
---------------------+----------------------+----------
               Total |    50,331        113 |    50,444 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     | outcome ONS death any
          Obesity (4 |         cause
         categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |    44,461         97 |    44,558 
                     |     88.34      85.84 |     88.33 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,855          6 |     1,861 
                     |      3.69       5.31 |      3.69 
---------------------+----------------------+----------
  Obese II (35-39.9) |     1,798          7 |     1,805 
                     |      3.57       6.19 |      3.58 
---------------------+----------------------+----------
     Obese III (40+) |     2,217          3 |     2,220 
                     |      4.40       2.65 |      4.40 
---------------------+----------------------+----------
               Total |    50,331        113 |    50,444 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  BMI with | outcome ONS death any
        SA |         cause
categories |         0          1 |     Total
-----------+----------------------+----------
         1 |       307          1 |       308 
           |      0.61       0.88 |      0.61 
-----------+----------------------+----------
         2 |       975          3 |       978 
           |      1.94       2.65 |      1.94 
-----------+----------------------+----------
         3 |     1,401          0 |     1,401 
           |      2.78       0.00 |      2.78 
-----------+----------------------+----------
         4 |     1,907          6 |     1,913 
           |      3.79       5.31 |      3.79 
-----------+----------------------+----------
         5 |     1,798          7 |     1,805 
           |      3.57       6.19 |      3.58 
-----------+----------------------+----------
         6 |     2,217          3 |     2,220 
           |      4.40       2.65 |      4.40 
-----------+----------------------+----------
        .u |    41,726         93 |    41,819 
           |     82.90      82.30 |     82.90 
-----------+----------------------+----------
     Total |    50,331        113 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      | outcome ONS death any
      Obesity with SA |         cause
           categories |         0          1 |     Total
----------------------+----------------------+----------
 No record of obesity |    44,409         97 |    44,506 
                      |     88.23      85.84 |     88.23 
----------------------+----------------------+----------
Obese I (30-34.9 / 27 |     1,907          6 |     1,913 
                      |      3.79       5.31 |      3.79 
----------------------+----------------------+----------
   Obese II (35-39.9) |     1,798          7 |     1,805 
                      |      3.57       6.19 |      3.58 
----------------------+----------------------+----------
      Obese III (40+) |     2,217          3 |     2,220 
                      |      4.40       2.65 |      4.40 
----------------------+----------------------+----------
                Total |    50,331        113 |    50,444 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             | outcome ONS death any
     Smoking |         cause
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |     2,026          4 |     2,030 
             |      4.03       3.54 |      4.02 
-------------+----------------------+----------
      Former |       989          3 |       992 
             |      1.96       2.65 |      1.97 
-------------+----------------------+----------
     Current |     5,985         10 |     5,995 
             |     11.89       8.85 |     11.88 
-------------+----------------------+----------
Unknown (.u) |    41,331         96 |    41,427 
             |     82.12      84.96 |     82.12 
-------------+----------------------+----------
       Total |    50,331        113 |    50,444 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic | outcome ONS death any
Respirator |         cause
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,255         91 |    40,346 
           |     79.98      80.53 |     79.98 
-----------+----------------------+----------
         1 |    10,076         22 |    10,098 
           |     20.02      19.47 |     20.02 
-----------+----------------------+----------
     Total |    50,331        113 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           | outcome ONS death any
    Asthma |         cause
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,267         88 |    40,355 
           |     80.00      77.88 |     80.00 
-----------+----------------------+----------
         1 |    10,064         25 |    10,089 
           |     20.00      22.12 |     20.00 
-----------+----------------------+----------
     Total |    50,331        113 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

      Asthma | outcome ONS death any
    detailed |         cause
  categories |         0          1 |     Total
-------------+----------------------+----------
          No |    40,267         88 |    40,355 
             |     80.00      77.88 |     80.00 
-------------+----------------------+----------
 Yes, no OCS |    10,064         25 |    10,089 
             |     20.00      22.12 |     20.00 
-------------+----------------------+----------
       Total |    50,331        113 |    50,444 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic | outcome ONS death any
   Cardiac |         cause
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,329         84 |    40,413 
           |     80.13      74.34 |     80.11 
-----------+----------------------+----------
         1 |    10,002         29 |    10,031 
           |     19.87      25.66 |     19.89 
-----------+----------------------+----------
     Total |    50,331        113 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           | outcome ONS death any
  Diabetes |         cause
   by type |         0          1 |     Total
-----------+----------------------+----------
     NO_DM |    37,815         72 |    37,887 
           |     75.13      63.72 |     75.11 
-----------+----------------------+----------
      T1DM |     1,490          6 |     1,496 
           |      2.96       5.31 |      2.97 
-----------+----------------------+----------
      T2DM |     9,983         34 |    10,017 
           |     19.83      30.09 |     19.86 
-----------+----------------------+----------
UNKNOWN_DM |     1,043          1 |     1,044 
           |      2.07       0.88 |      2.07 
-----------+----------------------+----------
     Total |    50,331        113 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Diabetes | outcome ONS death any
    exeter |         cause
      type |         0          1 |     Total
-----------+----------------------+----------
     NO_DM |    38,717         92 |    38,809 
           |     76.92      81.42 |     76.93 
-----------+----------------------+----------
T1DM_EX_OS |     1,504          4 |     1,508 
           |      2.99       3.54 |      2.99 
-----------+----------------------+----------
T2DM_EX_OS |    10,110         17 |    10,127 
           |     20.09      15.04 |     20.08 
-----------+----------------------+----------
     Total |    50,331        113 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           | outcome ONS death any
           |         cause
    Cancer |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,211         96 |    40,307 
           |     79.89      84.96 |     79.90 
-----------+----------------------+----------
         1 |    10,120         17 |    10,137 
           |     20.11      15.04 |     20.10 
-----------+----------------------+----------
     Total |    50,331        113 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic | outcome ONS death any
     liver |         cause
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,304         86 |    40,390 
           |     80.08      76.11 |     80.07 
-----------+----------------------+----------
         1 |    10,027         27 |    10,054 
           |     19.92      23.89 |     19.93 
-----------+----------------------+----------
     Total |    50,331        113 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           | outcome ONS death any
           |         cause
    Stroke |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,268         92 |    40,360 
           |     80.01      81.42 |     80.01 
-----------+----------------------+----------
         1 |    10,063         21 |    10,084 
           |     19.99      18.58 |     19.99 
-----------+----------------------+----------
     Total |    50,331        113 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           | outcome ONS death any
           |         cause
  Dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,350         88 |    40,438 
           |     80.17      77.88 |     80.16 
-----------+----------------------+----------
         1 |     9,981         25 |    10,006 
           |     19.83      22.12 |     19.84 
-----------+----------------------+----------
     Total |    50,331        113 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           | outcome ONS death any
Neurologic |         cause
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,341         94 |    40,435 
           |     80.15      83.19 |     80.16 
-----------+----------------------+----------
         1 |     9,990         19 |    10,009 
           |     19.85      16.81 |     19.84 
-----------+----------------------+----------
     Total |    50,331        113 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      | outcome ONS death any
       Reduced kidney |         cause
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |    49,761        111 |    49,872 
                      |     98.87      98.23 |     98.87 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |       570          2 |       572 
                      |      1.13       1.77 |      1.13 
----------------------+----------------------+----------
                Total |    50,331        113 |    50,444 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           | outcome ONS death any
Autoimmune |         cause
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,281         89 |    40,370 
           |     80.03      78.76 |     80.03 
-----------+----------------------+----------
         1 |    10,050         24 |    10,074 
           |     19.97      21.24 |     19.97 
-----------+----------------------+----------
     Total |    50,331        113 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        Index of |
        Multiple | outcome ONS death any
     Deprivation |         cause
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |    35,219         78 |    35,297 
                 |     69.97      69.03 |     69.97 
-----------------+----------------------+----------
               4 |    10,057         25 |    10,082 
                 |     19.98      22.12 |     19.99 
-----------------+----------------------+----------
 5 most deprived |     5,055         10 |     5,065 
                 |     10.04       8.85 |     10.04 
-----------------+----------------------+----------
           Total |    50,331        113 |    50,444 
                 |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Rural-Urba | outcome ONS death any
         n |         cause
 Indicator |         0          1 |     Total
-----------+----------------------+----------
     rural |     5,077         11 |     5,088 
           |     10.09       9.73 |     10.09 
-----------+----------------------+----------
     urban |    45,254        102 |    45,356 
           |     89.91      90.27 |     89.91 
-----------+----------------------+----------
     Total |    50,331        113 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      | outcome ONS death any
                      |         cause
    Region of England |         0          1 |     Total
----------------------+----------------------+----------
        East Midlands |     5,046          6 |     5,052 
                      |     10.03       5.31 |     10.02 
----------------------+----------------------+----------
      East of England |     4,964         19 |     4,983 
                      |      9.86      16.81 |      9.88 
----------------------+----------------------+----------
               London |    10,070         16 |    10,086 
                      |     20.01      14.16 |     19.99 
----------------------+----------------------+----------
           North East |     5,007          9 |     5,016 
                      |      9.95       7.96 |      9.94 
----------------------+----------------------+----------
           North West |     5,057         19 |     5,076 
                      |     10.05      16.81 |     10.06 
----------------------+----------------------+----------
           South East |    10,134         20 |    10,154 
                      |     20.13      17.70 |     20.13 
----------------------+----------------------+----------
        West Midlands |     4,991         13 |     5,004 
                      |      9.92      11.50 |      9.92 
----------------------+----------------------+----------
Yorkshire and the H.. |     5,062         11 |     5,073 
                      |     10.06       9.73 |     10.06 
----------------------+----------------------+----------
                Total |    50,331        113 |    50,444 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome ONS COVID
   Grouped |         death
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     9,848          4 |     9,852 
           |     19.53      20.00 |     19.53 
-----------+----------------------+----------
    30-<40 |     8,430          4 |     8,434 
           |     16.72      20.00 |     16.72 
-----------+----------------------+----------
    40-<50 |     8,077          4 |     8,081 
           |     16.02      20.00 |     16.02 
-----------+----------------------+----------
    50-<60 |     8,705          3 |     8,708 
           |     17.26      15.00 |     17.26 
-----------+----------------------+----------
    60-<70 |     6,927          2 |     6,929 
           |     13.74      10.00 |     13.74 
-----------+----------------------+----------
    70-<80 |     5,251          3 |     5,254 
           |     10.41      15.00 |     10.42 
-----------+----------------------+----------
       80+ |     3,186          0 |     3,186 
           |      6.32       0.00 |      6.32 
-----------+----------------------+----------
     Total |    50,424         20 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome ONS COVID
           |         death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    25,954         15 |    25,969 
           |     51.47      75.00 |     51.48 
-----------+----------------------+----------
         1 |    24,470          5 |    24,475 
           |     48.53      25.00 |     48.52 
-----------+----------------------+----------
     Total |    50,424         20 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   outcome ONS COVID
                      |         death
     Eth 5 categories |         0          1 |     Total
----------------------+----------------------+----------
                White |    30,160         13 |    30,173 
                      |     59.81      65.00 |     59.81 
----------------------+----------------------+----------
Asian or Asian Britis |     3,877          2 |     3,879 
                      |      7.69      10.00 |      7.69 
----------------------+----------------------+----------
                Other |     3,754          1 |     3,755 
                      |      7.44       5.00 |      7.44 
----------------------+----------------------+----------
                    . |    12,633          4 |    12,637 
                      |     25.05      20.00 |     25.05 
----------------------+----------------------+----------
                Total |    50,424         20 |    50,444 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   outcome ONS COVID
                      |         death
    Eth 16 categories |         0          1 |     Total
----------------------+----------------------+----------
British or Mixed Brit |    14,203          8 |    14,211 
                      |     28.17      40.00 |     28.17 
----------------------+----------------------+----------
                Irish |     2,895          0 |     2,895 
                      |      5.74       0.00 |      5.74 
----------------------+----------------------+----------
          Other White |     1,390          0 |     1,390 
                      |      2.76       0.00 |      2.76 
----------------------+----------------------+----------
White + Black Caribbe |     1,396          0 |     1,396 
                      |      2.77       0.00 |      2.77 
----------------------+----------------------+----------
White + Black African |     1,363          2 |     1,365 
                      |      2.70      10.00 |      2.71 
----------------------+----------------------+----------
        White + Asian |     1,492          0 |     1,492 
                      |      2.96       0.00 |      2.96 
----------------------+----------------------+----------
          Other mixed |     1,412          1 |     1,413 
                      |      2.80       5.00 |      2.80 
----------------------+----------------------+----------
Indian or British Ind |     1,369          2 |     1,371 
                      |      2.71      10.00 |      2.72 
----------------------+----------------------+----------
Pakistani or British  |       556          0 |       556 
                      |      1.10       0.00 |      1.10 
----------------------+----------------------+----------
Bangladeshi or Britis |       557          0 |       557 
                      |      1.10       0.00 |      1.10 
----------------------+----------------------+----------
          Other Asian |       291          0 |       291 
                      |      0.58       0.00 |      0.58 
----------------------+----------------------+----------
            Caribbean |       283          0 |       283 
                      |      0.56       0.00 |      0.56 
----------------------+----------------------+----------
              African |       263          0 |       263 
                      |      0.52       0.00 |      0.52 
----------------------+----------------------+----------
          Other Black |       282          0 |       282 
                      |      0.56       0.00 |      0.56 
----------------------+----------------------+----------
              Chinese |       283          0 |       283 
                      |      0.56       0.00 |      0.56 
----------------------+----------------------+----------
                Other |       299          0 |       299 
                      |      0.59       0.00 |      0.59 
----------------------+----------------------+----------
                    . |    22,090          7 |    22,097 
                      |     43.81      35.00 |     43.81 
----------------------+----------------------+----------
                Total |    50,424         20 |    50,444 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   outcome ONS COVID
                     |         death
                 BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |       308          0 |       308 
                     |      0.61       0.00 |      0.61 
---------------------+----------------------+----------
  Normal (18.5-24.9) |     1,009          0 |     1,009 
                     |      2.00       0.00 |      2.00 
---------------------+----------------------+----------
Overweight (25-29.9) |     1,422          0 |     1,422 
                     |      2.82       0.00 |      2.82 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,861          0 |     1,861 
                     |      3.69       0.00 |      3.69 
---------------------+----------------------+----------
  Obese II (35-39.9) |     1,804          1 |     1,805 
                     |      3.58       5.00 |      3.58 
---------------------+----------------------+----------
     Obese III (40+) |     2,220          0 |     2,220 
                     |      4.40       0.00 |      4.40 
---------------------+----------------------+----------
        Unknown (.u) |    41,800         19 |    41,819 
                     |     82.90      95.00 |     82.90 
---------------------+----------------------+----------
               Total |    50,424         20 |    50,444 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   outcome ONS COVID
          Obesity (4 |         death
         categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |    44,539         19 |    44,558 
                     |     88.33      95.00 |     88.33 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,861          0 |     1,861 
                     |      3.69       0.00 |      3.69 
---------------------+----------------------+----------
  Obese II (35-39.9) |     1,804          1 |     1,805 
                     |      3.58       5.00 |      3.58 
---------------------+----------------------+----------
     Obese III (40+) |     2,220          0 |     2,220 
                     |      4.40       0.00 |      4.40 
---------------------+----------------------+----------
               Total |    50,424         20 |    50,444 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  BMI with |   outcome ONS COVID
        SA |         death
categories |         0          1 |     Total
-----------+----------------------+----------
         1 |       308          0 |       308 
           |      0.61       0.00 |      0.61 
-----------+----------------------+----------
         2 |       978          0 |       978 
           |      1.94       0.00 |      1.94 
-----------+----------------------+----------
         3 |     1,401          0 |     1,401 
           |      2.78       0.00 |      2.78 
-----------+----------------------+----------
         4 |     1,913          0 |     1,913 
           |      3.79       0.00 |      3.79 
-----------+----------------------+----------
         5 |     1,804          1 |     1,805 
           |      3.58       5.00 |      3.58 
-----------+----------------------+----------
         6 |     2,220          0 |     2,220 
           |      4.40       0.00 |      4.40 
-----------+----------------------+----------
        .u |    41,800         19 |    41,819 
           |     82.90      95.00 |     82.90 
-----------+----------------------+----------
     Total |    50,424         20 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   outcome ONS COVID
      Obesity with SA |         death
           categories |         0          1 |     Total
----------------------+----------------------+----------
 No record of obesity |    44,487         19 |    44,506 
                      |     88.23      95.00 |     88.23 
----------------------+----------------------+----------
Obese I (30-34.9 / 27 |     1,913          0 |     1,913 
                      |      3.79       0.00 |      3.79 
----------------------+----------------------+----------
   Obese II (35-39.9) |     1,804          1 |     1,805 
                      |      3.58       5.00 |      3.58 
----------------------+----------------------+----------
      Obese III (40+) |     2,220          0 |     2,220 
                      |      4.40       0.00 |      4.40 
----------------------+----------------------+----------
                Total |    50,424         20 |    50,444 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   outcome ONS COVID
     Smoking |         death
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |     2,030          0 |     2,030 
             |      4.03       0.00 |      4.02 
-------------+----------------------+----------
      Former |       992          0 |       992 
             |      1.97       0.00 |      1.97 
-------------+----------------------+----------
     Current |     5,994          1 |     5,995 
             |     11.89       5.00 |     11.88 
-------------+----------------------+----------
Unknown (.u) |    41,408         19 |    41,427 
             |     82.12      95.00 |     82.12 
-------------+----------------------+----------
       Total |    50,424         20 |    50,444 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |   outcome ONS COVID
Respirator |         death
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,332         14 |    40,346 
           |     79.99      70.00 |     79.98 
-----------+----------------------+----------
         1 |    10,092          6 |    10,098 
           |     20.01      30.00 |     20.02 
-----------+----------------------+----------
     Total |    50,424         20 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome ONS COVID
    Asthma |         death
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,342         13 |    40,355 
           |     80.01      65.00 |     80.00 
-----------+----------------------+----------
         1 |    10,082          7 |    10,089 
           |     19.99      35.00 |     20.00 
-----------+----------------------+----------
     Total |    50,424         20 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

      Asthma |   outcome ONS COVID
    detailed |         death
  categories |         0          1 |     Total
-------------+----------------------+----------
          No |    40,342         13 |    40,355 
             |     80.01      65.00 |     80.00 
-------------+----------------------+----------
 Yes, no OCS |    10,082          7 |    10,089 
             |     19.99      35.00 |     20.00 
-------------+----------------------+----------
       Total |    50,424         20 |    50,444 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |   outcome ONS COVID
   Cardiac |         death
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,399         14 |    40,413 
           |     80.12      70.00 |     80.11 
-----------+----------------------+----------
         1 |    10,025          6 |    10,031 
           |     19.88      30.00 |     19.89 
-----------+----------------------+----------
     Total |    50,424         20 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome ONS COVID
  Diabetes |         death
   by type |         0          1 |     Total
-----------+----------------------+----------
     NO_DM |    37,877         10 |    37,887 
           |     75.12      50.00 |     75.11 
-----------+----------------------+----------
      T1DM |     1,494          2 |     1,496 
           |      2.96      10.00 |      2.97 
-----------+----------------------+----------
      T2DM |    10,009          8 |    10,017 
           |     19.85      40.00 |     19.86 
-----------+----------------------+----------
UNKNOWN_DM |     1,044          0 |     1,044 
           |      2.07       0.00 |      2.07 
-----------+----------------------+----------
     Total |    50,424         20 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Diabetes |   outcome ONS COVID
    exeter |         death
      type |         0          1 |     Total
-----------+----------------------+----------
     NO_DM |    38,791         18 |    38,809 
           |     76.93      90.00 |     76.93 
-----------+----------------------+----------
T1DM_EX_OS |     1,508          0 |     1,508 
           |      2.99       0.00 |      2.99 
-----------+----------------------+----------
T2DM_EX_OS |    10,125          2 |    10,127 
           |     20.08      10.00 |     20.08 
-----------+----------------------+----------
     Total |    50,424         20 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome ONS COVID
           |         death
    Cancer |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,289         18 |    40,307 
           |     79.90      90.00 |     79.90 
-----------+----------------------+----------
         1 |    10,135          2 |    10,137 
           |     20.10      10.00 |     20.10 
-----------+----------------------+----------
     Total |    50,424         20 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |   outcome ONS COVID
     liver |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,374         16 |    40,390 
           |     80.07      80.00 |     80.07 
-----------+----------------------+----------
         1 |    10,050          4 |    10,054 
           |     19.93      20.00 |     19.93 
-----------+----------------------+----------
     Total |    50,424         20 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome ONS COVID
           |         death
    Stroke |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,347         13 |    40,360 
           |     80.02      65.00 |     80.01 
-----------+----------------------+----------
         1 |    10,077          7 |    10,084 
           |     19.98      35.00 |     19.99 
-----------+----------------------+----------
     Total |    50,424         20 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome ONS COVID
           |         death
  Dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,423         15 |    40,438 
           |     80.17      75.00 |     80.16 
-----------+----------------------+----------
         1 |    10,001          5 |    10,006 
           |     19.83      25.00 |     19.84 
-----------+----------------------+----------
     Total |    50,424         20 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome ONS COVID
Neurologic |         death
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,420         15 |    40,435 
           |     80.16      75.00 |     80.16 
-----------+----------------------+----------
         1 |    10,004          5 |    10,009 
           |     19.84      25.00 |     19.84 
-----------+----------------------+----------
     Total |    50,424         20 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   outcome ONS COVID
       Reduced kidney |         death
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |    49,853         19 |    49,872 
                      |     98.87      95.00 |     98.87 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |       571          1 |       572 
                      |      1.13       5.00 |      1.13 
----------------------+----------------------+----------
                Total |    50,424         20 |    50,444 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome ONS COVID
Autoimmune |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,355         15 |    40,370 
           |     80.03      75.00 |     80.03 
-----------+----------------------+----------
         1 |    10,069          5 |    10,074 
           |     19.97      25.00 |     19.97 
-----------+----------------------+----------
     Total |    50,424         20 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        Index of |
        Multiple |   outcome ONS COVID
     Deprivation |         death
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |    35,282         15 |    35,297 
                 |     69.97      75.00 |     69.97 
-----------------+----------------------+----------
               4 |    10,079          3 |    10,082 
                 |     19.99      15.00 |     19.99 
-----------------+----------------------+----------
 5 most deprived |     5,063          2 |     5,065 
                 |     10.04      10.00 |     10.04 
-----------------+----------------------+----------
           Total |    50,424         20 |    50,444 
                 |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Rural-Urba |   outcome ONS COVID
         n |         death
 Indicator |         0          1 |     Total
-----------+----------------------+----------
     rural |     5,087          1 |     5,088 
           |     10.09       5.00 |     10.09 
-----------+----------------------+----------
     urban |    45,337         19 |    45,356 
           |     89.91      95.00 |     89.91 
-----------+----------------------+----------
     Total |    50,424         20 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   outcome ONS COVID
                      |         death
    Region of England |         0          1 |     Total
----------------------+----------------------+----------
        East Midlands |     5,051          1 |     5,052 
                      |     10.02       5.00 |     10.02 
----------------------+----------------------+----------
      East of England |     4,979          4 |     4,983 
                      |      9.87      20.00 |      9.88 
----------------------+----------------------+----------
               London |    10,082          4 |    10,086 
                      |     19.99      20.00 |     19.99 
----------------------+----------------------+----------
           North East |     5,015          1 |     5,016 
                      |      9.95       5.00 |      9.94 
----------------------+----------------------+----------
           North West |     5,072          4 |     5,076 
                      |     10.06      20.00 |     10.06 
----------------------+----------------------+----------
           South East |    10,153          1 |    10,154 
                      |     20.14       5.00 |     20.13 
----------------------+----------------------+----------
        West Midlands |     5,001          3 |     5,004 
                      |      9.92      15.00 |      9.92 
----------------------+----------------------+----------
Yorkshire and the H.. |     5,071          2 |     5,073 
                      |     10.06      10.00 |     10.06 
----------------------+----------------------+----------
                Total |    50,424         20 |    50,444 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           | outcome ONS non-COVID
   Grouped |         death
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     9,831         21 |     9,852 
           |     19.52      22.58 |     19.53 
-----------+----------------------+----------
    30-<40 |     8,415         19 |     8,434 
           |     16.71      20.43 |     16.72 
-----------+----------------------+----------
    40-<50 |     8,065         16 |     8,081 
           |     16.02      17.20 |     16.02 
-----------+----------------------+----------
    50-<60 |     8,697         11 |     8,708 
           |     17.27      11.83 |     17.26 
-----------+----------------------+----------
    60-<70 |     6,916         13 |     6,929 
           |     13.74      13.98 |     13.74 
-----------+----------------------+----------
    70-<80 |     5,248          6 |     5,254 
           |     10.42       6.45 |     10.42 
-----------+----------------------+----------
       80+ |     3,179          7 |     3,186 
           |      6.31       7.53 |      6.32 
-----------+----------------------+----------
     Total |    50,351         93 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           | outcome ONS non-COVID
           |         death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    25,922         47 |    25,969 
           |     51.48      50.54 |     51.48 
-----------+----------------------+----------
         1 |    24,429         46 |    24,475 
           |     48.52      49.46 |     48.52 
-----------+----------------------+----------
     Total |    50,351         93 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      | outcome ONS non-COVID
                      |         death
     Eth 5 categories |         0          1 |     Total
----------------------+----------------------+----------
                White |    30,109         64 |    30,173 
                      |     59.80      68.82 |     59.81 
----------------------+----------------------+----------
Asian or Asian Britis |     3,870          9 |     3,879 
                      |      7.69       9.68 |      7.69 
----------------------+----------------------+----------
                Other |     3,751          4 |     3,755 
                      |      7.45       4.30 |      7.44 
----------------------+----------------------+----------
                    . |    12,621         16 |    12,637 
                      |     25.07      17.20 |     25.05 
----------------------+----------------------+----------
                Total |    50,351         93 |    50,444 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      | outcome ONS non-COVID
                      |         death
    Eth 16 categories |         0          1 |     Total
----------------------+----------------------+----------
British or Mixed Brit |    14,179         32 |    14,211 
                      |     28.16      34.41 |     28.17 
----------------------+----------------------+----------
                Irish |     2,891          4 |     2,895 
                      |      5.74       4.30 |      5.74 
----------------------+----------------------+----------
          Other White |     1,388          2 |     1,390 
                      |      2.76       2.15 |      2.76 
----------------------+----------------------+----------
White + Black Caribbe |     1,393          3 |     1,396 
                      |      2.77       3.23 |      2.77 
----------------------+----------------------+----------
White + Black African |     1,363          2 |     1,365 
                      |      2.71       2.15 |      2.71 
----------------------+----------------------+----------
        White + Asian |     1,489          3 |     1,492 
                      |      2.96       3.23 |      2.96 
----------------------+----------------------+----------
          Other mixed |     1,411          2 |     1,413 
                      |      2.80       2.15 |      2.80 
----------------------+----------------------+----------
Indian or British Ind |     1,368          3 |     1,371 
                      |      2.72       3.23 |      2.72 
----------------------+----------------------+----------
Pakistani or British  |       556          0 |       556 
                      |      1.10       0.00 |      1.10 
----------------------+----------------------+----------
Bangladeshi or Britis |       555          2 |       557 
                      |      1.10       2.15 |      1.10 
----------------------+----------------------+----------
          Other Asian |       291          0 |       291 
                      |      0.58       0.00 |      0.58 
----------------------+----------------------+----------
            Caribbean |       282          1 |       283 
                      |      0.56       1.08 |      0.56 
----------------------+----------------------+----------
              African |       263          0 |       263 
                      |      0.52       0.00 |      0.52 
----------------------+----------------------+----------
          Other Black |       282          0 |       282 
                      |      0.56       0.00 |      0.56 
----------------------+----------------------+----------
              Chinese |       283          0 |       283 
                      |      0.56       0.00 |      0.56 
----------------------+----------------------+----------
                Other |       298          1 |       299 
                      |      0.59       1.08 |      0.59 
----------------------+----------------------+----------
                    . |    22,059         38 |    22,097 
                      |     43.81      40.86 |     43.81 
----------------------+----------------------+----------
                Total |    50,351         93 |    50,444 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     | outcome ONS non-COVID
                     |         death
                 BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |       307          1 |       308 
                     |      0.61       1.08 |      0.61 
---------------------+----------------------+----------
  Normal (18.5-24.9) |     1,006          3 |     1,009 
                     |      2.00       3.23 |      2.00 
---------------------+----------------------+----------
Overweight (25-29.9) |     1,422          0 |     1,422 
                     |      2.82       0.00 |      2.82 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,855          6 |     1,861 
                     |      3.68       6.45 |      3.69 
---------------------+----------------------+----------
  Obese II (35-39.9) |     1,799          6 |     1,805 
                     |      3.57       6.45 |      3.58 
---------------------+----------------------+----------
     Obese III (40+) |     2,217          3 |     2,220 
                     |      4.40       3.23 |      4.40 
---------------------+----------------------+----------
        Unknown (.u) |    41,745         74 |    41,819 
                     |     82.91      79.57 |     82.90 
---------------------+----------------------+----------
               Total |    50,351         93 |    50,444 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     | outcome ONS non-COVID
          Obesity (4 |         death
         categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |    44,480         78 |    44,558 
                     |     88.34      83.87 |     88.33 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,855          6 |     1,861 
                     |      3.68       6.45 |      3.69 
---------------------+----------------------+----------
  Obese II (35-39.9) |     1,799          6 |     1,805 
                     |      3.57       6.45 |      3.58 
---------------------+----------------------+----------
     Obese III (40+) |     2,217          3 |     2,220 
                     |      4.40       3.23 |      4.40 
---------------------+----------------------+----------
               Total |    50,351         93 |    50,444 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  BMI with | outcome ONS non-COVID
        SA |         death
categories |         0          1 |     Total
-----------+----------------------+----------
         1 |       307          1 |       308 
           |      0.61       1.08 |      0.61 
-----------+----------------------+----------
         2 |       975          3 |       978 
           |      1.94       3.23 |      1.94 
-----------+----------------------+----------
         3 |     1,401          0 |     1,401 
           |      2.78       0.00 |      2.78 
-----------+----------------------+----------
         4 |     1,907          6 |     1,913 
           |      3.79       6.45 |      3.79 
-----------+----------------------+----------
         5 |     1,799          6 |     1,805 
           |      3.57       6.45 |      3.58 
-----------+----------------------+----------
         6 |     2,217          3 |     2,220 
           |      4.40       3.23 |      4.40 
-----------+----------------------+----------
        .u |    41,745         74 |    41,819 
           |     82.91      79.57 |     82.90 
-----------+----------------------+----------
     Total |    50,351         93 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      | outcome ONS non-COVID
      Obesity with SA |         death
           categories |         0          1 |     Total
----------------------+----------------------+----------
 No record of obesity |    44,428         78 |    44,506 
                      |     88.24      83.87 |     88.23 
----------------------+----------------------+----------
Obese I (30-34.9 / 27 |     1,907          6 |     1,913 
                      |      3.79       6.45 |      3.79 
----------------------+----------------------+----------
   Obese II (35-39.9) |     1,799          6 |     1,805 
                      |      3.57       6.45 |      3.58 
----------------------+----------------------+----------
      Obese III (40+) |     2,217          3 |     2,220 
                      |      4.40       3.23 |      4.40 
----------------------+----------------------+----------
                Total |    50,351         93 |    50,444 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             | outcome ONS non-COVID
     Smoking |         death
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |     2,026          4 |     2,030 
             |      4.02       4.30 |      4.02 
-------------+----------------------+----------
      Former |       989          3 |       992 
             |      1.96       3.23 |      1.97 
-------------+----------------------+----------
     Current |     5,986          9 |     5,995 
             |     11.89       9.68 |     11.88 
-------------+----------------------+----------
Unknown (.u) |    41,350         77 |    41,427 
             |     82.12      82.80 |     82.12 
-------------+----------------------+----------
       Total |    50,351         93 |    50,444 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic | outcome ONS non-COVID
Respirator |         death
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,269         77 |    40,346 
           |     79.98      82.80 |     79.98 
-----------+----------------------+----------
         1 |    10,082         16 |    10,098 
           |     20.02      17.20 |     20.02 
-----------+----------------------+----------
     Total |    50,351         93 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           | outcome ONS non-COVID
    Asthma |         death
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,280         75 |    40,355 
           |     80.00      80.65 |     80.00 
-----------+----------------------+----------
         1 |    10,071         18 |    10,089 
           |     20.00      19.35 |     20.00 
-----------+----------------------+----------
     Total |    50,351         93 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

      Asthma | outcome ONS non-COVID
    detailed |         death
  categories |         0          1 |     Total
-------------+----------------------+----------
          No |    40,280         75 |    40,355 
             |     80.00      80.65 |     80.00 
-------------+----------------------+----------
 Yes, no OCS |    10,071         18 |    10,089 
             |     20.00      19.35 |     20.00 
-------------+----------------------+----------
       Total |    50,351         93 |    50,444 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic | outcome ONS non-COVID
   Cardiac |         death
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,343         70 |    40,413 
           |     80.12      75.27 |     80.11 
-----------+----------------------+----------
         1 |    10,008         23 |    10,031 
           |     19.88      24.73 |     19.89 
-----------+----------------------+----------
     Total |    50,351         93 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           | outcome ONS non-COVID
  Diabetes |         death
   by type |         0          1 |     Total
-----------+----------------------+----------
     NO_DM |    37,825         62 |    37,887 
           |     75.12      66.67 |     75.11 
-----------+----------------------+----------
      T1DM |     1,492          4 |     1,496 
           |      2.96       4.30 |      2.97 
-----------+----------------------+----------
      T2DM |     9,991         26 |    10,017 
           |     19.84      27.96 |     19.86 
-----------+----------------------+----------
UNKNOWN_DM |     1,043          1 |     1,044 
           |      2.07       1.08 |      2.07 
-----------+----------------------+----------
     Total |    50,351         93 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Diabetes | outcome ONS non-COVID
    exeter |         death
      type |         0          1 |     Total
-----------+----------------------+----------
     NO_DM |    38,735         74 |    38,809 
           |     76.93      79.57 |     76.93 
-----------+----------------------+----------
T1DM_EX_OS |     1,504          4 |     1,508 
           |      2.99       4.30 |      2.99 
-----------+----------------------+----------
T2DM_EX_OS |    10,112         15 |    10,127 
           |     20.08      16.13 |     20.08 
-----------+----------------------+----------
     Total |    50,351         93 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           | outcome ONS non-COVID
           |         death
    Cancer |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,229         78 |    40,307 
           |     79.90      83.87 |     79.90 
-----------+----------------------+----------
         1 |    10,122         15 |    10,137 
           |     20.10      16.13 |     20.10 
-----------+----------------------+----------
     Total |    50,351         93 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic | outcome ONS non-COVID
     liver |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,320         70 |    40,390 
           |     80.08      75.27 |     80.07 
-----------+----------------------+----------
         1 |    10,031         23 |    10,054 
           |     19.92      24.73 |     19.93 
-----------+----------------------+----------
     Total |    50,351         93 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           | outcome ONS non-COVID
           |         death
    Stroke |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,281         79 |    40,360 
           |     80.00      84.95 |     80.01 
-----------+----------------------+----------
         1 |    10,070         14 |    10,084 
           |     20.00      15.05 |     19.99 
-----------+----------------------+----------
     Total |    50,351         93 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           | outcome ONS non-COVID
           |         death
  Dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,365         73 |    40,438 
           |     80.17      78.49 |     80.16 
-----------+----------------------+----------
         1 |     9,986         20 |    10,006 
           |     19.83      21.51 |     19.84 
-----------+----------------------+----------
     Total |    50,351         93 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           | outcome ONS non-COVID
Neurologic |         death
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,356         79 |    40,435 
           |     80.15      84.95 |     80.16 
-----------+----------------------+----------
         1 |     9,995         14 |    10,009 
           |     19.85      15.05 |     19.84 
-----------+----------------------+----------
     Total |    50,351         93 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      | outcome ONS non-COVID
       Reduced kidney |         death
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |    49,780         92 |    49,872 
                      |     98.87      98.92 |     98.87 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |       571          1 |       572 
                      |      1.13       1.08 |      1.13 
----------------------+----------------------+----------
                Total |    50,351         93 |    50,444 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           | outcome ONS non-COVID
Autoimmune |         death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,296         74 |    40,370 
           |     80.03      79.57 |     80.03 
-----------+----------------------+----------
         1 |    10,055         19 |    10,074 
           |     19.97      20.43 |     19.97 
-----------+----------------------+----------
     Total |    50,351         93 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        Index of |
        Multiple | outcome ONS non-COVID
     Deprivation |         death
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |    35,234         63 |    35,297 
                 |     69.98      67.74 |     69.97 
-----------------+----------------------+----------
               4 |    10,060         22 |    10,082 
                 |     19.98      23.66 |     19.99 
-----------------+----------------------+----------
 5 most deprived |     5,057          8 |     5,065 
                 |     10.04       8.60 |     10.04 
-----------------+----------------------+----------
           Total |    50,351         93 |    50,444 
                 |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Rural-Urba | outcome ONS non-COVID
         n |         death
 Indicator |         0          1 |     Total
-----------+----------------------+----------
     rural |     5,078         10 |     5,088 
           |     10.09      10.75 |     10.09 
-----------+----------------------+----------
     urban |    45,273         83 |    45,356 
           |     89.91      89.25 |     89.91 
-----------+----------------------+----------
     Total |    50,351         93 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      | outcome ONS non-COVID
                      |         death
    Region of England |         0          1 |     Total
----------------------+----------------------+----------
        East Midlands |     5,047          5 |     5,052 
                      |     10.02       5.38 |     10.02 
----------------------+----------------------+----------
      East of England |     4,968         15 |     4,983 
                      |      9.87      16.13 |      9.88 
----------------------+----------------------+----------
               London |    10,074         12 |    10,086 
                      |     20.01      12.90 |     19.99 
----------------------+----------------------+----------
           North East |     5,008          8 |     5,016 
                      |      9.95       8.60 |      9.94 
----------------------+----------------------+----------
           North West |     5,061         15 |     5,076 
                      |     10.05      16.13 |     10.06 
----------------------+----------------------+----------
           South East |    10,135         19 |    10,154 
                      |     20.13      20.43 |     20.13 
----------------------+----------------------+----------
        West Midlands |     4,994         10 |     5,004 
                      |      9.92      10.75 |      9.92 
----------------------+----------------------+----------
Yorkshire and the H.. |     5,064          9 |     5,073 
                      |     10.06       9.68 |     10.06 
----------------------+----------------------+----------
                Total |    50,351         93 |    50,444 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Grouped |  outcome CPNS death
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     9,839         13 |     9,852 
           |     19.53      18.06 |     19.53 
-----------+----------------------+----------
    30-<40 |     8,420         14 |     8,434 
           |     16.72      19.44 |     16.72 
-----------+----------------------+----------
    40-<50 |     8,064         17 |     8,081 
           |     16.01      23.61 |     16.02 
-----------+----------------------+----------
    50-<60 |     8,702          6 |     8,708 
           |     17.28       8.33 |     17.26 
-----------+----------------------+----------
    60-<70 |     6,914         15 |     6,929 
           |     13.73      20.83 |     13.74 
-----------+----------------------+----------
    70-<80 |     5,250          4 |     5,254 
           |     10.42       5.56 |     10.42 
-----------+----------------------+----------
       80+ |     3,183          3 |     3,186 
           |      6.32       4.17 |      6.32 
-----------+----------------------+----------
     Total |    50,372         72 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  outcome CPNS death
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    25,927         42 |    25,969 
           |     51.47      58.33 |     51.48 
-----------+----------------------+----------
         1 |    24,445         30 |    24,475 
           |     48.53      41.67 |     48.52 
-----------+----------------------+----------
     Total |    50,372         72 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |  outcome CPNS death
     Eth 5 categories |         0          1 |     Total
----------------------+----------------------+----------
                White |    30,128         45 |    30,173 
                      |     59.81      62.50 |     59.81 
----------------------+----------------------+----------
Asian or Asian Britis |     3,877          2 |     3,879 
                      |      7.70       2.78 |      7.69 
----------------------+----------------------+----------
                Other |     3,746          9 |     3,755 
                      |      7.44      12.50 |      7.44 
----------------------+----------------------+----------
                    . |    12,621         16 |    12,637 
                      |     25.06      22.22 |     25.05 
----------------------+----------------------+----------
                Total |    50,372         72 |    50,444 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |  outcome CPNS death
    Eth 16 categories |         0          1 |     Total
----------------------+----------------------+----------
British or Mixed Brit |    14,188         23 |    14,211 
                      |     28.17      31.94 |     28.17 
----------------------+----------------------+----------
                Irish |     2,892          3 |     2,895 
                      |      5.74       4.17 |      5.74 
----------------------+----------------------+----------
          Other White |     1,388          2 |     1,390 
                      |      2.76       2.78 |      2.76 
----------------------+----------------------+----------
White + Black Caribbe |     1,395          1 |     1,396 
                      |      2.77       1.39 |      2.77 
----------------------+----------------------+----------
White + Black African |     1,362          3 |     1,365 
                      |      2.70       4.17 |      2.71 
----------------------+----------------------+----------
        White + Asian |     1,492          0 |     1,492 
                      |      2.96       0.00 |      2.96 
----------------------+----------------------+----------
          Other mixed |     1,409          4 |     1,413 
                      |      2.80       5.56 |      2.80 
----------------------+----------------------+----------
Indian or British Ind |     1,369          2 |     1,371 
                      |      2.72       2.78 |      2.72 
----------------------+----------------------+----------
Pakistani or British  |       556          0 |       556 
                      |      1.10       0.00 |      1.10 
----------------------+----------------------+----------
Bangladeshi or Britis |       556          1 |       557 
                      |      1.10       1.39 |      1.10 
----------------------+----------------------+----------
          Other Asian |       291          0 |       291 
                      |      0.58       0.00 |      0.58 
----------------------+----------------------+----------
            Caribbean |       282          1 |       283 
                      |      0.56       1.39 |      0.56 
----------------------+----------------------+----------
              African |       263          0 |       263 
                      |      0.52       0.00 |      0.52 
----------------------+----------------------+----------
          Other Black |       282          0 |       282 
                      |      0.56       0.00 |      0.56 
----------------------+----------------------+----------
              Chinese |       282          1 |       283 
                      |      0.56       1.39 |      0.56 
----------------------+----------------------+----------
                Other |       299          0 |       299 
                      |      0.59       0.00 |      0.59 
----------------------+----------------------+----------
                    . |    22,066         31 |    22,097 
                      |     43.81      43.06 |     43.81 
----------------------+----------------------+----------
                Total |    50,372         72 |    50,444 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |  outcome CPNS death
                 BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |       308          0 |       308 
                     |      0.61       0.00 |      0.61 
---------------------+----------------------+----------
  Normal (18.5-24.9) |     1,008          1 |     1,009 
                     |      2.00       1.39 |      2.00 
---------------------+----------------------+----------
Overweight (25-29.9) |     1,420          2 |     1,422 
                     |      2.82       2.78 |      2.82 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,861          0 |     1,861 
                     |      3.69       0.00 |      3.69 
---------------------+----------------------+----------
  Obese II (35-39.9) |     1,801          4 |     1,805 
                     |      3.58       5.56 |      3.58 
---------------------+----------------------+----------
     Obese III (40+) |     2,219          1 |     2,220 
                     |      4.41       1.39 |      4.40 
---------------------+----------------------+----------
        Unknown (.u) |    41,755         64 |    41,819 
                     |     82.89      88.89 |     82.90 
---------------------+----------------------+----------
               Total |    50,372         72 |    50,444 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

          Obesity (4 |  outcome CPNS death
         categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |    44,491         67 |    44,558 
                     |     88.32      93.06 |     88.33 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,861          0 |     1,861 
                     |      3.69       0.00 |      3.69 
---------------------+----------------------+----------
  Obese II (35-39.9) |     1,801          4 |     1,805 
                     |      3.58       5.56 |      3.58 
---------------------+----------------------+----------
     Obese III (40+) |     2,219          1 |     2,220 
                     |      4.41       1.39 |      4.40 
---------------------+----------------------+----------
               Total |    50,372         72 |    50,444 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  BMI with |
        SA |  outcome CPNS death
categories |         0          1 |     Total
-----------+----------------------+----------
         1 |       308          0 |       308 
           |      0.61       0.00 |      0.61 
-----------+----------------------+----------
         2 |       977          1 |       978 
           |      1.94       1.39 |      1.94 
-----------+----------------------+----------
         3 |     1,399          2 |     1,401 
           |      2.78       2.78 |      2.78 
-----------+----------------------+----------
         4 |     1,913          0 |     1,913 
           |      3.80       0.00 |      3.79 
-----------+----------------------+----------
         5 |     1,801          4 |     1,805 
           |      3.58       5.56 |      3.58 
-----------+----------------------+----------
         6 |     2,219          1 |     2,220 
           |      4.41       1.39 |      4.40 
-----------+----------------------+----------
        .u |    41,755         64 |    41,819 
           |     82.89      88.89 |     82.90 
-----------+----------------------+----------
     Total |    50,372         72 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

      Obesity with SA |  outcome CPNS death
           categories |         0          1 |     Total
----------------------+----------------------+----------
 No record of obesity |    44,439         67 |    44,506 
                      |     88.22      93.06 |     88.23 
----------------------+----------------------+----------
Obese I (30-34.9 / 27 |     1,913          0 |     1,913 
                      |      3.80       0.00 |      3.79 
----------------------+----------------------+----------
   Obese II (35-39.9) |     1,801          4 |     1,805 
                      |      3.58       5.56 |      3.58 
----------------------+----------------------+----------
      Obese III (40+) |     2,219          1 |     2,220 
                      |      4.41       1.39 |      4.40 
----------------------+----------------------+----------
                Total |    50,372         72 |    50,444 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Smoking |  outcome CPNS death
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |     2,024          6 |     2,030 
             |      4.02       8.33 |      4.02 
-------------+----------------------+----------
      Former |       989          3 |       992 
             |      1.96       4.17 |      1.97 
-------------+----------------------+----------
     Current |     5,985         10 |     5,995 
             |     11.88      13.89 |     11.88 
-------------+----------------------+----------
Unknown (.u) |    41,374         53 |    41,427 
             |     82.14      73.61 |     82.12 
-------------+----------------------+----------
       Total |    50,372         72 |    50,444 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |
Respirator |  outcome CPNS death
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,284         62 |    40,346 
           |     79.97      86.11 |     79.98 
-----------+----------------------+----------
         1 |    10,088         10 |    10,098 
           |     20.03      13.89 |     20.02 
-----------+----------------------+----------
     Total |    50,372         72 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Asthma |  outcome CPNS death
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,291         64 |    40,355 
           |     79.99      88.89 |     80.00 
-----------+----------------------+----------
         1 |    10,081          8 |    10,089 
           |     20.01      11.11 |     20.00 
-----------+----------------------+----------
     Total |    50,372         72 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

      Asthma |
    detailed |  outcome CPNS death
  categories |         0          1 |     Total
-------------+----------------------+----------
          No |    40,291         64 |    40,355 
             |     79.99      88.89 |     80.00 
-------------+----------------------+----------
 Yes, no OCS |    10,081          8 |    10,089 
             |     20.01      11.11 |     20.00 
-------------+----------------------+----------
       Total |    50,372         72 |    50,444 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |
   Cardiac |  outcome CPNS death
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,357         56 |    40,413 
           |     80.12      77.78 |     80.11 
-----------+----------------------+----------
         1 |    10,015         16 |    10,031 
           |     19.88      22.22 |     19.89 
-----------+----------------------+----------
     Total |    50,372         72 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Diabetes |  outcome CPNS death
   by type |         0          1 |     Total
-----------+----------------------+----------
     NO_DM |    37,837         50 |    37,887 
           |     75.12      69.44 |     75.11 
-----------+----------------------+----------
      T1DM |     1,495          1 |     1,496 
           |      2.97       1.39 |      2.97 
-----------+----------------------+----------
      T2DM |     9,997         20 |    10,017 
           |     19.85      27.78 |     19.86 
-----------+----------------------+----------
UNKNOWN_DM |     1,043          1 |     1,044 
           |      2.07       1.39 |      2.07 
-----------+----------------------+----------
     Total |    50,372         72 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Diabetes |
    exeter |  outcome CPNS death
      type |         0          1 |     Total
-----------+----------------------+----------
     NO_DM |    38,758         51 |    38,809 
           |     76.94      70.83 |     76.93 
-----------+----------------------+----------
T1DM_EX_OS |     1,505          3 |     1,508 
           |      2.99       4.17 |      2.99 
-----------+----------------------+----------
T2DM_EX_OS |    10,109         18 |    10,127 
           |     20.07      25.00 |     20.08 
-----------+----------------------+----------
     Total |    50,372         72 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  outcome CPNS death
    Cancer |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,253         54 |    40,307 
           |     79.91      75.00 |     79.90 
-----------+----------------------+----------
         1 |    10,119         18 |    10,137 
           |     20.09      25.00 |     20.10 
-----------+----------------------+----------
     Total |    50,372         72 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |
     liver |  outcome CPNS death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,334         56 |    40,390 
           |     80.07      77.78 |     80.07 
-----------+----------------------+----------
         1 |    10,038         16 |    10,054 
           |     19.93      22.22 |     19.93 
-----------+----------------------+----------
     Total |    50,372         72 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  outcome CPNS death
    Stroke |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,302         58 |    40,360 
           |     80.01      80.56 |     80.01 
-----------+----------------------+----------
         1 |    10,070         14 |    10,084 
           |     19.99      19.44 |     19.99 
-----------+----------------------+----------
     Total |    50,372         72 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |  outcome CPNS death
  Dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,379         59 |    40,438 
           |     80.16      81.94 |     80.16 
-----------+----------------------+----------
         1 |     9,993         13 |    10,006 
           |     19.84      18.06 |     19.84 
-----------+----------------------+----------
     Total |    50,372         72 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Neurologic |  outcome CPNS death
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,377         58 |    40,435 
           |     80.16      80.56 |     80.16 
-----------+----------------------+----------
         1 |     9,995         14 |    10,009 
           |     19.84      19.44 |     19.84 
-----------+----------------------+----------
     Total |    50,372         72 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

       Reduced kidney |  outcome CPNS death
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |    49,801         71 |    49,872 
                      |     98.87      98.61 |     98.87 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |       571          1 |       572 
                      |      1.13       1.39 |      1.13 
----------------------+----------------------+----------
                Total |    50,372         72 |    50,444 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Autoimmune |  outcome CPNS death
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,314         56 |    40,370 
           |     80.03      77.78 |     80.03 
-----------+----------------------+----------
         1 |    10,058         16 |    10,074 
           |     19.97      22.22 |     19.97 
-----------+----------------------+----------
     Total |    50,372         72 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        Index of |
        Multiple |
     Deprivation |  outcome CPNS death
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |    35,246         51 |    35,297 
                 |     69.97      70.83 |     69.97 
-----------------+----------------------+----------
               4 |    10,069         13 |    10,082 
                 |     19.99      18.06 |     19.99 
-----------------+----------------------+----------
 5 most deprived |     5,057          8 |     5,065 
                 |     10.04      11.11 |     10.04 
-----------------+----------------------+----------
           Total |    50,372         72 |    50,444 
                 |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Rural-Urba |
         n |  outcome CPNS death
 Indicator |         0          1 |     Total
-----------+----------------------+----------
     rural |     5,082          6 |     5,088 
           |     10.09       8.33 |     10.09 
-----------+----------------------+----------
     urban |    45,290         66 |    45,356 
           |     89.91      91.67 |     89.91 
-----------+----------------------+----------
     Total |    50,372         72 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |  outcome CPNS death
    Region of England |         0          1 |     Total
----------------------+----------------------+----------
        East Midlands |     5,046          6 |     5,052 
                      |     10.02       8.33 |     10.02 
----------------------+----------------------+----------
      East of England |     4,974          9 |     4,983 
                      |      9.87      12.50 |      9.88 
----------------------+----------------------+----------
               London |    10,068         18 |    10,086 
                      |     19.99      25.00 |     19.99 
----------------------+----------------------+----------
           North East |     5,010          6 |     5,016 
                      |      9.95       8.33 |      9.94 
----------------------+----------------------+----------
           North West |     5,070          6 |     5,076 
                      |     10.07       8.33 |     10.06 
----------------------+----------------------+----------
           South East |    10,139         15 |    10,154 
                      |     20.13      20.83 |     20.13 
----------------------+----------------------+----------
        West Midlands |     4,999          5 |     5,004 
                      |      9.92       6.94 |      9.92 
----------------------+----------------------+----------
Yorkshire and the H.. |     5,066          7 |     5,073 
                      |     10.06       9.72 |     10.06 
----------------------+----------------------+----------
                Total |    50,372         72 |    50,444 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |      outcome A&E
   Grouped |      Attendance
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     7,902      1,950 |     9,852 
           |     19.56      19.41 |     19.53 
-----------+----------------------+----------
    30-<40 |     6,713      1,721 |     8,434 
           |     16.62      17.13 |     16.72 
-----------+----------------------+----------
    40-<50 |     6,527      1,554 |     8,081 
           |     16.16      15.47 |     16.02 
-----------+----------------------+----------
    50-<60 |     6,950      1,758 |     8,708 
           |     17.20      17.50 |     17.26 
-----------+----------------------+----------
    60-<70 |     5,572      1,357 |     6,929 
           |     13.79      13.51 |     13.74 
-----------+----------------------+----------
    70-<80 |     4,192      1,062 |     5,254 
           |     10.38      10.57 |     10.42 
-----------+----------------------+----------
       80+ |     2,543        643 |     3,186 
           |      6.29       6.40 |      6.32 
-----------+----------------------+----------
     Total |    40,399     10,045 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |      outcome A&E
           |      Attendance
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    20,840      5,129 |    25,969 
           |     51.59      51.06 |     51.48 
-----------+----------------------+----------
         1 |    19,559      4,916 |    24,475 
           |     48.41      48.94 |     48.52 
-----------+----------------------+----------
     Total |    40,399     10,045 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |      outcome A&E
                      |      Attendance
     Eth 5 categories |         0          1 |     Total
----------------------+----------------------+----------
                White |    24,140      6,033 |    30,173 
                      |     59.75      60.06 |     59.81 
----------------------+----------------------+----------
Asian or Asian Britis |     3,111        768 |     3,879 
                      |      7.70       7.65 |      7.69 
----------------------+----------------------+----------
                Other |     3,016        739 |     3,755 
                      |      7.47       7.36 |      7.44 
----------------------+----------------------+----------
                    . |    10,132      2,505 |    12,637 
                      |     25.08      24.94 |     25.05 
----------------------+----------------------+----------
                Total |    40,399     10,045 |    50,444 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |      outcome A&E
                      |      Attendance
    Eth 16 categories |         0          1 |     Total
----------------------+----------------------+----------
British or Mixed Brit |    11,425      2,786 |    14,211 
                      |     28.28      27.74 |     28.17 
----------------------+----------------------+----------
                Irish |     2,326        569 |     2,895 
                      |      5.76       5.66 |      5.74 
----------------------+----------------------+----------
          Other White |     1,107        283 |     1,390 
                      |      2.74       2.82 |      2.76 
----------------------+----------------------+----------
White + Black Caribbe |     1,109        287 |     1,396 
                      |      2.75       2.86 |      2.77 
----------------------+----------------------+----------
White + Black African |     1,106        259 |     1,365 
                      |      2.74       2.58 |      2.71 
----------------------+----------------------+----------
        White + Asian |     1,170        322 |     1,492 
                      |      2.90       3.21 |      2.96 
----------------------+----------------------+----------
          Other mixed |     1,120        293 |     1,413 
                      |      2.77       2.92 |      2.80 
----------------------+----------------------+----------
Indian or British Ind |     1,077        294 |     1,371 
                      |      2.67       2.93 |      2.72 
----------------------+----------------------+----------
Pakistani or British  |       439        117 |       556 
                      |      1.09       1.16 |      1.10 
----------------------+----------------------+----------
Bangladeshi or Britis |       454        103 |       557 
                      |      1.12       1.03 |      1.10 
----------------------+----------------------+----------
          Other Asian |       235         56 |       291 
                      |      0.58       0.56 |      0.58 
----------------------+----------------------+----------
            Caribbean |       224         59 |       283 
                      |      0.55       0.59 |      0.56 
----------------------+----------------------+----------
              African |       222         41 |       263 
                      |      0.55       0.41 |      0.52 
----------------------+----------------------+----------
          Other Black |       237         45 |       282 
                      |      0.59       0.45 |      0.56 
----------------------+----------------------+----------
              Chinese |       227         56 |       283 
                      |      0.56       0.56 |      0.56 
----------------------+----------------------+----------
                Other |       233         66 |       299 
                      |      0.58       0.66 |      0.59 
----------------------+----------------------+----------
                    . |    17,688      4,409 |    22,097 
                      |     43.78      43.89 |     43.81 
----------------------+----------------------+----------
                Total |    40,399     10,045 |    50,444 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |      outcome A&E
                     |      Attendance
                 BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |       243         65 |       308 
                     |      0.60       0.65 |      0.61 
---------------------+----------------------+----------
  Normal (18.5-24.9) |       809        200 |     1,009 
                     |      2.00       1.99 |      2.00 
---------------------+----------------------+----------
Overweight (25-29.9) |     1,151        271 |     1,422 
                     |      2.85       2.70 |      2.82 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,515        346 |     1,861 
                     |      3.75       3.44 |      3.69 
---------------------+----------------------+----------
  Obese II (35-39.9) |     1,434        371 |     1,805 
                     |      3.55       3.69 |      3.58 
---------------------+----------------------+----------
     Obese III (40+) |     1,765        455 |     2,220 
                     |      4.37       4.53 |      4.40 
---------------------+----------------------+----------
        Unknown (.u) |    33,482      8,337 |    41,819 
                     |     82.88      83.00 |     82.90 
---------------------+----------------------+----------
               Total |    40,399     10,045 |    50,444 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |      outcome A&E
          Obesity (4 |      Attendance
         categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |    35,685      8,873 |    44,558 
                     |     88.33      88.33 |     88.33 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,515        346 |     1,861 
                     |      3.75       3.44 |      3.69 
---------------------+----------------------+----------
  Obese II (35-39.9) |     1,434        371 |     1,805 
                     |      3.55       3.69 |      3.58 
---------------------+----------------------+----------
     Obese III (40+) |     1,765        455 |     2,220 
                     |      4.37       4.53 |      4.40 
---------------------+----------------------+----------
               Total |    40,399     10,045 |    50,444 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  BMI with |      outcome A&E
        SA |      Attendance
categories |         0          1 |     Total
-----------+----------------------+----------
         1 |       243         65 |       308 
           |      0.60       0.65 |      0.61 
-----------+----------------------+----------
         2 |       785        193 |       978 
           |      1.94       1.92 |      1.94 
-----------+----------------------+----------
         3 |     1,133        268 |     1,401 
           |      2.80       2.67 |      2.78 
-----------+----------------------+----------
         4 |     1,557        356 |     1,913 
           |      3.85       3.54 |      3.79 
-----------+----------------------+----------
         5 |     1,434        371 |     1,805 
           |      3.55       3.69 |      3.58 
-----------+----------------------+----------
         6 |     1,765        455 |     2,220 
           |      4.37       4.53 |      4.40 
-----------+----------------------+----------
        .u |    33,482      8,337 |    41,819 
           |     82.88      83.00 |     82.90 
-----------+----------------------+----------
     Total |    40,399     10,045 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |      outcome A&E
      Obesity with SA |      Attendance
           categories |         0          1 |     Total
----------------------+----------------------+----------
 No record of obesity |    35,643      8,863 |    44,506 
                      |     88.23      88.23 |     88.23 
----------------------+----------------------+----------
Obese I (30-34.9 / 27 |     1,557        356 |     1,913 
                      |      3.85       3.54 |      3.79 
----------------------+----------------------+----------
   Obese II (35-39.9) |     1,434        371 |     1,805 
                      |      3.55       3.69 |      3.58 
----------------------+----------------------+----------
      Obese III (40+) |     1,765        455 |     2,220 
                      |      4.37       4.53 |      4.40 
----------------------+----------------------+----------
                Total |    40,399     10,045 |    50,444 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |      outcome A&E
     Smoking |      Attendance
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |     1,619        411 |     2,030 
             |      4.01       4.09 |      4.02 
-------------+----------------------+----------
      Former |       803        189 |       992 
             |      1.99       1.88 |      1.97 
-------------+----------------------+----------
     Current |     4,808      1,187 |     5,995 
             |     11.90      11.82 |     11.88 
-------------+----------------------+----------
Unknown (.u) |    33,169      8,258 |    41,427 
             |     82.10      82.21 |     82.12 
-------------+----------------------+----------
       Total |    40,399     10,045 |    50,444 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |      outcome A&E
Respirator |      Attendance
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,308      8,038 |    40,346 
           |     79.97      80.02 |     79.98 
-----------+----------------------+----------
         1 |     8,091      2,007 |    10,098 
           |     20.03      19.98 |     20.02 
-----------+----------------------+----------
     Total |    40,399     10,045 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |      outcome A&E
    Asthma |      Attendance
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,378      7,977 |    40,355 
           |     80.15      79.41 |     80.00 
-----------+----------------------+----------
         1 |     8,021      2,068 |    10,089 
           |     19.85      20.59 |     20.00 
-----------+----------------------+----------
     Total |    40,399     10,045 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

      Asthma |      outcome A&E
    detailed |      Attendance
  categories |         0          1 |     Total
-------------+----------------------+----------
          No |    32,378      7,977 |    40,355 
             |     80.15      79.41 |     80.00 
-------------+----------------------+----------
 Yes, no OCS |     8,021      2,068 |    10,089 
             |     19.85      20.59 |     20.00 
-------------+----------------------+----------
       Total |    40,399     10,045 |    50,444 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |      outcome A&E
   Cardiac |      Attendance
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,385      8,028 |    40,413 
           |     80.16      79.92 |     80.11 
-----------+----------------------+----------
         1 |     8,014      2,017 |    10,031 
           |     19.84      20.08 |     19.89 
-----------+----------------------+----------
     Total |    40,399     10,045 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |      outcome A&E
  Diabetes |      Attendance
   by type |         0          1 |     Total
-----------+----------------------+----------
     NO_DM |    30,313      7,574 |    37,887 
           |     75.03      75.40 |     75.11 
-----------+----------------------+----------
      T1DM |     1,176        320 |     1,496 
           |      2.91       3.19 |      2.97 
-----------+----------------------+----------
      T2DM |     8,087      1,930 |    10,017 
           |     20.02      19.21 |     19.86 
-----------+----------------------+----------
UNKNOWN_DM |       823        221 |     1,044 
           |      2.04       2.20 |      2.07 
-----------+----------------------+----------
     Total |    40,399     10,045 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Diabetes |      outcome A&E
    exeter |      Attendance
      type |         0          1 |     Total
-----------+----------------------+----------
     NO_DM |    31,076      7,733 |    38,809 
           |     76.92      76.98 |     76.93 
-----------+----------------------+----------
T1DM_EX_OS |     1,225        283 |     1,508 
           |      3.03       2.82 |      2.99 
-----------+----------------------+----------
T2DM_EX_OS |     8,098      2,029 |    10,127 
           |     20.05      20.20 |     20.08 
-----------+----------------------+----------
     Total |    40,399     10,045 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |      outcome A&E
           |      Attendance
    Cancer |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,294      8,013 |    40,307 
           |     79.94      79.77 |     79.90 
-----------+----------------------+----------
         1 |     8,105      2,032 |    10,137 
           |     20.06      20.23 |     20.10 
-----------+----------------------+----------
     Total |    40,399     10,045 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |      outcome A&E
     liver |      Attendance
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,328      8,062 |    40,390 
           |     80.02      80.26 |     80.07 
-----------+----------------------+----------
         1 |     8,071      1,983 |    10,054 
           |     19.98      19.74 |     19.93 
-----------+----------------------+----------
     Total |    40,399     10,045 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |      outcome A&E
           |      Attendance
    Stroke |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,374      7,986 |    40,360 
           |     80.14      79.50 |     80.01 
-----------+----------------------+----------
         1 |     8,025      2,059 |    10,084 
           |     19.86      20.50 |     19.99 
-----------+----------------------+----------
     Total |    40,399     10,045 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |      outcome A&E
           |      Attendance
  Dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,377      8,061 |    40,438 
           |     80.14      80.25 |     80.16 
-----------+----------------------+----------
         1 |     8,022      1,984 |    10,006 
           |     19.86      19.75 |     19.84 
-----------+----------------------+----------
     Total |    40,399     10,045 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |      outcome A&E
Neurologic |      Attendance
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,372      8,063 |    40,435 
           |     80.13      80.27 |     80.16 
-----------+----------------------+----------
         1 |     8,027      1,982 |    10,009 
           |     19.87      19.73 |     19.84 
-----------+----------------------+----------
     Total |    40,399     10,045 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |      outcome A&E
       Reduced kidney |      Attendance
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |    39,943      9,929 |    49,872 
                      |     98.87      98.85 |     98.87 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |       456        116 |       572 
                      |      1.13       1.15 |      1.13 
----------------------+----------------------+----------
                Total |    40,399     10,045 |    50,444 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |      outcome A&E
Autoimmune |      Attendance
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,333      8,037 |    40,370 
           |     80.03      80.01 |     80.03 
-----------+----------------------+----------
         1 |     8,066      2,008 |    10,074 
           |     19.97      19.99 |     19.97 
-----------+----------------------+----------
     Total |    40,399     10,045 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        Index of |
        Multiple |      outcome A&E
     Deprivation |      Attendance
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |    28,301      6,996 |    35,297 
                 |     70.05      69.65 |     69.97 
-----------------+----------------------+----------
               4 |     8,067      2,015 |    10,082 
                 |     19.97      20.06 |     19.99 
-----------------+----------------------+----------
 5 most deprived |     4,031      1,034 |     5,065 
                 |      9.98      10.29 |     10.04 
-----------------+----------------------+----------
           Total |    40,399     10,045 |    50,444 
                 |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Rural-Urba |      outcome A&E
         n |      Attendance
 Indicator |         0          1 |     Total
-----------+----------------------+----------
     rural |     4,084      1,004 |     5,088 
           |     10.11      10.00 |     10.09 
-----------+----------------------+----------
     urban |    36,315      9,041 |    45,356 
           |     89.89      90.00 |     89.91 
-----------+----------------------+----------
     Total |    40,399     10,045 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |      outcome A&E
                      |      Attendance
    Region of England |         0          1 |     Total
----------------------+----------------------+----------
        East Midlands |     4,013      1,039 |     5,052 
                      |      9.93      10.34 |     10.02 
----------------------+----------------------+----------
      East of England |     4,012        971 |     4,983 
                      |      9.93       9.67 |      9.88 
----------------------+----------------------+----------
               London |     8,113      1,973 |    10,086 
                      |     20.08      19.64 |     19.99 
----------------------+----------------------+----------
           North East |     4,011      1,005 |     5,016 
                      |      9.93      10.00 |      9.94 
----------------------+----------------------+----------
           North West |     4,074      1,002 |     5,076 
                      |     10.08       9.98 |     10.06 
----------------------+----------------------+----------
           South East |     8,135      2,019 |    10,154 
                      |     20.14      20.10 |     20.13 
----------------------+----------------------+----------
        West Midlands |     3,969      1,035 |     5,004 
                      |      9.82      10.30 |      9.92 
----------------------+----------------------+----------
Yorkshire and the H.. |     4,072      1,001 |     5,073 
                      |     10.08       9.97 |     10.06 
----------------------+----------------------+----------
                Total |    40,399     10,045 |    50,444 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Grouped | outcome ICU Admission
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     9,836         16 |     9,852 
           |     19.54      17.02 |     19.53 
-----------+----------------------+----------
    30-<40 |     8,422         12 |     8,434 
           |     16.73      12.77 |     16.72 
-----------+----------------------+----------
    40-<50 |     8,064         17 |     8,081 
           |     16.02      18.09 |     16.02 
-----------+----------------------+----------
    50-<60 |     8,692         16 |     8,708 
           |     17.26      17.02 |     17.26 
-----------+----------------------+----------
    60-<70 |     6,915         14 |     6,929 
           |     13.73      14.89 |     13.74 
-----------+----------------------+----------
    70-<80 |     5,239         15 |     5,254 
           |     10.41      15.96 |     10.42 
-----------+----------------------+----------
       80+ |     3,182          4 |     3,186 
           |      6.32       4.26 |      6.32 
-----------+----------------------+----------
     Total |    50,350         94 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           | outcome ICU Admission
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    25,924         45 |    25,969 
           |     51.49      47.87 |     51.48 
-----------+----------------------+----------
         1 |    24,426         49 |    24,475 
           |     48.51      52.13 |     48.52 
-----------+----------------------+----------
     Total |    50,350         94 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      | outcome ICU Admission
     Eth 5 categories |         0          1 |     Total
----------------------+----------------------+----------
                White |    30,118         55 |    30,173 
                      |     59.82      58.51 |     59.81 
----------------------+----------------------+----------
Asian or Asian Britis |     3,874          5 |     3,879 
                      |      7.69       5.32 |      7.69 
----------------------+----------------------+----------
                Other |     3,749          6 |     3,755 
                      |      7.45       6.38 |      7.44 
----------------------+----------------------+----------
                    . |    12,609         28 |    12,637 
                      |     25.04      29.79 |     25.05 
----------------------+----------------------+----------
                Total |    50,350         94 |    50,444 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      | outcome ICU Admission
    Eth 16 categories |         0          1 |     Total
----------------------+----------------------+----------
British or Mixed Brit |    14,188         23 |    14,211 
                      |     28.18      24.47 |     28.17 
----------------------+----------------------+----------
                Irish |     2,891          4 |     2,895 
                      |      5.74       4.26 |      5.74 
----------------------+----------------------+----------
          Other White |     1,388          2 |     1,390 
                      |      2.76       2.13 |      2.76 
----------------------+----------------------+----------
White + Black Caribbe |     1,392          4 |     1,396 
                      |      2.76       4.26 |      2.77 
----------------------+----------------------+----------
White + Black African |     1,362          3 |     1,365 
                      |      2.71       3.19 |      2.71 
----------------------+----------------------+----------
        White + Asian |     1,490          2 |     1,492 
                      |      2.96       2.13 |      2.96 
----------------------+----------------------+----------
          Other mixed |     1,412          1 |     1,413 
                      |      2.80       1.06 |      2.80 
----------------------+----------------------+----------
Indian or British Ind |     1,368          3 |     1,371 
                      |      2.72       3.19 |      2.72 
----------------------+----------------------+----------
Pakistani or British  |       554          2 |       556 
                      |      1.10       2.13 |      1.10 
----------------------+----------------------+----------
Bangladeshi or Britis |       557          0 |       557 
                      |      1.11       0.00 |      1.10 
----------------------+----------------------+----------
          Other Asian |       290          1 |       291 
                      |      0.58       1.06 |      0.58 
----------------------+----------------------+----------
            Caribbean |       283          0 |       283 
                      |      0.56       0.00 |      0.56 
----------------------+----------------------+----------
              African |       263          0 |       263 
                      |      0.52       0.00 |      0.52 
----------------------+----------------------+----------
          Other Black |       282          0 |       282 
                      |      0.56       0.00 |      0.56 
----------------------+----------------------+----------
              Chinese |       283          0 |       283 
                      |      0.56       0.00 |      0.56 
----------------------+----------------------+----------
                Other |       299          0 |       299 
                      |      0.59       0.00 |      0.59 
----------------------+----------------------+----------
                    . |    22,048         49 |    22,097 
                      |     43.79      52.13 |     43.81 
----------------------+----------------------+----------
                Total |    50,350         94 |    50,444 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     | outcome ICU Admission
                 BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |       308          0 |       308 
                     |      0.61       0.00 |      0.61 
---------------------+----------------------+----------
  Normal (18.5-24.9) |     1,007          2 |     1,009 
                     |      2.00       2.13 |      2.00 
---------------------+----------------------+----------
Overweight (25-29.9) |     1,416          6 |     1,422 
                     |      2.81       6.38 |      2.82 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,856          5 |     1,861 
                     |      3.69       5.32 |      3.69 
---------------------+----------------------+----------
  Obese II (35-39.9) |     1,805          0 |     1,805 
                     |      3.58       0.00 |      3.58 
---------------------+----------------------+----------
     Obese III (40+) |     2,215          5 |     2,220 
                     |      4.40       5.32 |      4.40 
---------------------+----------------------+----------
        Unknown (.u) |    41,743         76 |    41,819 
                     |     82.91      80.85 |     82.90 
---------------------+----------------------+----------
               Total |    50,350         94 |    50,444 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

          Obesity (4 | outcome ICU Admission
         categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |    44,474         84 |    44,558 
                     |     88.33      89.36 |     88.33 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,856          5 |     1,861 
                     |      3.69       5.32 |      3.69 
---------------------+----------------------+----------
  Obese II (35-39.9) |     1,805          0 |     1,805 
                     |      3.58       0.00 |      3.58 
---------------------+----------------------+----------
     Obese III (40+) |     2,215          5 |     2,220 
                     |      4.40       5.32 |      4.40 
---------------------+----------------------+----------
               Total |    50,350         94 |    50,444 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  BMI with |
        SA | outcome ICU Admission
categories |         0          1 |     Total
-----------+----------------------+----------
         1 |       308          0 |       308 
           |      0.61       0.00 |      0.61 
-----------+----------------------+----------
         2 |       976          2 |       978 
           |      1.94       2.13 |      1.94 
-----------+----------------------+----------
         3 |     1,396          5 |     1,401 
           |      2.77       5.32 |      2.78 
-----------+----------------------+----------
         4 |     1,907          6 |     1,913 
           |      3.79       6.38 |      3.79 
-----------+----------------------+----------
         5 |     1,805          0 |     1,805 
           |      3.58       0.00 |      3.58 
-----------+----------------------+----------
         6 |     2,215          5 |     2,220 
           |      4.40       5.32 |      4.40 
-----------+----------------------+----------
        .u |    41,743         76 |    41,819 
           |     82.91      80.85 |     82.90 
-----------+----------------------+----------
     Total |    50,350         94 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

      Obesity with SA | outcome ICU Admission
           categories |         0          1 |     Total
----------------------+----------------------+----------
 No record of obesity |    44,423         83 |    44,506 
                      |     88.23      88.30 |     88.23 
----------------------+----------------------+----------
Obese I (30-34.9 / 27 |     1,907          6 |     1,913 
                      |      3.79       6.38 |      3.79 
----------------------+----------------------+----------
   Obese II (35-39.9) |     1,805          0 |     1,805 
                      |      3.58       0.00 |      3.58 
----------------------+----------------------+----------
      Obese III (40+) |     2,215          5 |     2,220 
                      |      4.40       5.32 |      4.40 
----------------------+----------------------+----------
                Total |    50,350         94 |    50,444 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

     Smoking | outcome ICU Admission
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |     2,027          3 |     2,030 
             |      4.03       3.19 |      4.02 
-------------+----------------------+----------
      Former |       991          1 |       992 
             |      1.97       1.06 |      1.97 
-------------+----------------------+----------
     Current |     5,986          9 |     5,995 
             |     11.89       9.57 |     11.88 
-------------+----------------------+----------
Unknown (.u) |    41,346         81 |    41,427 
             |     82.12      86.17 |     82.12 
-------------+----------------------+----------
       Total |    50,350         94 |    50,444 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |
Respirator | outcome ICU Admission
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,278         68 |    40,346 
           |     80.00      72.34 |     79.98 
-----------+----------------------+----------
         1 |    10,072         26 |    10,098 
           |     20.00      27.66 |     20.02 
-----------+----------------------+----------
     Total |    50,350         94 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

    Asthma | outcome ICU Admission
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,273         82 |    40,355 
           |     79.99      87.23 |     80.00 
-----------+----------------------+----------
         1 |    10,077         12 |    10,089 
           |     20.01      12.77 |     20.00 
-----------+----------------------+----------
     Total |    50,350         94 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

      Asthma |
    detailed | outcome ICU Admission
  categories |         0          1 |     Total
-------------+----------------------+----------
          No |    40,273         82 |    40,355 
             |     79.99      87.23 |     80.00 
-------------+----------------------+----------
 Yes, no OCS |    10,077         12 |    10,089 
             |     20.01      12.77 |     20.00 
-------------+----------------------+----------
       Total |    50,350         94 |    50,444 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |
   Cardiac | outcome ICU Admission
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,334         79 |    40,413 
           |     80.11      84.04 |     80.11 
-----------+----------------------+----------
         1 |    10,016         15 |    10,031 
           |     19.89      15.96 |     19.89 
-----------+----------------------+----------
     Total |    50,350         94 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Diabetes | outcome ICU Admission
   by type |         0          1 |     Total
-----------+----------------------+----------
     NO_DM |    37,819         68 |    37,887 
           |     75.11      72.34 |     75.11 
-----------+----------------------+----------
      T1DM |     1,494          2 |     1,496 
           |      2.97       2.13 |      2.97 
-----------+----------------------+----------
      T2DM |     9,994         23 |    10,017 
           |     19.85      24.47 |     19.86 
-----------+----------------------+----------
UNKNOWN_DM |     1,043          1 |     1,044 
           |      2.07       1.06 |      2.07 
-----------+----------------------+----------
     Total |    50,350         94 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Diabetes |
    exeter | outcome ICU Admission
      type |         0          1 |     Total
-----------+----------------------+----------
     NO_DM |    38,737         72 |    38,809 
           |     76.94      76.60 |     76.93 
-----------+----------------------+----------
T1DM_EX_OS |     1,506          2 |     1,508 
           |      2.99       2.13 |      2.99 
-----------+----------------------+----------
T2DM_EX_OS |    10,107         20 |    10,127 
           |     20.07      21.28 |     20.08 
-----------+----------------------+----------
     Total |    50,350         94 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           | outcome ICU Admission
    Cancer |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,231         76 |    40,307 
           |     79.90      80.85 |     79.90 
-----------+----------------------+----------
         1 |    10,119         18 |    10,137 
           |     20.10      19.15 |     20.10 
-----------+----------------------+----------
     Total |    50,350         94 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |
     liver | outcome ICU Admission
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,312         78 |    40,390 
           |     80.06      82.98 |     80.07 
-----------+----------------------+----------
         1 |    10,038         16 |    10,054 
           |     19.94      17.02 |     19.93 
-----------+----------------------+----------
     Total |    50,350         94 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           | outcome ICU Admission
    Stroke |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,283         77 |    40,360 
           |     80.01      81.91 |     80.01 
-----------+----------------------+----------
         1 |    10,067         17 |    10,084 
           |     19.99      18.09 |     19.99 
-----------+----------------------+----------
     Total |    50,350         94 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           | outcome ICU Admission
  Dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,363         75 |    40,438 
           |     80.16      79.79 |     80.16 
-----------+----------------------+----------
         1 |     9,987         19 |    10,006 
           |     19.84      20.21 |     19.84 
-----------+----------------------+----------
     Total |    50,350         94 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Neurologic | outcome ICU Admission
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,357         78 |    40,435 
           |     80.15      82.98 |     80.16 
-----------+----------------------+----------
         1 |     9,993         16 |    10,009 
           |     19.85      17.02 |     19.84 
-----------+----------------------+----------
     Total |    50,350         94 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

       Reduced kidney | outcome ICU Admission
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |    49,779         93 |    49,872 
                      |     98.87      98.94 |     98.87 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |       571          1 |       572 
                      |      1.13       1.06 |      1.13 
----------------------+----------------------+----------
                Total |    50,350         94 |    50,444 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Autoimmune | outcome ICU Admission
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    40,295         75 |    40,370 
           |     80.03      79.79 |     80.03 
-----------+----------------------+----------
         1 |    10,055         19 |    10,074 
           |     19.97      20.21 |     19.97 
-----------+----------------------+----------
     Total |    50,350         94 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        Index of |
        Multiple |
     Deprivation | outcome ICU Admission
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |    35,230         67 |    35,297 
                 |     69.97      71.28 |     69.97 
-----------------+----------------------+----------
               4 |    10,064         18 |    10,082 
                 |     19.99      19.15 |     19.99 
-----------------+----------------------+----------
 5 most deprived |     5,056          9 |     5,065 
                 |     10.04       9.57 |     10.04 
-----------------+----------------------+----------
           Total |    50,350         94 |    50,444 
                 |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Rural-Urba |
         n | outcome ICU Admission
 Indicator |         0          1 |     Total
-----------+----------------------+----------
     rural |     5,073         15 |     5,088 
           |     10.08      15.96 |     10.09 
-----------+----------------------+----------
     urban |    45,277         79 |    45,356 
           |     89.92      84.04 |     89.91 
-----------+----------------------+----------
     Total |    50,350         94 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      | outcome ICU Admission
    Region of England |         0          1 |     Total
----------------------+----------------------+----------
        East Midlands |     5,039         13 |     5,052 
                      |     10.01      13.83 |     10.02 
----------------------+----------------------+----------
      East of England |     4,976          7 |     4,983 
                      |      9.88       7.45 |      9.88 
----------------------+----------------------+----------
               London |    10,067         19 |    10,086 
                      |     19.99      20.21 |     19.99 
----------------------+----------------------+----------
           North East |     5,006         10 |     5,016 
                      |      9.94      10.64 |      9.94 
----------------------+----------------------+----------
           North West |     5,066         10 |     5,076 
                      |     10.06      10.64 |     10.06 
----------------------+----------------------+----------
           South East |    10,138         16 |    10,154 
                      |     20.14      17.02 |     20.13 
----------------------+----------------------+----------
        West Midlands |     4,994         10 |     5,004 
                      |      9.92      10.64 |      9.92 
----------------------+----------------------+----------
Yorkshire and the H.. |     5,064          9 |     5,073 
                      |     10.06       9.57 |     10.06 
----------------------+----------------------+----------
                Total |    50,350         94 |    50,444 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome suspected
   Grouped |         case
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     7,898      1,954 |     9,852 
           |     19.54      19.48 |     19.53 
-----------+----------------------+----------
    30-<40 |     6,771      1,663 |     8,434 
           |     16.76      16.58 |     16.72 
-----------+----------------------+----------
    40-<50 |     6,425      1,656 |     8,081 
           |     15.90      16.51 |     16.02 
-----------+----------------------+----------
    50-<60 |     6,980      1,728 |     8,708 
           |     17.27      17.22 |     17.26 
-----------+----------------------+----------
    60-<70 |     5,566      1,363 |     6,929 
           |     13.77      13.59 |     13.74 
-----------+----------------------+----------
    70-<80 |     4,254      1,000 |     5,254 
           |     10.53       9.97 |     10.42 
-----------+----------------------+----------
       80+ |     2,517        669 |     3,186 
           |      6.23       6.67 |      6.32 
-----------+----------------------+----------
     Total |    40,411     10,033 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome suspected
           |         case
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    20,935      5,034 |    25,969 
           |     51.81      50.17 |     51.48 
-----------+----------------------+----------
         1 |    19,476      4,999 |    24,475 
           |     48.19      49.83 |     48.52 
-----------+----------------------+----------
     Total |    40,411     10,033 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   outcome suspected
                      |         case
     Eth 5 categories |         0          1 |     Total
----------------------+----------------------+----------
                White |    24,192      5,981 |    30,173 
                      |     59.86      59.61 |     59.81 
----------------------+----------------------+----------
Asian or Asian Britis |     3,106        773 |     3,879 
                      |      7.69       7.70 |      7.69 
----------------------+----------------------+----------
                Other |     3,029        726 |     3,755 
                      |      7.50       7.24 |      7.44 
----------------------+----------------------+----------
                    . |    10,084      2,553 |    12,637 
                      |     24.95      25.45 |     25.05 
----------------------+----------------------+----------
                Total |    40,411     10,033 |    50,444 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   outcome suspected
                      |         case
    Eth 16 categories |         0          1 |     Total
----------------------+----------------------+----------
British or Mixed Brit |    11,417      2,794 |    14,211 
                      |     28.25      27.85 |     28.17 
----------------------+----------------------+----------
                Irish |     2,327        568 |     2,895 
                      |      5.76       5.66 |      5.74 
----------------------+----------------------+----------
          Other White |     1,123        267 |     1,390 
                      |      2.78       2.66 |      2.76 
----------------------+----------------------+----------
White + Black Caribbe |     1,130        266 |     1,396 
                      |      2.80       2.65 |      2.77 
----------------------+----------------------+----------
White + Black African |     1,108        257 |     1,365 
                      |      2.74       2.56 |      2.71 
----------------------+----------------------+----------
        White + Asian |     1,168        324 |     1,492 
                      |      2.89       3.23 |      2.96 
----------------------+----------------------+----------
          Other mixed |     1,112        301 |     1,413 
                      |      2.75       3.00 |      2.80 
----------------------+----------------------+----------
Indian or British Ind |     1,097        274 |     1,371 
                      |      2.71       2.73 |      2.72 
----------------------+----------------------+----------
Pakistani or British  |       455        101 |       556 
                      |      1.13       1.01 |      1.10 
----------------------+----------------------+----------
Bangladeshi or Britis |       437        120 |       557 
                      |      1.08       1.20 |      1.10 
----------------------+----------------------+----------
          Other Asian |       232         59 |       291 
                      |      0.57       0.59 |      0.58 
----------------------+----------------------+----------
            Caribbean |       225         58 |       283 
                      |      0.56       0.58 |      0.56 
----------------------+----------------------+----------
              African |       220         43 |       263 
                      |      0.54       0.43 |      0.52 
----------------------+----------------------+----------
          Other Black |       230         52 |       282 
                      |      0.57       0.52 |      0.56 
----------------------+----------------------+----------
              Chinese |       234         49 |       283 
                      |      0.58       0.49 |      0.56 
----------------------+----------------------+----------
                Other |       238         61 |       299 
                      |      0.59       0.61 |      0.59 
----------------------+----------------------+----------
                    . |    17,658      4,439 |    22,097 
                      |     43.70      44.24 |     43.81 
----------------------+----------------------+----------
                Total |    40,411     10,033 |    50,444 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   outcome suspected
                     |         case
                 BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |       252         56 |       308 
                     |      0.62       0.56 |      0.61 
---------------------+----------------------+----------
  Normal (18.5-24.9) |       810        199 |     1,009 
                     |      2.00       1.98 |      2.00 
---------------------+----------------------+----------
Overweight (25-29.9) |     1,116        306 |     1,422 
                     |      2.76       3.05 |      2.82 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,479        382 |     1,861 
                     |      3.66       3.81 |      3.69 
---------------------+----------------------+----------
  Obese II (35-39.9) |     1,439        366 |     1,805 
                     |      3.56       3.65 |      3.58 
---------------------+----------------------+----------
     Obese III (40+) |     1,787        433 |     2,220 
                     |      4.42       4.32 |      4.40 
---------------------+----------------------+----------
        Unknown (.u) |    33,528      8,291 |    41,819 
                     |     82.97      82.64 |     82.90 
---------------------+----------------------+----------
               Total |    40,411     10,033 |    50,444 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   outcome suspected
          Obesity (4 |         case
         categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |    35,706      8,852 |    44,558 
                     |     88.36      88.23 |     88.33 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,479        382 |     1,861 
                     |      3.66       3.81 |      3.69 
---------------------+----------------------+----------
  Obese II (35-39.9) |     1,439        366 |     1,805 
                     |      3.56       3.65 |      3.58 
---------------------+----------------------+----------
     Obese III (40+) |     1,787        433 |     2,220 
                     |      4.42       4.32 |      4.40 
---------------------+----------------------+----------
               Total |    40,411     10,033 |    50,444 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  BMI with |   outcome suspected
        SA |         case
categories |         0          1 |     Total
-----------+----------------------+----------
         1 |       252         56 |       308 
           |      0.62       0.56 |      0.61 
-----------+----------------------+----------
         2 |       783        195 |       978 
           |      1.94       1.94 |      1.94 
-----------+----------------------+----------
         3 |     1,105        296 |     1,401 
           |      2.73       2.95 |      2.78 
-----------+----------------------+----------
         4 |     1,517        396 |     1,913 
           |      3.75       3.95 |      3.79 
-----------+----------------------+----------
         5 |     1,439        366 |     1,805 
           |      3.56       3.65 |      3.58 
-----------+----------------------+----------
         6 |     1,787        433 |     2,220 
           |      4.42       4.32 |      4.40 
-----------+----------------------+----------
        .u |    33,528      8,291 |    41,819 
           |     82.97      82.64 |     82.90 
-----------+----------------------+----------
     Total |    40,411     10,033 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   outcome suspected
      Obesity with SA |         case
           categories |         0          1 |     Total
----------------------+----------------------+----------
 No record of obesity |    35,668      8,838 |    44,506 
                      |     88.26      88.09 |     88.23 
----------------------+----------------------+----------
Obese I (30-34.9 / 27 |     1,517        396 |     1,913 
                      |      3.75       3.95 |      3.79 
----------------------+----------------------+----------
   Obese II (35-39.9) |     1,439        366 |     1,805 
                      |      3.56       3.65 |      3.58 
----------------------+----------------------+----------
      Obese III (40+) |     1,787        433 |     2,220 
                      |      4.42       4.32 |      4.40 
----------------------+----------------------+----------
                Total |    40,411     10,033 |    50,444 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   outcome suspected
     Smoking |         case
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |     1,640        390 |     2,030 
             |      4.06       3.89 |      4.02 
-------------+----------------------+----------
      Former |       769        223 |       992 
             |      1.90       2.22 |      1.97 
-------------+----------------------+----------
     Current |     4,809      1,186 |     5,995 
             |     11.90      11.82 |     11.88 
-------------+----------------------+----------
Unknown (.u) |    33,193      8,234 |    41,427 
             |     82.14      82.07 |     82.12 
-------------+----------------------+----------
       Total |    40,411     10,033 |    50,444 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |   outcome suspected
Respirator |         case
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,281      8,065 |    40,346 
           |     79.88      80.38 |     79.98 
-----------+----------------------+----------
         1 |     8,130      1,968 |    10,098 
           |     20.12      19.62 |     20.02 
-----------+----------------------+----------
     Total |    40,411     10,033 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome suspected
    Asthma |         case
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,355      8,000 |    40,355 
           |     80.06      79.74 |     80.00 
-----------+----------------------+----------
         1 |     8,056      2,033 |    10,089 
           |     19.94      20.26 |     20.00 
-----------+----------------------+----------
     Total |    40,411     10,033 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

      Asthma |   outcome suspected
    detailed |         case
  categories |         0          1 |     Total
-------------+----------------------+----------
          No |    32,355      8,000 |    40,355 
             |     80.06      79.74 |     80.00 
-------------+----------------------+----------
 Yes, no OCS |     8,056      2,033 |    10,089 
             |     19.94      20.26 |     20.00 
-------------+----------------------+----------
       Total |    40,411     10,033 |    50,444 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |   outcome suspected
   Cardiac |         case
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,398      8,015 |    40,413 
           |     80.17      79.89 |     80.11 
-----------+----------------------+----------
         1 |     8,013      2,018 |    10,031 
           |     19.83      20.11 |     19.89 
-----------+----------------------+----------
     Total |    40,411     10,033 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome suspected
  Diabetes |         case
   by type |         0          1 |     Total
-----------+----------------------+----------
     NO_DM |    30,418      7,469 |    37,887 
           |     75.27      74.44 |     75.11 
-----------+----------------------+----------
      T1DM |     1,198        298 |     1,496 
           |      2.96       2.97 |      2.97 
-----------+----------------------+----------
      T2DM |     7,969      2,048 |    10,017 
           |     19.72      20.41 |     19.86 
-----------+----------------------+----------
UNKNOWN_DM |       826        218 |     1,044 
           |      2.04       2.17 |      2.07 
-----------+----------------------+----------
     Total |    40,411     10,033 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Diabetes |   outcome suspected
    exeter |         case
      type |         0          1 |     Total
-----------+----------------------+----------
     NO_DM |    31,044      7,765 |    38,809 
           |     76.82      77.39 |     76.93 
-----------+----------------------+----------
T1DM_EX_OS |     1,192        316 |     1,508 
           |      2.95       3.15 |      2.99 
-----------+----------------------+----------
T2DM_EX_OS |     8,175      1,952 |    10,127 
           |     20.23      19.46 |     20.08 
-----------+----------------------+----------
     Total |    40,411     10,033 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome suspected
           |         case
    Cancer |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,300      8,007 |    40,307 
           |     79.93      79.81 |     79.90 
-----------+----------------------+----------
         1 |     8,111      2,026 |    10,137 
           |     20.07      20.19 |     20.10 
-----------+----------------------+----------
     Total |    40,411     10,033 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |   outcome suspected
     liver |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,350      8,040 |    40,390 
           |     80.05      80.14 |     80.07 
-----------+----------------------+----------
         1 |     8,061      1,993 |    10,054 
           |     19.95      19.86 |     19.93 
-----------+----------------------+----------
     Total |    40,411     10,033 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome suspected
           |         case
    Stroke |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,348      8,012 |    40,360 
           |     80.05      79.86 |     80.01 
-----------+----------------------+----------
         1 |     8,063      2,021 |    10,084 
           |     19.95      20.14 |     19.99 
-----------+----------------------+----------
     Total |    40,411     10,033 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome suspected
           |         case
  Dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,472      7,966 |    40,438 
           |     80.35      79.40 |     80.16 
-----------+----------------------+----------
         1 |     7,939      2,067 |    10,006 
           |     19.65      20.60 |     19.84 
-----------+----------------------+----------
     Total |    40,411     10,033 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome suspected
Neurologic |         case
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,442      7,993 |    40,435 
           |     80.28      79.67 |     80.16 
-----------+----------------------+----------
         1 |     7,969      2,040 |    10,009 
           |     19.72      20.33 |     19.84 
-----------+----------------------+----------
     Total |    40,411     10,033 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   outcome suspected
       Reduced kidney |         case
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |    39,940      9,932 |    49,872 
                      |     98.83      98.99 |     98.87 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |       471        101 |       572 
                      |      1.17       1.01 |      1.13 
----------------------+----------------------+----------
                Total |    40,411     10,033 |    50,444 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome suspected
Autoimmune |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,379      7,991 |    40,370 
           |     80.12      79.65 |     80.03 
-----------+----------------------+----------
         1 |     8,032      2,042 |    10,074 
           |     19.88      20.35 |     19.97 
-----------+----------------------+----------
     Total |    40,411     10,033 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        Index of |
        Multiple |   outcome suspected
     Deprivation |         case
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |    28,345      6,952 |    35,297 
                 |     70.14      69.29 |     69.97 
-----------------+----------------------+----------
               4 |     8,035      2,047 |    10,082 
                 |     19.88      20.40 |     19.99 
-----------------+----------------------+----------
 5 most deprived |     4,031      1,034 |     5,065 
                 |      9.98      10.31 |     10.04 
-----------------+----------------------+----------
           Total |    40,411     10,033 |    50,444 
                 |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Rural-Urba |   outcome suspected
         n |         case
 Indicator |         0          1 |     Total
-----------+----------------------+----------
     rural |     4,103        985 |     5,088 
           |     10.15       9.82 |     10.09 
-----------+----------------------+----------
     urban |    36,308      9,048 |    45,356 
           |     89.85      90.18 |     89.91 
-----------+----------------------+----------
     Total |    40,411     10,033 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   outcome suspected
                      |         case
    Region of England |         0          1 |     Total
----------------------+----------------------+----------
        East Midlands |     4,031      1,021 |     5,052 
                      |      9.98      10.18 |     10.02 
----------------------+----------------------+----------
      East of England |     3,976      1,007 |     4,983 
                      |      9.84      10.04 |      9.88 
----------------------+----------------------+----------
               London |     8,130      1,956 |    10,086 
                      |     20.12      19.50 |     19.99 
----------------------+----------------------+----------
           North East |     4,023        993 |     5,016 
                      |      9.96       9.90 |      9.94 
----------------------+----------------------+----------
           North West |     4,057      1,019 |     5,076 
                      |     10.04      10.16 |     10.06 
----------------------+----------------------+----------
           South East |     8,133      2,021 |    10,154 
                      |     20.13      20.14 |     20.13 
----------------------+----------------------+----------
        West Midlands |     3,985      1,019 |     5,004 
                      |      9.86      10.16 |      9.92 
----------------------+----------------------+----------
Yorkshire and the H.. |     4,076        997 |     5,073 
                      |     10.09       9.94 |     10.06 
----------------------+----------------------+----------
                Total |    40,411     10,033 |    50,444 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome confirmed
   Grouped |         case
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     7,816      2,036 |     9,852 
           |     19.39      20.07 |     19.53 
-----------+----------------------+----------
    30-<40 |     6,800      1,634 |     8,434 
           |     16.87      16.11 |     16.72 
-----------+----------------------+----------
    40-<50 |     6,329      1,752 |     8,081 
           |     15.70      17.27 |     16.02 
-----------+----------------------+----------
    50-<60 |     7,019      1,689 |     8,708 
           |     17.42      16.65 |     17.26 
-----------+----------------------+----------
    60-<70 |     5,561      1,368 |     6,929 
           |     13.80      13.49 |     13.74 
-----------+----------------------+----------
    70-<80 |     4,238      1,016 |     5,254 
           |     10.52      10.02 |     10.42 
-----------+----------------------+----------
       80+ |     2,538        648 |     3,186 
           |      6.30       6.39 |      6.32 
-----------+----------------------+----------
     Total |    40,301     10,143 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome confirmed
           |         case
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    20,725      5,244 |    25,969 
           |     51.43      51.70 |     51.48 
-----------+----------------------+----------
         1 |    19,576      4,899 |    24,475 
           |     48.57      48.30 |     48.52 
-----------+----------------------+----------
     Total |    40,301     10,143 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   outcome confirmed
                      |         case
     Eth 5 categories |         0          1 |     Total
----------------------+----------------------+----------
                White |    24,104      6,069 |    30,173 
                      |     59.81      59.83 |     59.81 
----------------------+----------------------+----------
Asian or Asian Britis |     3,099        780 |     3,879 
                      |      7.69       7.69 |      7.69 
----------------------+----------------------+----------
                Other |     2,989        766 |     3,755 
                      |      7.42       7.55 |      7.44 
----------------------+----------------------+----------
                    . |    10,109      2,528 |    12,637 
                      |     25.08      24.92 |     25.05 
----------------------+----------------------+----------
                Total |    40,301     10,143 |    50,444 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   outcome confirmed
                      |         case
    Eth 16 categories |         0          1 |     Total
----------------------+----------------------+----------
British or Mixed Brit |    11,325      2,886 |    14,211 
                      |     28.10      28.45 |     28.17 
----------------------+----------------------+----------
                Irish |     2,294        601 |     2,895 
                      |      5.69       5.93 |      5.74 
----------------------+----------------------+----------
          Other White |     1,106        284 |     1,390 
                      |      2.74       2.80 |      2.76 
----------------------+----------------------+----------
White + Black Caribbe |     1,097        299 |     1,396 
                      |      2.72       2.95 |      2.77 
----------------------+----------------------+----------
White + Black African |     1,095        270 |     1,365 
                      |      2.72       2.66 |      2.71 
----------------------+----------------------+----------
        White + Asian |     1,180        312 |     1,492 
                      |      2.93       3.08 |      2.96 
----------------------+----------------------+----------
          Other mixed |     1,137        276 |     1,413 
                      |      2.82       2.72 |      2.80 
----------------------+----------------------+----------
Indian or British Ind |     1,116        255 |     1,371 
                      |      2.77       2.51 |      2.72 
----------------------+----------------------+----------
Pakistani or British  |       439        117 |       556 
                      |      1.09       1.15 |      1.10 
----------------------+----------------------+----------
Bangladeshi or Britis |       431        126 |       557 
                      |      1.07       1.24 |      1.10 
----------------------+----------------------+----------
          Other Asian |       231         60 |       291 
                      |      0.57       0.59 |      0.58 
----------------------+----------------------+----------
            Caribbean |       242         41 |       283 
                      |      0.60       0.40 |      0.56 
----------------------+----------------------+----------
              African |       211         52 |       263 
                      |      0.52       0.51 |      0.52 
----------------------+----------------------+----------
          Other Black |       246         36 |       282 
                      |      0.61       0.35 |      0.56 
----------------------+----------------------+----------
              Chinese |       223         60 |       283 
                      |      0.55       0.59 |      0.56 
----------------------+----------------------+----------
                Other |       243         56 |       299 
                      |      0.60       0.55 |      0.59 
----------------------+----------------------+----------
                    . |    17,685      4,412 |    22,097 
                      |     43.88      43.50 |     43.81 
----------------------+----------------------+----------
                Total |    40,301     10,143 |    50,444 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   outcome confirmed
                     |         case
                 BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |       254         54 |       308 
                     |      0.63       0.53 |      0.61 
---------------------+----------------------+----------
  Normal (18.5-24.9) |       805        204 |     1,009 
                     |      2.00       2.01 |      2.00 
---------------------+----------------------+----------
Overweight (25-29.9) |     1,125        297 |     1,422 
                     |      2.79       2.93 |      2.82 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,504        357 |     1,861 
                     |      3.73       3.52 |      3.69 
---------------------+----------------------+----------
  Obese II (35-39.9) |     1,432        373 |     1,805 
                     |      3.55       3.68 |      3.58 
---------------------+----------------------+----------
     Obese III (40+) |     1,758        462 |     2,220 
                     |      4.36       4.55 |      4.40 
---------------------+----------------------+----------
        Unknown (.u) |    33,423      8,396 |    41,819 
                     |     82.93      82.78 |     82.90 
---------------------+----------------------+----------
               Total |    40,301     10,143 |    50,444 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   outcome confirmed
          Obesity (4 |         case
         categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |    35,607      8,951 |    44,558 
                     |     88.35      88.25 |     88.33 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,504        357 |     1,861 
                     |      3.73       3.52 |      3.69 
---------------------+----------------------+----------
  Obese II (35-39.9) |     1,432        373 |     1,805 
                     |      3.55       3.68 |      3.58 
---------------------+----------------------+----------
     Obese III (40+) |     1,758        462 |     2,220 
                     |      4.36       4.55 |      4.40 
---------------------+----------------------+----------
               Total |    40,301     10,143 |    50,444 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  BMI with |   outcome confirmed
        SA |         case
categories |         0          1 |     Total
-----------+----------------------+----------
         1 |       254         54 |       308 
           |      0.63       0.53 |      0.61 
-----------+----------------------+----------
         2 |       780        198 |       978 
           |      1.94       1.95 |      1.94 
-----------+----------------------+----------
         3 |     1,113        288 |     1,401 
           |      2.76       2.84 |      2.78 
-----------+----------------------+----------
         4 |     1,541        372 |     1,913 
           |      3.82       3.67 |      3.79 
-----------+----------------------+----------
         5 |     1,432        373 |     1,805 
           |      3.55       3.68 |      3.58 
-----------+----------------------+----------
         6 |     1,758        462 |     2,220 
           |      4.36       4.55 |      4.40 
-----------+----------------------+----------
        .u |    33,423      8,396 |    41,819 
           |     82.93      82.78 |     82.90 
-----------+----------------------+----------
     Total |    40,301     10,143 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   outcome confirmed
      Obesity with SA |         case
           categories |         0          1 |     Total
----------------------+----------------------+----------
 No record of obesity |    35,570      8,936 |    44,506 
                      |     88.26      88.10 |     88.23 
----------------------+----------------------+----------
Obese I (30-34.9 / 27 |     1,541        372 |     1,913 
                      |      3.82       3.67 |      3.79 
----------------------+----------------------+----------
   Obese II (35-39.9) |     1,432        373 |     1,805 
                      |      3.55       3.68 |      3.58 
----------------------+----------------------+----------
      Obese III (40+) |     1,758        462 |     2,220 
                      |      4.36       4.55 |      4.40 
----------------------+----------------------+----------
                Total |    40,301     10,143 |    50,444 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   outcome confirmed
     Smoking |         case
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |     1,607        423 |     2,030 
             |      3.99       4.17 |      4.02 
-------------+----------------------+----------
      Former |       783        209 |       992 
             |      1.94       2.06 |      1.97 
-------------+----------------------+----------
     Current |     4,751      1,244 |     5,995 
             |     11.79      12.26 |     11.88 
-------------+----------------------+----------
Unknown (.u) |    33,160      8,267 |    41,427 
             |     82.28      81.50 |     82.12 
-------------+----------------------+----------
       Total |    40,301     10,143 |    50,444 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |   outcome confirmed
Respirator |         case
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,236      8,110 |    40,346 
           |     79.99      79.96 |     79.98 
-----------+----------------------+----------
         1 |     8,065      2,033 |    10,098 
           |     20.01      20.04 |     20.02 
-----------+----------------------+----------
     Total |    40,301     10,143 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome confirmed
    Asthma |         case
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,201      8,154 |    40,355 
           |     79.90      80.39 |     80.00 
-----------+----------------------+----------
         1 |     8,100      1,989 |    10,089 
           |     20.10      19.61 |     20.00 
-----------+----------------------+----------
     Total |    40,301     10,143 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

      Asthma |   outcome confirmed
    detailed |         case
  categories |         0          1 |     Total
-------------+----------------------+----------
          No |    32,201      8,154 |    40,355 
             |     79.90      80.39 |     80.00 
-------------+----------------------+----------
 Yes, no OCS |     8,100      1,989 |    10,089 
             |     20.10      19.61 |     20.00 
-------------+----------------------+----------
       Total |    40,301     10,143 |    50,444 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |   outcome confirmed
   Cardiac |         case
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,315      8,098 |    40,413 
           |     80.18      79.84 |     80.11 
-----------+----------------------+----------
         1 |     7,986      2,045 |    10,031 
           |     19.82      20.16 |     19.89 
-----------+----------------------+----------
     Total |    40,301     10,143 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome confirmed
  Diabetes |         case
   by type |         0          1 |     Total
-----------+----------------------+----------
     NO_DM |    30,235      7,652 |    37,887 
           |     75.02      75.44 |     75.11 
-----------+----------------------+----------
      T1DM |     1,206        290 |     1,496 
           |      2.99       2.86 |      2.97 
-----------+----------------------+----------
      T2DM |     8,033      1,984 |    10,017 
           |     19.93      19.56 |     19.86 
-----------+----------------------+----------
UNKNOWN_DM |       827        217 |     1,044 
           |      2.05       2.14 |      2.07 
-----------+----------------------+----------
     Total |    40,301     10,143 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Diabetes |   outcome confirmed
    exeter |         case
      type |         0          1 |     Total
-----------+----------------------+----------
     NO_DM |    31,083      7,726 |    38,809 
           |     77.13      76.17 |     76.93 
-----------+----------------------+----------
T1DM_EX_OS |     1,189        319 |     1,508 
           |      2.95       3.15 |      2.99 
-----------+----------------------+----------
T2DM_EX_OS |     8,029      2,098 |    10,127 
           |     19.92      20.68 |     20.08 
-----------+----------------------+----------
     Total |    40,301     10,143 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome confirmed
           |         case
    Cancer |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,220      8,087 |    40,307 
           |     79.95      79.73 |     79.90 
-----------+----------------------+----------
         1 |     8,081      2,056 |    10,137 
           |     20.05      20.27 |     20.10 
-----------+----------------------+----------
     Total |    40,301     10,143 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |   outcome confirmed
     liver |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,280      8,110 |    40,390 
           |     80.10      79.96 |     80.07 
-----------+----------------------+----------
         1 |     8,021      2,033 |    10,054 
           |     19.90      20.04 |     19.93 
-----------+----------------------+----------
     Total |    40,301     10,143 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome confirmed
           |         case
    Stroke |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,249      8,111 |    40,360 
           |     80.02      79.97 |     80.01 
-----------+----------------------+----------
         1 |     8,052      2,032 |    10,084 
           |     19.98      20.03 |     19.99 
-----------+----------------------+----------
     Total |    40,301     10,143 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome confirmed
           |         case
  Dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,292      8,146 |    40,438 
           |     80.13      80.31 |     80.16 
-----------+----------------------+----------
         1 |     8,009      1,997 |    10,006 
           |     19.87      19.69 |     19.84 
-----------+----------------------+----------
     Total |    40,301     10,143 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome confirmed
Neurologic |         case
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,312      8,123 |    40,435 
           |     80.18      80.08 |     80.16 
-----------+----------------------+----------
         1 |     7,989      2,020 |    10,009 
           |     19.82      19.92 |     19.84 
-----------+----------------------+----------
     Total |    40,301     10,143 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   outcome confirmed
       Reduced kidney |         case
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |    39,851     10,021 |    49,872 
                      |     98.88      98.80 |     98.87 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |       450        122 |       572 
                      |      1.12       1.20 |      1.13 
----------------------+----------------------+----------
                Total |    40,301     10,143 |    50,444 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome confirmed
Autoimmune |         case
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,254      8,116 |    40,370 
           |     80.03      80.02 |     80.03 
-----------+----------------------+----------
         1 |     8,047      2,027 |    10,074 
           |     19.97      19.98 |     19.97 
-----------+----------------------+----------
     Total |    40,301     10,143 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        Index of |
        Multiple |   outcome confirmed
     Deprivation |         case
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |    28,195      7,102 |    35,297 
                 |     69.96      70.02 |     69.97 
-----------------+----------------------+----------
               4 |     8,027      2,055 |    10,082 
                 |     19.92      20.26 |     19.99 
-----------------+----------------------+----------
 5 most deprived |     4,079        986 |     5,065 
                 |     10.12       9.72 |     10.04 
-----------------+----------------------+----------
           Total |    40,301     10,143 |    50,444 
                 |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Rural-Urba |   outcome confirmed
         n |         case
 Indicator |         0          1 |     Total
-----------+----------------------+----------
     rural |     4,050      1,038 |     5,088 
           |     10.05      10.23 |     10.09 
-----------+----------------------+----------
     urban |    36,251      9,105 |    45,356 
           |     89.95      89.77 |     89.91 
-----------+----------------------+----------
     Total |    40,301     10,143 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   outcome confirmed
                      |         case
    Region of England |         0          1 |     Total
----------------------+----------------------+----------
        East Midlands |     4,017      1,035 |     5,052 
                      |      9.97      10.20 |     10.02 
----------------------+----------------------+----------
      East of England |     3,991        992 |     4,983 
                      |      9.90       9.78 |      9.88 
----------------------+----------------------+----------
               London |     7,987      2,099 |    10,086 
                      |     19.82      20.69 |     19.99 
----------------------+----------------------+----------
           North East |     4,012      1,004 |     5,016 
                      |      9.96       9.90 |      9.94 
----------------------+----------------------+----------
           North West |     4,078        998 |     5,076 
                      |     10.12       9.84 |     10.06 
----------------------+----------------------+----------
           South East |     8,142      2,012 |    10,154 
                      |     20.20      19.84 |     20.13 
----------------------+----------------------+----------
        West Midlands |     3,971      1,033 |     5,004 
                      |      9.85      10.18 |      9.92 
----------------------+----------------------+----------
Yorkshire and the H.. |     4,103        970 |     5,073 
                      |     10.18       9.56 |     10.06 
----------------------+----------------------+----------
                Total |    40,301     10,143 |    50,444 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome SGSS test
   Grouped |       performed
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     7,837      2,015 |     9,852 
           |     19.46      19.83 |     19.53 
-----------+----------------------+----------
    30-<40 |     6,724      1,710 |     8,434 
           |     16.69      16.83 |     16.72 
-----------+----------------------+----------
    40-<50 |     6,514      1,567 |     8,081 
           |     16.17      15.42 |     16.02 
-----------+----------------------+----------
    50-<60 |     6,933      1,775 |     8,708 
           |     17.21      17.47 |     17.26 
-----------+----------------------+----------
    60-<70 |     5,551      1,378 |     6,929 
           |     13.78      13.56 |     13.74 
-----------+----------------------+----------
    70-<80 |     4,160      1,094 |     5,254 
           |     10.33      10.76 |     10.42 
-----------+----------------------+----------
       80+ |     2,562        624 |     3,186 
           |      6.36       6.14 |      6.32 
-----------+----------------------+----------
     Total |    40,281     10,163 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome SGSS test
           |       performed
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    20,701      5,268 |    25,969 
           |     51.39      51.84 |     51.48 
-----------+----------------------+----------
         1 |    19,580      4,895 |    24,475 
           |     48.61      48.16 |     48.52 
-----------+----------------------+----------
     Total |    40,281     10,163 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   outcome SGSS test
                      |       performed
     Eth 5 categories |         0          1 |     Total
----------------------+----------------------+----------
                White |    24,073      6,100 |    30,173 
                      |     59.76      60.02 |     59.81 
----------------------+----------------------+----------
Asian or Asian Britis |     3,093        786 |     3,879 
                      |      7.68       7.73 |      7.69 
----------------------+----------------------+----------
                Other |     3,009        746 |     3,755 
                      |      7.47       7.34 |      7.44 
----------------------+----------------------+----------
                    . |    10,106      2,531 |    12,637 
                      |     25.09      24.90 |     25.05 
----------------------+----------------------+----------
                Total |    40,281     10,163 |    50,444 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   outcome SGSS test
                      |       performed
    Eth 16 categories |         0          1 |     Total
----------------------+----------------------+----------
British or Mixed Brit |    11,343      2,868 |    14,211 
                      |     28.16      28.22 |     28.17 
----------------------+----------------------+----------
                Irish |     2,312        583 |     2,895 
                      |      5.74       5.74 |      5.74 
----------------------+----------------------+----------
          Other White |     1,100        290 |     1,390 
                      |      2.73       2.85 |      2.76 
----------------------+----------------------+----------
White + Black Caribbe |     1,096        300 |     1,396 
                      |      2.72       2.95 |      2.77 
----------------------+----------------------+----------
White + Black African |     1,096        269 |     1,365 
                      |      2.72       2.65 |      2.71 
----------------------+----------------------+----------
        White + Asian |     1,183        309 |     1,492 
                      |      2.94       3.04 |      2.96 
----------------------+----------------------+----------
          Other mixed |     1,120        293 |     1,413 
                      |      2.78       2.88 |      2.80 
----------------------+----------------------+----------
Indian or British Ind |     1,106        265 |     1,371 
                      |      2.75       2.61 |      2.72 
----------------------+----------------------+----------
Pakistani or British  |       450        106 |       556 
                      |      1.12       1.04 |      1.10 
----------------------+----------------------+----------
Bangladeshi or Britis |       431        126 |       557 
                      |      1.07       1.24 |      1.10 
----------------------+----------------------+----------
          Other Asian |       239         52 |       291 
                      |      0.59       0.51 |      0.58 
----------------------+----------------------+----------
            Caribbean |       215         68 |       283 
                      |      0.53       0.67 |      0.56 
----------------------+----------------------+----------
              African |       202         61 |       263 
                      |      0.50       0.60 |      0.52 
----------------------+----------------------+----------
          Other Black |       216         66 |       282 
                      |      0.54       0.65 |      0.56 
----------------------+----------------------+----------
              Chinese |       226         57 |       283 
                      |      0.56       0.56 |      0.56 
----------------------+----------------------+----------
                Other |       248         51 |       299 
                      |      0.62       0.50 |      0.59 
----------------------+----------------------+----------
                    . |    17,698      4,399 |    22,097 
                      |     43.94      43.28 |     43.81 
----------------------+----------------------+----------
                Total |    40,281     10,163 |    50,444 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   outcome SGSS test
                     |       performed
                 BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |       245         63 |       308 
                     |      0.61       0.62 |      0.61 
---------------------+----------------------+----------
  Normal (18.5-24.9) |       820        189 |     1,009 
                     |      2.04       1.86 |      2.00 
---------------------+----------------------+----------
Overweight (25-29.9) |     1,134        288 |     1,422 
                     |      2.82       2.83 |      2.82 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,479        382 |     1,861 
                     |      3.67       3.76 |      3.69 
---------------------+----------------------+----------
  Obese II (35-39.9) |     1,467        338 |     1,805 
                     |      3.64       3.33 |      3.58 
---------------------+----------------------+----------
     Obese III (40+) |     1,777        443 |     2,220 
                     |      4.41       4.36 |      4.40 
---------------------+----------------------+----------
        Unknown (.u) |    33,359      8,460 |    41,819 
                     |     82.82      83.24 |     82.90 
---------------------+----------------------+----------
               Total |    40,281     10,163 |    50,444 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   outcome SGSS test
          Obesity (4 |       performed
         categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |    35,558      9,000 |    44,558 
                     |     88.27      88.56 |     88.33 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,479        382 |     1,861 
                     |      3.67       3.76 |      3.69 
---------------------+----------------------+----------
  Obese II (35-39.9) |     1,467        338 |     1,805 
                     |      3.64       3.33 |      3.58 
---------------------+----------------------+----------
     Obese III (40+) |     1,777        443 |     2,220 
                     |      4.41       4.36 |      4.40 
---------------------+----------------------+----------
               Total |    40,281     10,163 |    50,444 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  BMI with |   outcome SGSS test
        SA |       performed
categories |         0          1 |     Total
-----------+----------------------+----------
         1 |       245         63 |       308 
           |      0.61       0.62 |      0.61 
-----------+----------------------+----------
         2 |       792        186 |       978 
           |      1.97       1.83 |      1.94 
-----------+----------------------+----------
         3 |     1,123        278 |     1,401 
           |      2.79       2.74 |      2.78 
-----------+----------------------+----------
         4 |     1,518        395 |     1,913 
           |      3.77       3.89 |      3.79 
-----------+----------------------+----------
         5 |     1,467        338 |     1,805 
           |      3.64       3.33 |      3.58 
-----------+----------------------+----------
         6 |     1,777        443 |     2,220 
           |      4.41       4.36 |      4.40 
-----------+----------------------+----------
        .u |    33,359      8,460 |    41,819 
           |     82.82      83.24 |     82.90 
-----------+----------------------+----------
     Total |    40,281     10,163 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   outcome SGSS test
      Obesity with SA |       performed
           categories |         0          1 |     Total
----------------------+----------------------+----------
 No record of obesity |    35,519      8,987 |    44,506 
                      |     88.18      88.43 |     88.23 
----------------------+----------------------+----------
Obese I (30-34.9 / 27 |     1,518        395 |     1,913 
                      |      3.77       3.89 |      3.79 
----------------------+----------------------+----------
   Obese II (35-39.9) |     1,467        338 |     1,805 
                      |      3.64       3.33 |      3.58 
----------------------+----------------------+----------
      Obese III (40+) |     1,777        443 |     2,220 
                      |      4.41       4.36 |      4.40 
----------------------+----------------------+----------
                Total |    40,281     10,163 |    50,444 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   outcome SGSS test
     Smoking |       performed
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |     1,614        416 |     2,030 
             |      4.01       4.09 |      4.02 
-------------+----------------------+----------
      Former |       798        194 |       992 
             |      1.98       1.91 |      1.97 
-------------+----------------------+----------
     Current |     4,770      1,225 |     5,995 
             |     11.84      12.05 |     11.88 
-------------+----------------------+----------
Unknown (.u) |    33,099      8,328 |    41,427 
             |     82.17      81.94 |     82.12 
-------------+----------------------+----------
       Total |    40,281     10,163 |    50,444 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |   outcome SGSS test
Respirator |       performed
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,266      8,080 |    40,346 
           |     80.10      79.50 |     79.98 
-----------+----------------------+----------
         1 |     8,015      2,083 |    10,098 
           |     19.90      20.50 |     20.02 
-----------+----------------------+----------
     Total |    40,281     10,163 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome SGSS test
    Asthma |       performed
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,250      8,105 |    40,355 
           |     80.06      79.75 |     80.00 
-----------+----------------------+----------
         1 |     8,031      2,058 |    10,089 
           |     19.94      20.25 |     20.00 
-----------+----------------------+----------
     Total |    40,281     10,163 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

      Asthma |   outcome SGSS test
    detailed |       performed
  categories |         0          1 |     Total
-------------+----------------------+----------
          No |    32,250      8,105 |    40,355 
             |     80.06      79.75 |     80.00 
-------------+----------------------+----------
 Yes, no OCS |     8,031      2,058 |    10,089 
             |     19.94      20.25 |     20.00 
-------------+----------------------+----------
       Total |    40,281     10,163 |    50,444 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |   outcome SGSS test
   Cardiac |       performed
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,266      8,147 |    40,413 
           |     80.10      80.16 |     80.11 
-----------+----------------------+----------
         1 |     8,015      2,016 |    10,031 
           |     19.90      19.84 |     19.89 
-----------+----------------------+----------
     Total |    40,281     10,163 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome SGSS test
  Diabetes |       performed
   by type |         0          1 |     Total
-----------+----------------------+----------
     NO_DM |    30,271      7,616 |    37,887 
           |     75.15      74.94 |     75.11 
-----------+----------------------+----------
      T1DM |     1,188        308 |     1,496 
           |      2.95       3.03 |      2.97 
-----------+----------------------+----------
      T2DM |     7,992      2,025 |    10,017 
           |     19.84      19.93 |     19.86 
-----------+----------------------+----------
UNKNOWN_DM |       830        214 |     1,044 
           |      2.06       2.11 |      2.07 
-----------+----------------------+----------
     Total |    40,281     10,163 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Diabetes |   outcome SGSS test
    exeter |       performed
      type |         0          1 |     Total
-----------+----------------------+----------
     NO_DM |    30,927      7,882 |    38,809 
           |     76.78      77.56 |     76.93 
-----------+----------------------+----------
T1DM_EX_OS |     1,230        278 |     1,508 
           |      3.05       2.74 |      2.99 
-----------+----------------------+----------
T2DM_EX_OS |     8,124      2,003 |    10,127 
           |     20.17      19.71 |     20.08 
-----------+----------------------+----------
     Total |    40,281     10,163 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome SGSS test
           |       performed
    Cancer |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,261      8,046 |    40,307 
           |     80.09      79.17 |     79.90 
-----------+----------------------+----------
         1 |     8,020      2,117 |    10,137 
           |     19.91      20.83 |     20.10 
-----------+----------------------+----------
     Total |    40,281     10,163 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |   outcome SGSS test
     liver |       performed
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,269      8,121 |    40,390 
           |     80.11      79.91 |     80.07 
-----------+----------------------+----------
         1 |     8,012      2,042 |    10,054 
           |     19.89      20.09 |     19.93 
-----------+----------------------+----------
     Total |    40,281     10,163 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome SGSS test
           |       performed
    Stroke |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,217      8,143 |    40,360 
           |     79.98      80.12 |     80.01 
-----------+----------------------+----------
         1 |     8,064      2,020 |    10,084 
           |     20.02      19.88 |     19.99 
-----------+----------------------+----------
     Total |    40,281     10,163 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome SGSS test
           |       performed
  Dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,357      8,081 |    40,438 
           |     80.33      79.51 |     80.16 
-----------+----------------------+----------
         1 |     7,924      2,082 |    10,006 
           |     19.67      20.49 |     19.84 
-----------+----------------------+----------
     Total |    40,281     10,163 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome SGSS test
Neurologic |       performed
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,305      8,130 |    40,435 
           |     80.20      80.00 |     80.16 
-----------+----------------------+----------
         1 |     7,976      2,033 |    10,009 
           |     19.80      20.00 |     19.84 
-----------+----------------------+----------
     Total |    40,281     10,163 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   outcome SGSS test
       Reduced kidney |       performed
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |    39,830     10,042 |    49,872 
                      |     98.88      98.81 |     98.87 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |       451        121 |       572 
                      |      1.12       1.19 |      1.13 
----------------------+----------------------+----------
                Total |    40,281     10,163 |    50,444 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome SGSS test
Autoimmune |       performed
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,256      8,114 |    40,370 
           |     80.08      79.84 |     80.03 
-----------+----------------------+----------
         1 |     8,025      2,049 |    10,074 
           |     19.92      20.16 |     19.97 
-----------+----------------------+----------
     Total |    40,281     10,163 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        Index of |
        Multiple |   outcome SGSS test
     Deprivation |       performed
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |    28,181      7,116 |    35,297 
                 |     69.96      70.02 |     69.97 
-----------------+----------------------+----------
               4 |     8,061      2,021 |    10,082 
                 |     20.01      19.89 |     19.99 
-----------------+----------------------+----------
 5 most deprived |     4,039      1,026 |     5,065 
                 |     10.03      10.10 |     10.04 
-----------------+----------------------+----------
           Total |    40,281     10,163 |    50,444 
                 |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Rural-Urba |   outcome SGSS test
         n |       performed
 Indicator |         0          1 |     Total
-----------+----------------------+----------
     rural |     4,083      1,005 |     5,088 
           |     10.14       9.89 |     10.09 
-----------+----------------------+----------
     urban |    36,198      9,158 |    45,356 
           |     89.86      90.11 |     89.91 
-----------+----------------------+----------
     Total |    40,281     10,163 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   outcome SGSS test
                      |       performed
    Region of England |         0          1 |     Total
----------------------+----------------------+----------
        East Midlands |     4,042      1,010 |     5,052 
                      |     10.03       9.94 |     10.02 
----------------------+----------------------+----------
      East of England |     3,988        995 |     4,983 
                      |      9.90       9.79 |      9.88 
----------------------+----------------------+----------
               London |     8,043      2,043 |    10,086 
                      |     19.97      20.10 |     19.99 
----------------------+----------------------+----------
           North East |     4,024        992 |     5,016 
                      |      9.99       9.76 |      9.94 
----------------------+----------------------+----------
           North West |     4,064      1,012 |     5,076 
                      |     10.09       9.96 |     10.06 
----------------------+----------------------+----------
           South East |     8,099      2,055 |    10,154 
                      |     20.11      20.22 |     20.13 
----------------------+----------------------+----------
        West Midlands |     3,996      1,008 |     5,004 
                      |      9.92       9.92 |      9.92 
----------------------+----------------------+----------
Yorkshire and the H.. |     4,025      1,048 |     5,073 
                      |      9.99      10.31 |     10.06 
----------------------+----------------------+----------
                Total |    40,281     10,163 |    50,444 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome SGSS test
   Grouped |       positive
       age |         0          1 |     Total
-----------+----------------------+----------
    18-<30 |     7,930      1,922 |     9,852 
           |     19.59      19.30 |     19.53 
-----------+----------------------+----------
    30-<40 |     6,815      1,619 |     8,434 
           |     16.83      16.26 |     16.72 
-----------+----------------------+----------
    40-<50 |     6,519      1,562 |     8,081 
           |     16.10      15.69 |     16.02 
-----------+----------------------+----------
    50-<60 |     6,888      1,820 |     8,708 
           |     17.01      18.28 |     17.26 
-----------+----------------------+----------
    60-<70 |     5,587      1,342 |     6,929 
           |     13.80      13.48 |     13.74 
-----------+----------------------+----------
    70-<80 |     4,191      1,063 |     5,254 
           |     10.35      10.68 |     10.42 
-----------+----------------------+----------
       80+ |     2,557        629 |     3,186 
           |      6.32       6.32 |      6.32 
-----------+----------------------+----------
     Total |    40,487      9,957 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome SGSS test
           |       positive
      Male |         0          1 |     Total
-----------+----------------------+----------
         0 |    20,861      5,108 |    25,969 
           |     51.53      51.30 |     51.48 
-----------+----------------------+----------
         1 |    19,626      4,849 |    24,475 
           |     48.47      48.70 |     48.52 
-----------+----------------------+----------
     Total |    40,487      9,957 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   outcome SGSS test
                      |       positive
     Eth 5 categories |         0          1 |     Total
----------------------+----------------------+----------
                White |    24,208      5,965 |    30,173 
                      |     59.79      59.91 |     59.81 
----------------------+----------------------+----------
Asian or Asian Britis |     3,094        785 |     3,879 
                      |      7.64       7.88 |      7.69 
----------------------+----------------------+----------
                Other |     2,998        757 |     3,755 
                      |      7.40       7.60 |      7.44 
----------------------+----------------------+----------
                    . |    10,187      2,450 |    12,637 
                      |     25.16      24.61 |     25.05 
----------------------+----------------------+----------
                Total |    40,487      9,957 |    50,444 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   outcome SGSS test
                      |       positive
    Eth 16 categories |         0          1 |     Total
----------------------+----------------------+----------
British or Mixed Brit |    11,406      2,805 |    14,211 
                      |     28.17      28.17 |     28.17 
----------------------+----------------------+----------
                Irish |     2,355        540 |     2,895 
                      |      5.82       5.42 |      5.74 
----------------------+----------------------+----------
          Other White |     1,136        254 |     1,390 
                      |      2.81       2.55 |      2.76 
----------------------+----------------------+----------
White + Black Caribbe |     1,093        303 |     1,396 
                      |      2.70       3.04 |      2.77 
----------------------+----------------------+----------
White + Black African |     1,102        263 |     1,365 
                      |      2.72       2.64 |      2.71 
----------------------+----------------------+----------
        White + Asian |     1,192        300 |     1,492 
                      |      2.94       3.01 |      2.96 
----------------------+----------------------+----------
          Other mixed |     1,145        268 |     1,413 
                      |      2.83       2.69 |      2.80 
----------------------+----------------------+----------
Indian or British Ind |     1,072        299 |     1,371 
                      |      2.65       3.00 |      2.72 
----------------------+----------------------+----------
Pakistani or British  |       459         97 |       556 
                      |      1.13       0.97 |      1.10 
----------------------+----------------------+----------
Bangladeshi or Britis |       427        130 |       557 
                      |      1.05       1.31 |      1.10 
----------------------+----------------------+----------
          Other Asian |       225         66 |       291 
                      |      0.56       0.66 |      0.58 
----------------------+----------------------+----------
            Caribbean |       223         60 |       283 
                      |      0.55       0.60 |      0.56 
----------------------+----------------------+----------
              African |       195         68 |       263 
                      |      0.48       0.68 |      0.52 
----------------------+----------------------+----------
          Other Black |       236         46 |       282 
                      |      0.58       0.46 |      0.56 
----------------------+----------------------+----------
              Chinese |       219         64 |       283 
                      |      0.54       0.64 |      0.56 
----------------------+----------------------+----------
                Other |       236         63 |       299 
                      |      0.58       0.63 |      0.59 
----------------------+----------------------+----------
                    . |    17,766      4,331 |    22,097 
                      |     43.88      43.50 |     43.81 
----------------------+----------------------+----------
                Total |    40,487      9,957 |    50,444 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   outcome SGSS test
                     |       positive
                 BMI |         0          1 |     Total
---------------------+----------------------+----------
 Underweight (<18.5) |       250         58 |       308 
                     |      0.62       0.58 |      0.61 
---------------------+----------------------+----------
  Normal (18.5-24.9) |       817        192 |     1,009 
                     |      2.02       1.93 |      2.00 
---------------------+----------------------+----------
Overweight (25-29.9) |     1,166        256 |     1,422 
                     |      2.88       2.57 |      2.82 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,497        364 |     1,861 
                     |      3.70       3.66 |      3.69 
---------------------+----------------------+----------
  Obese II (35-39.9) |     1,469        336 |     1,805 
                     |      3.63       3.37 |      3.58 
---------------------+----------------------+----------
     Obese III (40+) |     1,758        462 |     2,220 
                     |      4.34       4.64 |      4.40 
---------------------+----------------------+----------
        Unknown (.u) |    33,530      8,289 |    41,819 
                     |     82.82      83.25 |     82.90 
---------------------+----------------------+----------
               Total |    40,487      9,957 |    50,444 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                     |   outcome SGSS test
          Obesity (4 |       positive
         categories) |         0          1 |     Total
---------------------+----------------------+----------
No record of obesity |    35,763      8,795 |    44,558 
                     |     88.33      88.33 |     88.33 
---------------------+----------------------+----------
   Obese I (30-34.9) |     1,497        364 |     1,861 
                     |      3.70       3.66 |      3.69 
---------------------+----------------------+----------
  Obese II (35-39.9) |     1,469        336 |     1,805 
                     |      3.63       3.37 |      3.58 
---------------------+----------------------+----------
     Obese III (40+) |     1,758        462 |     2,220 
                     |      4.34       4.64 |      4.40 
---------------------+----------------------+----------
               Total |    40,487      9,957 |    50,444 
                     |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  BMI with |   outcome SGSS test
        SA |       positive
categories |         0          1 |     Total
-----------+----------------------+----------
         1 |       250         58 |       308 
           |      0.62       0.58 |      0.61 
-----------+----------------------+----------
         2 |       791        187 |       978 
           |      1.95       1.88 |      1.94 
-----------+----------------------+----------
         3 |     1,148        253 |     1,401 
           |      2.84       2.54 |      2.78 
-----------+----------------------+----------
         4 |     1,541        372 |     1,913 
           |      3.81       3.74 |      3.79 
-----------+----------------------+----------
         5 |     1,469        336 |     1,805 
           |      3.63       3.37 |      3.58 
-----------+----------------------+----------
         6 |     1,758        462 |     2,220 
           |      4.34       4.64 |      4.40 
-----------+----------------------+----------
        .u |    33,530      8,289 |    41,819 
           |     82.82      83.25 |     82.90 
-----------+----------------------+----------
     Total |    40,487      9,957 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   outcome SGSS test
      Obesity with SA |       positive
           categories |         0          1 |     Total
----------------------+----------------------+----------
 No record of obesity |    35,719      8,787 |    44,506 
                      |     88.22      88.25 |     88.23 
----------------------+----------------------+----------
Obese I (30-34.9 / 27 |     1,541        372 |     1,913 
                      |      3.81       3.74 |      3.79 
----------------------+----------------------+----------
   Obese II (35-39.9) |     1,469        336 |     1,805 
                      |      3.63       3.37 |      3.58 
----------------------+----------------------+----------
      Obese III (40+) |     1,758        462 |     2,220 
                      |      4.34       4.64 |      4.40 
----------------------+----------------------+----------
                Total |    40,487      9,957 |    50,444 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

             |   outcome SGSS test
     Smoking |       positive
      status |         0          1 |     Total
-------------+----------------------+----------
       Never |     1,627        403 |     2,030 
             |      4.02       4.05 |      4.02 
-------------+----------------------+----------
      Former |       807        185 |       992 
             |      1.99       1.86 |      1.97 
-------------+----------------------+----------
     Current |     4,785      1,210 |     5,995 
             |     11.82      12.15 |     11.88 
-------------+----------------------+----------
Unknown (.u) |    33,268      8,159 |    41,427 
             |     82.17      81.94 |     82.12 
-------------+----------------------+----------
       Total |    40,487      9,957 |    50,444 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |   outcome SGSS test
Respirator |       positive
y Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,464      7,882 |    40,346 
           |     80.18      79.16 |     79.98 
-----------+----------------------+----------
         1 |     8,023      2,075 |    10,098 
           |     19.82      20.84 |     20.02 
-----------+----------------------+----------
     Total |    40,487      9,957 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome SGSS test
    Asthma |       positive
  category |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,379      7,976 |    40,355 
           |     79.97      80.10 |     80.00 
-----------+----------------------+----------
         1 |     8,108      1,981 |    10,089 
           |     20.03      19.90 |     20.00 
-----------+----------------------+----------
     Total |    40,487      9,957 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

      Asthma |   outcome SGSS test
    detailed |       positive
  categories |         0          1 |     Total
-------------+----------------------+----------
          No |    32,379      7,976 |    40,355 
             |     79.97      80.10 |     80.00 
-------------+----------------------+----------
 Yes, no OCS |     8,108      1,981 |    10,089 
             |     20.03      19.90 |     20.00 
-------------+----------------------+----------
       Total |    40,487      9,957 |    50,444 
             |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |   outcome SGSS test
   Cardiac |       positive
  Diseases |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,394      8,019 |    40,413 
           |     80.01      80.54 |     80.11 
-----------+----------------------+----------
         1 |     8,093      1,938 |    10,031 
           |     19.99      19.46 |     19.89 
-----------+----------------------+----------
     Total |    40,487      9,957 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome SGSS test
  Diabetes |       positive
   by type |         0          1 |     Total
-----------+----------------------+----------
     NO_DM |    30,407      7,480 |    37,887 
           |     75.10      75.12 |     75.11 
-----------+----------------------+----------
      T1DM |     1,188        308 |     1,496 
           |      2.93       3.09 |      2.97 
-----------+----------------------+----------
      T2DM |     8,048      1,969 |    10,017 
           |     19.88      19.78 |     19.86 
-----------+----------------------+----------
UNKNOWN_DM |       844        200 |     1,044 
           |      2.08       2.01 |      2.07 
-----------+----------------------+----------
     Total |    40,487      9,957 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

  Diabetes |   outcome SGSS test
    exeter |       positive
      type |         0          1 |     Total
-----------+----------------------+----------
     NO_DM |    31,187      7,622 |    38,809 
           |     77.03      76.55 |     76.93 
-----------+----------------------+----------
T1DM_EX_OS |     1,210        298 |     1,508 
           |      2.99       2.99 |      2.99 
-----------+----------------------+----------
T2DM_EX_OS |     8,090      2,037 |    10,127 
           |     19.98      20.46 |     20.08 
-----------+----------------------+----------
     Total |    40,487      9,957 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome SGSS test
           |       positive
    Cancer |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,353      7,954 |    40,307 
           |     79.91      79.88 |     79.90 
-----------+----------------------+----------
         1 |     8,134      2,003 |    10,137 
           |     20.09      20.12 |     20.10 
-----------+----------------------+----------
     Total |    40,487      9,957 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

   Chronic |   outcome SGSS test
     liver |       positive
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,391      7,999 |    40,390 
           |     80.00      80.34 |     80.07 
-----------+----------------------+----------
         1 |     8,096      1,958 |    10,054 
           |     20.00      19.66 |     19.93 
-----------+----------------------+----------
     Total |    40,487      9,957 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome SGSS test
           |       positive
    Stroke |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,405      7,955 |    40,360 
           |     80.04      79.89 |     80.01 
-----------+----------------------+----------
         1 |     8,082      2,002 |    10,084 
           |     19.96      20.11 |     19.99 
-----------+----------------------+----------
     Total |    40,487      9,957 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome SGSS test
           |       positive
  Dementia |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,456      7,982 |    40,438 
           |     80.16      80.16 |     80.16 
-----------+----------------------+----------
         1 |     8,031      1,975 |    10,006 
           |     19.84      19.84 |     19.84 
-----------+----------------------+----------
     Total |    40,487      9,957 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome SGSS test
Neurologic |       positive
al disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,440      7,995 |    40,435 
           |     80.12      80.30 |     80.16 
-----------+----------------------+----------
         1 |     8,047      1,962 |    10,009 
           |     19.88      19.70 |     19.84 
-----------+----------------------+----------
     Total |    40,487      9,957 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   outcome SGSS test
       Reduced kidney |       positive
             function |         0          1 |     Total
----------------------+----------------------+----------
                 None |    40,032      9,840 |    49,872 
                      |     98.88      98.82 |     98.87 
----------------------+----------------------+----------
Stage 3a/3b egfr 30-6 |       455        117 |       572 
                      |      1.12       1.18 |      1.13 
----------------------+----------------------+----------
                Total |    40,487      9,957 |    50,444 
                      |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

           |   outcome SGSS test
Autoimmune |       positive
   disease |         0          1 |     Total
-----------+----------------------+----------
         0 |    32,404      7,966 |    40,370 
           |     80.04      80.00 |     80.03 
-----------+----------------------+----------
         1 |     8,083      1,991 |    10,074 
           |     19.96      20.00 |     19.97 
-----------+----------------------+----------
     Total |    40,487      9,957 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

        Index of |
        Multiple |   outcome SGSS test
     Deprivation |       positive
           (IMD) |         0          1 |     Total
-----------------+----------------------+----------
1 least deprived |    28,283      7,014 |    35,297 
                 |     69.86      70.44 |     69.97 
-----------------+----------------------+----------
               4 |     8,147      1,935 |    10,082 
                 |     20.12      19.43 |     19.99 
-----------------+----------------------+----------
 5 most deprived |     4,057      1,008 |     5,065 
                 |     10.02      10.12 |     10.04 
-----------------+----------------------+----------
           Total |    40,487      9,957 |    50,444 
                 |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

Rural-Urba |   outcome SGSS test
         n |       positive
 Indicator |         0          1 |     Total
-----------+----------------------+----------
     rural |     4,064      1,024 |     5,088 
           |     10.04      10.28 |     10.09 
-----------+----------------------+----------
     urban |    36,423      8,933 |    45,356 
           |     89.96      89.72 |     89.91 
-----------+----------------------+----------
     Total |    40,487      9,957 |    50,444 
           |    100.00     100.00 |    100.00 

+-------------------+
| Key               |
|-------------------|
|     frequency     |
| column percentage |
+-------------------+

                      |   outcome SGSS test
                      |       positive
    Region of England |         0          1 |     Total
----------------------+----------------------+----------
        East Midlands |     4,067        985 |     5,052 
                      |     10.05       9.89 |     10.02 
----------------------+----------------------+----------
      East of England |     3,983      1,000 |     4,983 
                      |      9.84      10.04 |      9.88 
----------------------+----------------------+----------
               London |     8,069      2,017 |    10,086 
                      |     19.93      20.26 |     19.99 
----------------------+----------------------+----------
           North East |     4,060        956 |     5,016 
                      |     10.03       9.60 |      9.94 
----------------------+----------------------+----------
           North West |     4,058      1,018 |     5,076 
                      |     10.02      10.22 |     10.06 
----------------------+----------------------+----------
           South East |     8,206      1,948 |    10,154 
                      |     20.27      19.56 |     20.13 
----------------------+----------------------+----------
        West Midlands |     3,988      1,016 |     5,004 
                      |      9.85      10.20 |      9.92 
----------------------+----------------------+----------
Yorkshire and the H.. |     4,056      1,017 |     5,073 
                      |     10.02      10.21 |     10.06 
----------------------+----------------------+----------
                Total |    40,487      9,957 |    50,444 
                      |    100.00     100.00 |    100.00 

. 
. 
. ********************************************
. *  Cumulative incidence of EACH OUTCOME *
. ********************************************
. local p"suspected confirmed tested positivetest ae icu cpnsdeat
> h onsdeath onscoviddeath ons_noncoviddeath" //ventilation

. foreach i of local p {
  2.         use "$Tempdir/analysis_dataset_STSET_`i'.dta", clear
  3.         sts list , at(0 80) by(agegroup male) fail
  4. }

         failure _d:  suspected
   analysis time _t:  (stime_suspected-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

              Beg.                      Failure       Std.
    Time     Total     Fail             Function     Error     [9
> 5% Conf. Int.]
-----------------------------------------------------------------
> --------------
18-<30 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      5102        4              0.0008    0.0004     0.0
> 003    0.0021
18-<30 male=1 
       0         0        0              0.0000         .        
>   .         .
      80      4735        7              0.0015    0.0006     0.0
> 007    0.0031
30-<40 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      4381        3              0.0007    0.0004     0.0
> 002    0.0021
30-<40 male=1 
       0         0        0              0.0000         .        
>   .         .
      80      4039        2              0.0005    0.0003     0.0
> 001    0.0020
40-<50 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      4081        3              0.0007    0.0004     0.0
> 002    0.0023
40-<50 male=1 
       0         0        0              0.0000         .        
>   .         .
      80      3986        1              0.0003    0.0003     0.0
> 000    0.0018
50-<60 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      4426        2              0.0005    0.0003     0.0
> 001    0.0018
50-<60 male=1 
       0         0        0              0.0000         .        
>   .         .
      80      4274        1              0.0002    0.0002     0.0
> 000    0.0017
60-<70 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      3609        2              0.0006    0.0004     0.0
> 001    0.0022
60-<70 male=1 
       0         0        0              0.0000         .        
>   .         .
      80      3309        5              0.0015    0.0007     0.0
> 006    0.0036
70-<80 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      2719        3              0.0011    0.0006     0.0
> 004    0.0034
70-<80 male=1 
       0         0        0              0.0000         .        
>   .         .
      80      2528        3              0.0012    0.0007     0.0
> 004    0.0037
80+ male=0 
       0         0        0              0.0000         .        
>   .         .
      80      1614        0              0.0000         .        
>   .         .
80+ male=1 
       0         0        0              0.0000         .        
>   .         .
      80      1571        1              0.0006    0.0006     0.0
> 001    0.0045
-----------------------------------------------------------------
> --------------
Note: Failure function is calculated over full data and evaluated at indicated
      times; it is not calculated from aggregates shown at left.

         failure _d:  confirmed
   analysis time _t:  (stime_confirmed-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

              Beg.                      Failure       Std.
    Time     Total     Fail             Function     Error     [9
> 5% Conf. Int.]
-----------------------------------------------------------------
> --------------
18-<30 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      5101        5              0.0010    0.0004     0.0
> 004    0.0024
18-<30 male=1 
       0         0        0              0.0000         .        
>   .         .
      80      4739        2              0.0004    0.0003     0.0
> 001    0.0017
30-<40 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      4380        3              0.0007    0.0004     0.0
> 002    0.0021
30-<40 male=1 
       0         0        0              0.0000         .        
>   .         .
      80      4039        2              0.0005    0.0003     0.0
> 001    0.0020
40-<50 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      4080        5              0.0012    0.0005     0.0
> 005    0.0029
40-<50 male=1 
       0         0        0              0.0000         .        
>   .         .
      80      3986        3              0.0008    0.0004     0.0
> 002    0.0023
50-<60 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      4427        3              0.0007    0.0004     0.0
> 002    0.0021
50-<60 male=1 
       0         0        0              0.0000         .        
>   .         .
      80      4274        2              0.0005    0.0003     0.0
> 001    0.0019
60-<70 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      3606        4              0.0011    0.0006     0.0
> 004    0.0029
60-<70 male=1 
       0         0        0              0.0000         .        
>   .         .
      80      3313        1              0.0003    0.0003     0.0
> 000    0.0021
70-<80 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      2721        1              0.0004    0.0004     0.0
> 001    0.0026
70-<80 male=1 
       0         0        0              0.0000         .        
>   .         .
      80      2531        0              0.0000         .        
>   .         .
80+ male=0 
       0         0        0              0.0000         .        
>   .         .
      80      1614        1              0.0006    0.0006     0.0
> 001    0.0044
80+ male=1 
       0         0        0              0.0000         .        
>   .         .
      80      1571        1              0.0006    0.0006     0.0
> 001    0.0045
-----------------------------------------------------------------
> --------------
Note: Failure function is calculated over full data and evaluated at indicated
      times; it is not calculated from aggregates shown at left.

         failure _d:  tested
   analysis time _t:  (stime_tested-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

              Beg.                      Failure       Std.
    Time     Total     Fail             Function     Error     [9
> 5% Conf. Int.]
-----------------------------------------------------------------
> --------------
18-<30 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      4589      523              0.1024    0.0042     0.0
> 944    0.1111
18-<30 male=1 
       0         0        0              0.0000         .        
>   .         .
      80      4243      504              0.1063    0.0045     0.0
> 979    0.1154
30-<40 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      3961      428              0.0976    0.0045     0.0
> 892    0.1067
30-<40 male=1 
       0         0        0              0.0000         .        
>   .         .
      80      3650      394              0.0975    0.0047     0.0
> 887    0.1070
40-<50 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      3678      411              0.1005    0.0047     0.0
> 917    0.1102
40-<50 male=1 
       0         0        0              0.0000         .        
>   .         .
      80      3615      377              0.0945    0.0046     0.0
> 859    0.1040
50-<60 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      4002      432              0.0975    0.0045     0.0
> 891    0.1066
50-<60 male=1 
       0         0        0              0.0000         .        
>   .         .
      80      3830      452              0.1057    0.0047     0.0
> 969    0.1153
60-<70 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      3253      362              0.1002    0.0050     0.0
> 909    0.1105
60-<70 male=1 
       0         0        0              0.0000         .        
>   .         .
      80      2997      318              0.0960    0.0051     0.0
> 864    0.1065
70-<80 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      2451      276              0.1014    0.0058     0.0
> 906    0.1133
70-<80 male=1 
       0         0        0              0.0000         .        
>   .         .
      80      2273      259              0.1023    0.0060     0.0
> 912    0.1148
80+ male=0 
       0         0        0              0.0000         .        
>   .         .
      80      1440      175              0.1085    0.0077     0.0
> 943    0.1247
80+ male=1 
       0         0        0              0.0000         .        
>   .         .
      80      1427      147              0.0936    0.0073     0.0
> 802    0.1091
-----------------------------------------------------------------
> --------------
Note: Failure function is calculated over full data and evaluated at indicated
      times; it is not calculated from aggregates shown at left.

         failure _d:  positivetest
   analysis time _t:  (stime_positivetest-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

              Beg.                      Failure       Std.
    Time     Total     Fail             Function     Error     [9
> 5% Conf. Int.]
-----------------------------------------------------------------
> --------------
18-<30 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      4588      521              0.1020    0.0042     0.0
> 940    0.1107
18-<30 male=1 
       0         0        0              0.0000         .        
>   .         .
      80      4294      451              0.0951    0.0043     0.0
> 871    0.1038
30-<40 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      3991      398              0.0907    0.0043     0.0
> 826    0.0996
30-<40 male=1 
       0         0        0              0.0000         .        
>   .         .
      80      3654      393              0.0972    0.0047     0.0
> 885    0.1068
40-<50 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      3685      402              0.0984    0.0047     0.0
> 896    0.1079
40-<50 male=1 
       0         0        0              0.0000         .        
>   .         .
      80      3609      382              0.0958    0.0047     0.0
> 871    0.1054
50-<60 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      3992      447              0.1009    0.0045     0.0
> 924    0.1102
50-<60 male=1 
       0         0        0              0.0000         .        
>   .         .
      80      3853      429              0.1003    0.0046     0.0
> 917    0.1097
60-<70 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      3268      348              0.0964    0.0049     0.0
> 872    0.1065
60-<70 male=1 
       0         0        0              0.0000         .        
>   .         .
      80      2986      331              0.0999    0.0052     0.0
> 902    0.1106
70-<80 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      2471      256              0.0940    0.0056     0.0
> 837    0.1056
70-<80 male=1 
       0         0        0              0.0000         .        
>   .         .
      80      2265      270              0.1067    0.0061     0.0
> 953    0.1194
80+ male=0 
       0         0        0              0.0000         .        
>   .         .
      80      1457      160              0.0991    0.0074     0.0
> 855    0.1148
80+ male=1 
       0         0        0              0.0000         .        
>   .         .
      80      1407      167              0.1063    0.0078     0.0
> 920    0.1226
-----------------------------------------------------------------
> --------------
Note: Failure function is calculated over full data and evaluated at indicated
      times; it is not calculated from aggregates shown at left.

         failure _d:  ae
   analysis time _t:  (stime_ae-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

              Beg.                      Failure       Std.
    Time     Total     Fail             Function     Error     [9
> 5% Conf. Int.]
-----------------------------------------------------------------
> --------------
18-<30 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      5100        5              0.0010    0.0004     0.0
> 004    0.0024
18-<30 male=1 
       0         0        0              0.0000         .        
>   .         .
      80      4737        3              0.0006    0.0004     0.0
> 002    0.0020
30-<40 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      4382        3              0.0007    0.0004     0.0
> 002    0.0021
30-<40 male=1 
       0         0        0              0.0000         .        
>   .         .
      80      4038        4              0.0010    0.0005     0.0
> 004    0.0026
40-<50 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      4077        7              0.0017    0.0006     0.0
> 008    0.0036
40-<50 male=1 
       0         0        0              0.0000         .        
>   .         .
      80      3986        3              0.0008    0.0004     0.0
> 002    0.0023
50-<60 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      4424        4              0.0009    0.0005     0.0
> 003    0.0024
50-<60 male=1 
       0         0        0              0.0000         .        
>   .         .
      80      4275        0              0.0000         .        
>   .         .
60-<70 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      3609        0              0.0000         .        
>   .         .
60-<70 male=1 
       0         0        0              0.0000         .        
>   .         .
      80      3310        2              0.0006    0.0004     0.0
> 002    0.0024
70-<80 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      2722        1              0.0004    0.0004     0.0
> 001    0.0026
70-<80 male=1 
       0         0        0              0.0000         .        
>   .         .
      80      2530        2              0.0008    0.0006     0.0
> 002    0.0032
80+ male=0 
       0         0        0              0.0000         .        
>   .         .
      80      1614        0              0.0000         .        
>   .         .
80+ male=1 
       0         0        0              0.0000         .        
>   .         .
      80      1572        0              0.0000         .        
>   .         .
-----------------------------------------------------------------
> --------------
Note: Failure function is calculated over full data and evaluated at indicated
      times; it is not calculated from aggregates shown at left.

         failure _d:  icu
   analysis time _t:  (stime_icu-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

              Beg.                      Failure       Std.
    Time     Total     Fail             Function     Error     [9
> 5% Conf. Int.]
-----------------------------------------------------------------
> --------------
18-<30 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      5099        5              0.0010    0.0004     0.0
> 004    0.0024
18-<30 male=1 
       0         0        0              0.0000         .        
>   .         .
      80      4735        4              0.0008    0.0004     0.0
> 003    0.0022
30-<40 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      4381        2              0.0005    0.0003     0.0
> 001    0.0018
30-<40 male=1 
       0         0        0              0.0000         .        
>   .         .
      80      4038        2              0.0005    0.0003     0.0
> 001    0.0020
40-<50 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      4078        5              0.0012    0.0005     0.0
> 005    0.0029
40-<50 male=1 
       0         0        0              0.0000         .        
>   .         .
      80      3981        6              0.0015    0.0006     0.0
> 007    0.0033
50-<60 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      4424        4              0.0009    0.0005     0.0
> 003    0.0024
50-<60 male=1 
       0         0        0              0.0000         .        
>   .         .
      80      4270        5              0.0012    0.0005     0.0
> 005    0.0028
60-<70 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      3608        1              0.0003    0.0003     0.0
> 000    0.0020
60-<70 male=1 
       0         0        0              0.0000         .        
>   .         .
      80      3308        4              0.0012    0.0006     0.0
> 005    0.0032
70-<80 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      2721        1              0.0004    0.0004     0.0
> 001    0.0026
70-<80 male=1 
       0         0        0              0.0000         .        
>   .         .
      80      2526        5              0.0020    0.0009     0.0
> 008    0.0047
80+ male=0 
       0         0        0              0.0000         .        
>   .         .
      80      1613        1              0.0006    0.0006     0.0
> 001    0.0044
80+ male=1 
       0         0        0              0.0000         .        
>   .         .
      80      1572        0              0.0000         .        
>   .         .
-----------------------------------------------------------------
> --------------
Note: Failure function is calculated over full data and evaluated at indicated
      times; it is not calculated from aggregates shown at left.

         failure _d:  cpnsdeath
   analysis time _t:  (stime_cpnsdeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

              Beg.                      Failure       Std.
    Time     Total     Fail             Function     Error     [9
> 5% Conf. Int.]
-----------------------------------------------------------------
> --------------
18-<30 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      5104        4              0.0008    0.0004     0.0
> 003    0.0021
18-<30 male=1 
       0         0        0              0.0000         .        
>   .         .
      80      4742        5              0.0011    0.0005     0.0
> 004    0.0025
30-<40 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      4383        8              0.0018    0.0006     0.0
> 009    0.0036
30-<40 male=1 
       0         0        0              0.0000         .        
>   .         .
      80      4042        3              0.0007    0.0004     0.0
> 002    0.0023
40-<50 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      4086        6              0.0015    0.0006     0.0
> 007    0.0033
40-<50 male=1 
       0         0        0              0.0000         .        
>   .         .
      80      3986        5              0.0013    0.0006     0.0
> 005    0.0030
50-<60 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      4430        2              0.0005    0.0003     0.0
> 001    0.0018
50-<60 male=1 
       0         0        0              0.0000         .        
>   .         .
      80      4275        3              0.0007    0.0004     0.0
> 002    0.0022
60-<70 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      3607        7              0.0019    0.0007     0.0
> 009    0.0041
60-<70 male=1 
       0         0        0              0.0000         .        
>   .         .
      80      3313        4              0.0012    0.0006     0.0
> 005    0.0032
70-<80 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      2722        2              0.0007    0.0005     0.0
> 002    0.0029
70-<80 male=1 
       0         0        0              0.0000         .        
>   .         .
      80         0        0              0.0000         .        
>   .         .
80+ male=0 
       0         0        0              0.0000         .        
>   .         .
      80      1613        2              0.0012    0.0009     0.0
> 003    0.0049
80+ male=1 
       0         0        0              0.0000         .        
>   .         .
      80         0        0              0.0000         .        
>   .         .
-----------------------------------------------------------------
> --------------
Note: Failure function is calculated over full data and evaluated at indicated
      times; it is not calculated from aggregates shown at left.

         failure _d:  onsdeath
   analysis time _t:  (stime_onsdeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

              Beg.                      Failure       Std.
    Time     Total     Fail             Function     Error     [9
> 5% Conf. Int.]
-----------------------------------------------------------------
> --------------
18-<30 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      5104        4              0.0008    0.0004     0.0
> 003    0.0021
18-<30 male=1 
       0         0        0              0.0000         .        
>   .         .
      80      4739        7              0.0015    0.0006     0.0
> 007    0.0031
30-<40 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      4383        9              0.0021    0.0007     0.0
> 011    0.0039
30-<40 male=1 
       0         0        0              0.0000         .        
>   .         .
      80      4040        5              0.0012    0.0006     0.0
> 005    0.0030
40-<50 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      4083        9              0.0022    0.0007     0.0
> 011    0.0042
40-<50 male=1 
       0         0        0              0.0000         .        
>   .         .
      80      3987        4              0.0010    0.0005     0.0
> 004    0.0027
50-<60 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      4428        4              0.0009    0.0005     0.0
> 003    0.0024
50-<60 male=1 
       0         0        0              0.0000         .        
>   .         .
      80      4275        3              0.0007    0.0004     0.0
> 002    0.0022
60-<70 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      3609        5              0.0014    0.0006     0.0
> 006    0.0033
60-<70 male=1 
       0         0        0              0.0000         .        
>   .         .
      80      3313        5              0.0015    0.0007     0.0
> 006    0.0036
70-<80 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      2722        2              0.0007    0.0005     0.0
> 002    0.0029
70-<80 male=1 
       0         0        0              0.0000         .        
>   .         .
      80      2531        1              0.0004    0.0004     0.0
> 001    0.0028
80+ male=0 
       0         0        0              0.0000         .        
>   .         .
      80      1614        1              0.0006    0.0006     0.0
> 001    0.0044
80+ male=1 
       0         0        0              0.0000         .        
>   .         .
      80      1572        1              0.0006    0.0006     0.0
> 001    0.0045
-----------------------------------------------------------------
> --------------
Note: Failure function is calculated over full data and evaluated at indicated
      times; it is not calculated from aggregates shown at left.

         failure _d:  onscoviddeath
   analysis time _t:  (stime_onscoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

              Beg.                      Failure       Std.
    Time     Total     Fail             Function     Error     [9
> 5% Conf. Int.]
-----------------------------------------------------------------
> --------------
18-<30 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      5106        2              0.0004    0.0003     0.0
> 001    0.0016
18-<30 male=1 
       0         0        0              0.0000         .        
>   .         .
      80      4745        1              0.0002    0.0002     0.0
> 000    0.0015
30-<40 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      4389        2              0.0005    0.0003     0.0
> 001    0.0018
30-<40 male=1 
       0         0        0              0.0000         .        
>   .         .
      80      4044        1              0.0002    0.0002     0.0
> 000    0.0018
40-<50 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      4089        3              0.0007    0.0004     0.0
> 002    0.0023
40-<50 male=1 
       0         0        0              0.0000         .        
>   .         .
      80         0        0              0.0000         .        
>   .         .
50-<60 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      4430        2              0.0005    0.0003     0.0
> 001    0.0018
50-<60 male=1 
       0         0        0              0.0000         .        
>   .         .
      80      4277        1              0.0002    0.0002     0.0
> 000    0.0017
60-<70 male=0 
       0         0        0              0.0000         .        
>   .         .
      80         0        0              0.0000         .        
>   .         .
60-<70 male=1 
       0         0        0              0.0000         .        
>   .         .
      80         0        0              0.0000         .        
>   .         .
70-<80 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      2723        1              0.0004    0.0004     0.0
> 001    0.0026
70-<80 male=1 
       0         0        0              0.0000         .        
>   .         .
      80         0        0              0.0000         .        
>   .         .
80+ male=0 
       0         0        0              0.0000         .        
>   .         .
      80         0        0              0.0000         .        
>   .         .
80+ male=1 
       0         0        0              0.0000         .        
>   .         .
      80         0        0              0.0000         .        
>   .         .
-----------------------------------------------------------------
> --------------
Note: Failure function is calculated over full data and evaluated at indicated
      times; it is not calculated from aggregates shown at left.

         failure _d:  ons_noncoviddeath
   analysis time _t:  (stime_ons_noncoviddeath-origin)
             origin:  time enter_date
  enter on or after:  time enter_date
                 id:  patient_id

              Beg.                      Failure       Std.
    Time     Total     Fail             Function     Error     [9
> 5% Conf. Int.]
-----------------------------------------------------------------
> --------------
18-<30 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      5106        2              0.0004    0.0003     0.0
> 001    0.0016
18-<30 male=1 
       0         0        0              0.0000         .        
>   .         .
      80      4740        6              0.0013    0.0005     0.0
> 006    0.0028
30-<40 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      4384        7              0.0016    0.0006     0.0
> 008    0.0033
30-<40 male=1 
       0         0        0              0.0000         .        
>   .         .
      80      4041        4              0.0010    0.0005     0.0
> 004    0.0026
40-<50 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      4086        6              0.0015    0.0006     0.0
> 007    0.0033
40-<50 male=1 
       0         0        0              0.0000         .        
>   .         .
      80      3987        4              0.0010    0.0005     0.0
> 004    0.0027
50-<60 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      4430        2              0.0005    0.0003     0.0
> 001    0.0018
50-<60 male=1 
       0         0        0              0.0000         .        
>   .         .
      80      4276        2              0.0005    0.0003     0.0
> 001    0.0019
60-<70 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      3609        5              0.0014    0.0006     0.0
> 006    0.0033
60-<70 male=1 
       0         0        0              0.0000         .        
>   .         .
      80      3313        5              0.0015    0.0007     0.0
> 006    0.0036
70-<80 male=0 
       0         0        0              0.0000         .        
>   .         .
      80      2723        1              0.0004    0.0004     0.0
> 001    0.0026
70-<80 male=1 
       0         0        0              0.0000         .        
>   .         .
      80      2531        1              0.0004    0.0004     0.0
> 001    0.0028
80+ male=0 
       0         0        0              0.0000         .        
>   .         .
      80      1614        1              0.0006    0.0006     0.0
> 001    0.0044
80+ male=1 
       0         0        0              0.0000         .        
>   .         .
      80      1572        1              0.0006    0.0006     0.0
> 001    0.0045
-----------------------------------------------------------------
> --------------
Note: Failure function is calculated over full data and evaluated at indicated
      times; it is not calculated from aggregates shown at left.

. 
. * Close the log file
. log close
      name:  <unnamed>
       log:  /Users/lsh152058/Documents/GitHub/ethnicity-covid-re
> search/output/log/03_eth_an_descriptive_tables.log
  log type:  text
 closed on:  12 Jul 2020, 23:04:59
-----------------------------------------------------------------
